<?php
define('HN1', true);
require_once('./global.php');

/*----------------------------------------------------------------------------------------------------
	-- 配置
-----------------------------------------------------------------------------------------------------*/
$act  = CheckDatas( 'act', '' );


switch ( $act )
{
	/*----------------------------------------------------------------------------------------------------
		-- 帮助列表
	-----------------------------------------------------------------------------------------------------*/
	case 'list':
		$pid  = CheckDatas( 'pid', '-1' );
		$HelpTypeModel = M('help_type');
		$rs = $HelpTypeModel->getAll( array( 'pid'=>$pid ) );

		if ( $pid <= 0 || $rs == null )
		{
			include "tpl/help.php";
		}
		else
		{
			include "tpl/help_list.php";
		}

	break;

	/*----------------------------------------------------------------------------------------------------
		-- 帮助分类列表
	-----------------------------------------------------------------------------------------------------*/
	case 'article':
		$pid  = CheckDatas( 'pid', '-1' );
		$HelpModel = M('help');
		$rs = $HelpModel->getAll( array( 'type_id'=>$pid ) );

		if ( $pid <= 0 || $rs == null )
		{
			include "tpl/help.php";
		}
		else
		{
			include "tpl/help_title_list.php";
		}

	break;

	/*----------------------------------------------------------------------------------------------------
		-- 帮助文章详情
	-----------------------------------------------------------------------------------------------------*/
	case "content":
		$pid  = CheckDatas( 'pid', '-1' );
		$HelpModel = M('help');
		$row = $HelpModel->get( array( 'id'=>$pid ) );

		include "tpl/help_content_web.php";
	break;

	default:
		include "tpl/help.php";
}


?>
