<?php
return array (
  2 => 
  array (
    'id' => '2',
    'name' => '北京市',
    'child' => 
    array (
      36 => 
      array (
        'id' => '36',
        'name' => '北京市',
        'child' => 
        array (
          377 => 
          array (
            'id' => '377',
            'name' => '东城区',
          ),
          378 => 
          array (
            'id' => '378',
            'name' => '西城区',
          ),
          379 => 
          array (
            'id' => '379',
            'name' => '崇文区',
          ),
          380 => 
          array (
            'id' => '380',
            'name' => '宣武区',
          ),
          381 => 
          array (
            'id' => '381',
            'name' => '朝阳区',
          ),
          382 => 
          array (
            'id' => '382',
            'name' => '丰台区',
          ),
          383 => 
          array (
            'id' => '383',
            'name' => '石景山区',
          ),
          384 => 
          array (
            'id' => '384',
            'name' => '海淀区',
          ),
          385 => 
          array (
            'id' => '385',
            'name' => '门头沟区',
          ),
          386 => 
          array (
            'id' => '386',
            'name' => '房山区',
          ),
          387 => 
          array (
            'id' => '387',
            'name' => '通州区',
          ),
          388 => 
          array (
            'id' => '388',
            'name' => '顺义区',
          ),
          389 => 
          array (
            'id' => '389',
            'name' => '昌平区',
          ),
          390 => 
          array (
            'id' => '390',
            'name' => '大兴区',
          ),
          391 => 
          array (
            'id' => '391',
            'name' => '怀柔区',
          ),
          392 => 
          array (
            'id' => '392',
            'name' => '平谷区',
          ),
          393 => 
          array (
            'id' => '393',
            'name' => '密云县',
          ),
          394 => 
          array (
            'id' => '394',
            'name' => '延庆县',
          ),
        ),
      ),
    ),
  ),
  3 => 
  array (
    'id' => '3',
    'name' => '天津市',
    'child' => 
    array (
      37 => 
      array (
        'id' => '37',
        'name' => '天津市',
        'child' => 
        array (
          395 => 
          array (
            'id' => '395',
            'name' => '和平区',
          ),
          396 => 
          array (
            'id' => '396',
            'name' => '河东区',
          ),
          397 => 
          array (
            'id' => '397',
            'name' => '河西区',
          ),
          398 => 
          array (
            'id' => '398',
            'name' => '南开区',
          ),
          399 => 
          array (
            'id' => '399',
            'name' => '河北区',
          ),
          400 => 
          array (
            'id' => '400',
            'name' => '红桥区',
          ),
          401 => 
          array (
            'id' => '401',
            'name' => '塘沽区',
          ),
          402 => 
          array (
            'id' => '402',
            'name' => '汉沽区',
          ),
          403 => 
          array (
            'id' => '403',
            'name' => '大港区',
          ),
          404 => 
          array (
            'id' => '404',
            'name' => '东丽区',
          ),
          405 => 
          array (
            'id' => '405',
            'name' => '西青区',
          ),
          406 => 
          array (
            'id' => '406',
            'name' => '津南区',
          ),
          407 => 
          array (
            'id' => '407',
            'name' => '北辰区',
          ),
          408 => 
          array (
            'id' => '408',
            'name' => '武清区',
          ),
          409 => 
          array (
            'id' => '409',
            'name' => '宝坻区',
          ),
          410 => 
          array (
            'id' => '410',
            'name' => '宁河县',
          ),
          411 => 
          array (
            'id' => '411',
            'name' => '静海县',
          ),
          412 => 
          array (
            'id' => '412',
            'name' => '蓟县',
          ),
          413 => 
          array (
            'id' => '413',
            'name' => '保税区',
          ),
          414 => 
          array (
            'id' => '414',
            'name' => '经济技术开发区',
          ),
          415 => 
          array (
            'id' => '415',
            'name' => '高新区',
          ),
          416 => 
          array (
            'id' => '416',
            'name' => '滨海新区',
          ),
        ),
      ),
    ),
  ),
  4 => 
  array (
    'id' => '4',
    'name' => '河北省',
    'child' => 
    array (
      38 => 
      array (
        'id' => '38',
        'name' => '石家庄市',
        'child' => 
        array (
          417 => 
          array (
            'id' => '417',
            'name' => '长安区',
          ),
          418 => 
          array (
            'id' => '418',
            'name' => '桥东区',
          ),
          419 => 
          array (
            'id' => '419',
            'name' => '桥西区',
          ),
          420 => 
          array (
            'id' => '420',
            'name' => '新华区',
          ),
          421 => 
          array (
            'id' => '421',
            'name' => '井陉矿区',
          ),
          422 => 
          array (
            'id' => '422',
            'name' => '裕华区',
          ),
          423 => 
          array (
            'id' => '423',
            'name' => '井陉县',
          ),
          424 => 
          array (
            'id' => '424',
            'name' => '正定县',
          ),
          425 => 
          array (
            'id' => '425',
            'name' => '栾城县',
          ),
          426 => 
          array (
            'id' => '426',
            'name' => '行唐县',
          ),
          427 => 
          array (
            'id' => '427',
            'name' => '灵寿县',
          ),
          428 => 
          array (
            'id' => '428',
            'name' => '高邑县',
          ),
          429 => 
          array (
            'id' => '429',
            'name' => '深泽县',
          ),
          430 => 
          array (
            'id' => '430',
            'name' => '赞皇县',
          ),
          431 => 
          array (
            'id' => '431',
            'name' => '无极县',
          ),
          432 => 
          array (
            'id' => '432',
            'name' => '平山县',
          ),
          433 => 
          array (
            'id' => '433',
            'name' => '元氏县',
          ),
          434 => 
          array (
            'id' => '434',
            'name' => '赵县',
          ),
          435 => 
          array (
            'id' => '435',
            'name' => '辛集市',
          ),
          436 => 
          array (
            'id' => '436',
            'name' => '藁城市',
          ),
          437 => 
          array (
            'id' => '437',
            'name' => '晋州市',
          ),
          438 => 
          array (
            'id' => '438',
            'name' => '新乐市',
          ),
          439 => 
          array (
            'id' => '439',
            'name' => '鹿泉市',
          ),
          440 => 
          array (
            'id' => '440',
            'name' => '高新技术开发区',
          ),
        ),
      ),
      39 => 
      array (
        'id' => '39',
        'name' => '唐山市',
        'child' => 
        array (
          441 => 
          array (
            'id' => '441',
            'name' => '路南区',
          ),
          442 => 
          array (
            'id' => '442',
            'name' => '路北区',
          ),
          443 => 
          array (
            'id' => '443',
            'name' => '古冶区',
          ),
          444 => 
          array (
            'id' => '444',
            'name' => '开平区',
          ),
          445 => 
          array (
            'id' => '445',
            'name' => '丰南区',
          ),
          446 => 
          array (
            'id' => '446',
            'name' => '丰润区',
          ),
          447 => 
          array (
            'id' => '447',
            'name' => '滦县',
          ),
          448 => 
          array (
            'id' => '448',
            'name' => '滦南县',
          ),
          449 => 
          array (
            'id' => '449',
            'name' => '乐亭县',
          ),
          450 => 
          array (
            'id' => '450',
            'name' => '迁西县',
          ),
          451 => 
          array (
            'id' => '451',
            'name' => '玉田县',
          ),
          452 => 
          array (
            'id' => '452',
            'name' => '唐海县',
          ),
          453 => 
          array (
            'id' => '453',
            'name' => '遵化市',
          ),
          454 => 
          array (
            'id' => '454',
            'name' => '迁安市',
          ),
          455 => 
          array (
            'id' => '455',
            'name' => '高新区',
          ),
          456 => 
          array (
            'id' => '456',
            'name' => '汉沽管理区',
          ),
          457 => 
          array (
            'id' => '457',
            'name' => '海港开发区',
          ),
          458 => 
          array (
            'id' => '458',
            'name' => '芦台开发区',
          ),
          459 => 
          array (
            'id' => '459',
            'name' => '南堡开发区',
          ),
          460 => 
          array (
            'id' => '460',
            'name' => '曹妃甸工业区',
          ),
        ),
      ),
      40 => 
      array (
        'id' => '40',
        'name' => '秦皇岛市',
        'child' => 
        array (
          461 => 
          array (
            'id' => '461',
            'name' => '海港区',
          ),
          462 => 
          array (
            'id' => '462',
            'name' => '山海关区',
          ),
          463 => 
          array (
            'id' => '463',
            'name' => '北戴河区',
          ),
          464 => 
          array (
            'id' => '464',
            'name' => '青龙满族自治县',
          ),
          465 => 
          array (
            'id' => '465',
            'name' => '昌黎县',
          ),
          466 => 
          array (
            'id' => '466',
            'name' => '抚宁县',
          ),
          467 => 
          array (
            'id' => '467',
            'name' => '卢龙县',
          ),
          468 => 
          array (
            'id' => '468',
            'name' => '经济技术开发区',
          ),
        ),
      ),
      41 => 
      array (
        'id' => '41',
        'name' => '邯郸市',
        'child' => 
        array (
          469 => 
          array (
            'id' => '469',
            'name' => '邯山区',
          ),
          470 => 
          array (
            'id' => '470',
            'name' => '丛台区',
          ),
          471 => 
          array (
            'id' => '471',
            'name' => '复兴区',
          ),
          472 => 
          array (
            'id' => '472',
            'name' => '峰峰矿区',
          ),
          473 => 
          array (
            'id' => '473',
            'name' => '邯郸县',
          ),
          474 => 
          array (
            'id' => '474',
            'name' => '临漳县',
          ),
          475 => 
          array (
            'id' => '475',
            'name' => '成安县',
          ),
          476 => 
          array (
            'id' => '476',
            'name' => '大名县',
          ),
          477 => 
          array (
            'id' => '477',
            'name' => '涉县',
          ),
          478 => 
          array (
            'id' => '478',
            'name' => '磁县',
          ),
          479 => 
          array (
            'id' => '479',
            'name' => '肥乡县',
          ),
          480 => 
          array (
            'id' => '480',
            'name' => '永年县',
          ),
          481 => 
          array (
            'id' => '481',
            'name' => '邱县',
          ),
          482 => 
          array (
            'id' => '482',
            'name' => '鸡泽县',
          ),
          483 => 
          array (
            'id' => '483',
            'name' => '广平县',
          ),
          484 => 
          array (
            'id' => '484',
            'name' => '馆陶县',
          ),
          485 => 
          array (
            'id' => '485',
            'name' => '魏县',
          ),
          486 => 
          array (
            'id' => '486',
            'name' => '曲周县',
          ),
          487 => 
          array (
            'id' => '487',
            'name' => '武安市',
          ),
          488 => 
          array (
            'id' => '488',
            'name' => '经济开发区',
          ),
        ),
      ),
      42 => 
      array (
        'id' => '42',
        'name' => '邢台市',
        'child' => 
        array (
          489 => 
          array (
            'id' => '489',
            'name' => '桥东区',
          ),
          490 => 
          array (
            'id' => '490',
            'name' => '桥西区',
          ),
          491 => 
          array (
            'id' => '491',
            'name' => '邢台县',
          ),
          492 => 
          array (
            'id' => '492',
            'name' => '临城县',
          ),
          493 => 
          array (
            'id' => '493',
            'name' => '内丘县',
          ),
          494 => 
          array (
            'id' => '494',
            'name' => '柏乡县',
          ),
          495 => 
          array (
            'id' => '495',
            'name' => '隆尧县',
          ),
          496 => 
          array (
            'id' => '496',
            'name' => '任县',
          ),
          497 => 
          array (
            'id' => '497',
            'name' => '南和县',
          ),
          498 => 
          array (
            'id' => '498',
            'name' => '宁晋县',
          ),
          499 => 
          array (
            'id' => '499',
            'name' => '巨鹿县',
          ),
          500 => 
          array (
            'id' => '500',
            'name' => '新河县',
          ),
          501 => 
          array (
            'id' => '501',
            'name' => '广宗县',
          ),
          502 => 
          array (
            'id' => '502',
            'name' => '平乡县',
          ),
          503 => 
          array (
            'id' => '503',
            'name' => '威县',
          ),
          504 => 
          array (
            'id' => '504',
            'name' => '清河县',
          ),
          505 => 
          array (
            'id' => '505',
            'name' => '临西县',
          ),
          506 => 
          array (
            'id' => '506',
            'name' => '南宫市',
          ),
          507 => 
          array (
            'id' => '507',
            'name' => '沙河市',
          ),
        ),
      ),
      43 => 
      array (
        'id' => '43',
        'name' => '保定市',
        'child' => 
        array (
          508 => 
          array (
            'id' => '508',
            'name' => '新市区',
          ),
          509 => 
          array (
            'id' => '509',
            'name' => '南市区',
          ),
          510 => 
          array (
            'id' => '510',
            'name' => '北市区',
          ),
          511 => 
          array (
            'id' => '511',
            'name' => '满城县',
          ),
          512 => 
          array (
            'id' => '512',
            'name' => '清苑县',
          ),
          513 => 
          array (
            'id' => '513',
            'name' => '涞水县',
          ),
          514 => 
          array (
            'id' => '514',
            'name' => '阜平县',
          ),
          515 => 
          array (
            'id' => '515',
            'name' => '徐水县',
          ),
          516 => 
          array (
            'id' => '516',
            'name' => '定兴县',
          ),
          517 => 
          array (
            'id' => '517',
            'name' => '唐县',
          ),
          518 => 
          array (
            'id' => '518',
            'name' => '高阳县',
          ),
          519 => 
          array (
            'id' => '519',
            'name' => '容城县',
          ),
          520 => 
          array (
            'id' => '520',
            'name' => '涞源县',
          ),
          521 => 
          array (
            'id' => '521',
            'name' => '望都县',
          ),
          522 => 
          array (
            'id' => '522',
            'name' => '安新县',
          ),
          523 => 
          array (
            'id' => '523',
            'name' => '易县',
          ),
          524 => 
          array (
            'id' => '524',
            'name' => '曲阳县',
          ),
          525 => 
          array (
            'id' => '525',
            'name' => '蠡县',
          ),
          526 => 
          array (
            'id' => '526',
            'name' => '顺平县',
          ),
          527 => 
          array (
            'id' => '527',
            'name' => '博野县',
          ),
          528 => 
          array (
            'id' => '528',
            'name' => '雄县',
          ),
          529 => 
          array (
            'id' => '529',
            'name' => '涿州市',
          ),
          530 => 
          array (
            'id' => '530',
            'name' => '定州市',
          ),
          531 => 
          array (
            'id' => '531',
            'name' => '安国市',
          ),
          532 => 
          array (
            'id' => '532',
            'name' => '高碑店市',
          ),
        ),
      ),
      44 => 
      array (
        'id' => '44',
        'name' => '张家口市',
        'child' => 
        array (
          533 => 
          array (
            'id' => '533',
            'name' => '桥东区',
          ),
          534 => 
          array (
            'id' => '534',
            'name' => '桥西区',
          ),
          535 => 
          array (
            'id' => '535',
            'name' => '宣化区',
          ),
          536 => 
          array (
            'id' => '536',
            'name' => '下花园区',
          ),
          537 => 
          array (
            'id' => '537',
            'name' => '宣化县',
          ),
          538 => 
          array (
            'id' => '538',
            'name' => '张北县',
          ),
          539 => 
          array (
            'id' => '539',
            'name' => '康保县',
          ),
          540 => 
          array (
            'id' => '540',
            'name' => '沽源县',
          ),
          541 => 
          array (
            'id' => '541',
            'name' => '尚义县',
          ),
          542 => 
          array (
            'id' => '542',
            'name' => '蔚县',
          ),
          543 => 
          array (
            'id' => '543',
            'name' => '阳原县',
          ),
          544 => 
          array (
            'id' => '544',
            'name' => '怀安县',
          ),
          545 => 
          array (
            'id' => '545',
            'name' => '万全县',
          ),
          546 => 
          array (
            'id' => '546',
            'name' => '怀来县',
          ),
          547 => 
          array (
            'id' => '547',
            'name' => '涿鹿县',
          ),
          548 => 
          array (
            'id' => '548',
            'name' => '赤城县',
          ),
          549 => 
          array (
            'id' => '549',
            'name' => '崇礼县',
          ),
        ),
      ),
      45 => 
      array (
        'id' => '45',
        'name' => '承德市',
        'child' => 
        array (
          550 => 
          array (
            'id' => '550',
            'name' => '双桥区',
          ),
          551 => 
          array (
            'id' => '551',
            'name' => '双滦区',
          ),
          552 => 
          array (
            'id' => '552',
            'name' => '鹰手营子矿区',
          ),
          553 => 
          array (
            'id' => '553',
            'name' => '承德县',
          ),
          554 => 
          array (
            'id' => '554',
            'name' => '兴隆县',
          ),
          555 => 
          array (
            'id' => '555',
            'name' => '平泉县',
          ),
          556 => 
          array (
            'id' => '556',
            'name' => '滦平县',
          ),
          557 => 
          array (
            'id' => '557',
            'name' => '隆化县',
          ),
          558 => 
          array (
            'id' => '558',
            'name' => '丰宁满族自治县',
          ),
          559 => 
          array (
            'id' => '559',
            'name' => '宽城满族自治县',
          ),
          560 => 
          array (
            'id' => '560',
            'name' => '围场满族蒙古族自治县',
          ),
        ),
      ),
      46 => 
      array (
        'id' => '46',
        'name' => '沧州市',
        'child' => 
        array (
          561 => 
          array (
            'id' => '561',
            'name' => '新华区',
          ),
          562 => 
          array (
            'id' => '562',
            'name' => '运河区',
          ),
          563 => 
          array (
            'id' => '563',
            'name' => '沧县',
          ),
          564 => 
          array (
            'id' => '564',
            'name' => '青县',
          ),
          565 => 
          array (
            'id' => '565',
            'name' => '东光县',
          ),
          566 => 
          array (
            'id' => '566',
            'name' => '海兴县',
          ),
          567 => 
          array (
            'id' => '567',
            'name' => '盐山县',
          ),
          568 => 
          array (
            'id' => '568',
            'name' => '肃宁县',
          ),
          569 => 
          array (
            'id' => '569',
            'name' => '南皮县',
          ),
          570 => 
          array (
            'id' => '570',
            'name' => '吴桥县',
          ),
          571 => 
          array (
            'id' => '571',
            'name' => '献县',
          ),
          572 => 
          array (
            'id' => '572',
            'name' => '孟村回族自治县',
          ),
          573 => 
          array (
            'id' => '573',
            'name' => '泊头市',
          ),
          574 => 
          array (
            'id' => '574',
            'name' => '任丘市',
          ),
          575 => 
          array (
            'id' => '575',
            'name' => '黄骅市',
          ),
          576 => 
          array (
            'id' => '576',
            'name' => '河间市',
          ),
        ),
      ),
      47 => 
      array (
        'id' => '47',
        'name' => '廊坊市',
        'child' => 
        array (
          577 => 
          array (
            'id' => '577',
            'name' => '安次区',
          ),
          578 => 
          array (
            'id' => '578',
            'name' => '广阳区',
          ),
          579 => 
          array (
            'id' => '579',
            'name' => '固安县',
          ),
          580 => 
          array (
            'id' => '580',
            'name' => '永清县',
          ),
          581 => 
          array (
            'id' => '581',
            'name' => '香河县',
          ),
          582 => 
          array (
            'id' => '582',
            'name' => '大城县',
          ),
          583 => 
          array (
            'id' => '583',
            'name' => '文安县',
          ),
          584 => 
          array (
            'id' => '584',
            'name' => '大厂回族自治县',
          ),
          585 => 
          array (
            'id' => '585',
            'name' => '霸州市',
          ),
          586 => 
          array (
            'id' => '586',
            'name' => '三河市',
          ),
          587 => 
          array (
            'id' => '587',
            'name' => '开发区',
          ),
        ),
      ),
      48 => 
      array (
        'id' => '48',
        'name' => '衡水市',
        'child' => 
        array (
          588 => 
          array (
            'id' => '588',
            'name' => '桃城区',
          ),
          589 => 
          array (
            'id' => '589',
            'name' => '枣强县',
          ),
          590 => 
          array (
            'id' => '590',
            'name' => '武邑县',
          ),
          591 => 
          array (
            'id' => '591',
            'name' => '武强县',
          ),
          592 => 
          array (
            'id' => '592',
            'name' => '饶阳县',
          ),
          593 => 
          array (
            'id' => '593',
            'name' => '安平县',
          ),
          594 => 
          array (
            'id' => '594',
            'name' => '故城县',
          ),
          595 => 
          array (
            'id' => '595',
            'name' => '景县',
          ),
          596 => 
          array (
            'id' => '596',
            'name' => '阜城县',
          ),
          597 => 
          array (
            'id' => '597',
            'name' => '冀州市',
          ),
          598 => 
          array (
            'id' => '598',
            'name' => '深州市',
          ),
        ),
      ),
    ),
  ),
  5 => 
  array (
    'id' => '5',
    'name' => '山西省',
    'child' => 
    array (
      49 => 
      array (
        'id' => '49',
        'name' => '太原市',
        'child' => 
        array (
          599 => 
          array (
            'id' => '599',
            'name' => '小店区',
          ),
          600 => 
          array (
            'id' => '600',
            'name' => '迎泽区',
          ),
          601 => 
          array (
            'id' => '601',
            'name' => '杏花岭区',
          ),
          602 => 
          array (
            'id' => '602',
            'name' => '尖草坪区',
          ),
          603 => 
          array (
            'id' => '603',
            'name' => '万柏林区',
          ),
          604 => 
          array (
            'id' => '604',
            'name' => '晋源区',
          ),
          605 => 
          array (
            'id' => '605',
            'name' => '清徐县',
          ),
          606 => 
          array (
            'id' => '606',
            'name' => '阳曲县',
          ),
          607 => 
          array (
            'id' => '607',
            'name' => '娄烦县',
          ),
          608 => 
          array (
            'id' => '608',
            'name' => '古交市',
          ),
        ),
      ),
      50 => 
      array (
        'id' => '50',
        'name' => '大同市',
        'child' => 
        array (
          609 => 
          array (
            'id' => '609',
            'name' => '城区',
          ),
          610 => 
          array (
            'id' => '610',
            'name' => '矿区',
          ),
          611 => 
          array (
            'id' => '611',
            'name' => '南郊区',
          ),
          612 => 
          array (
            'id' => '612',
            'name' => '新荣区',
          ),
          613 => 
          array (
            'id' => '613',
            'name' => '阳高县',
          ),
          614 => 
          array (
            'id' => '614',
            'name' => '天镇县',
          ),
          615 => 
          array (
            'id' => '615',
            'name' => '广灵县',
          ),
          616 => 
          array (
            'id' => '616',
            'name' => '灵丘县',
          ),
          617 => 
          array (
            'id' => '617',
            'name' => '浑源县',
          ),
          618 => 
          array (
            'id' => '618',
            'name' => '左云县',
          ),
          619 => 
          array (
            'id' => '619',
            'name' => '大同县',
          ),
        ),
      ),
      51 => 
      array (
        'id' => '51',
        'name' => '阳泉市',
        'child' => 
        array (
          620 => 
          array (
            'id' => '620',
            'name' => '城区',
          ),
          621 => 
          array (
            'id' => '621',
            'name' => '矿区',
          ),
          622 => 
          array (
            'id' => '622',
            'name' => '郊区',
          ),
          623 => 
          array (
            'id' => '623',
            'name' => '平定县',
          ),
          624 => 
          array (
            'id' => '624',
            'name' => '盂县',
          ),
        ),
      ),
      52 => 
      array (
        'id' => '52',
        'name' => '长治市',
        'child' => 
        array (
          625 => 
          array (
            'id' => '625',
            'name' => '城区',
          ),
          626 => 
          array (
            'id' => '626',
            'name' => '郊区',
          ),
          627 => 
          array (
            'id' => '627',
            'name' => '长治县',
          ),
          628 => 
          array (
            'id' => '628',
            'name' => '襄垣县',
          ),
          629 => 
          array (
            'id' => '629',
            'name' => '屯留县',
          ),
          630 => 
          array (
            'id' => '630',
            'name' => '平顺县',
          ),
          631 => 
          array (
            'id' => '631',
            'name' => '黎城县',
          ),
          632 => 
          array (
            'id' => '632',
            'name' => '壶关县',
          ),
          633 => 
          array (
            'id' => '633',
            'name' => '长子县',
          ),
          634 => 
          array (
            'id' => '634',
            'name' => '武乡县',
          ),
          635 => 
          array (
            'id' => '635',
            'name' => '沁县',
          ),
          636 => 
          array (
            'id' => '636',
            'name' => '沁源县',
          ),
          637 => 
          array (
            'id' => '637',
            'name' => '潞城市',
          ),
        ),
      ),
      53 => 
      array (
        'id' => '53',
        'name' => '晋城市',
        'child' => 
        array (
          638 => 
          array (
            'id' => '638',
            'name' => '城区',
          ),
          639 => 
          array (
            'id' => '639',
            'name' => '沁水县',
          ),
          640 => 
          array (
            'id' => '640',
            'name' => '阳城县',
          ),
          641 => 
          array (
            'id' => '641',
            'name' => '陵川县',
          ),
          642 => 
          array (
            'id' => '642',
            'name' => '泽州县',
          ),
          643 => 
          array (
            'id' => '643',
            'name' => '高平市',
          ),
        ),
      ),
      54 => 
      array (
        'id' => '54',
        'name' => '朔州市',
        'child' => 
        array (
          644 => 
          array (
            'id' => '644',
            'name' => '朔城区',
          ),
          645 => 
          array (
            'id' => '645',
            'name' => '平鲁区',
          ),
          646 => 
          array (
            'id' => '646',
            'name' => '山阴县',
          ),
          647 => 
          array (
            'id' => '647',
            'name' => '应县',
          ),
          648 => 
          array (
            'id' => '648',
            'name' => '右玉县',
          ),
          649 => 
          array (
            'id' => '649',
            'name' => '怀仁县',
          ),
        ),
      ),
      55 => 
      array (
        'id' => '55',
        'name' => '晋中市',
        'child' => 
        array (
          650 => 
          array (
            'id' => '650',
            'name' => '榆次区',
          ),
          651 => 
          array (
            'id' => '651',
            'name' => '榆社县',
          ),
          652 => 
          array (
            'id' => '652',
            'name' => '左权县',
          ),
          653 => 
          array (
            'id' => '653',
            'name' => '和顺县',
          ),
          654 => 
          array (
            'id' => '654',
            'name' => '昔阳县',
          ),
          655 => 
          array (
            'id' => '655',
            'name' => '寿阳县',
          ),
          656 => 
          array (
            'id' => '656',
            'name' => '太谷县',
          ),
          657 => 
          array (
            'id' => '657',
            'name' => '祁县',
          ),
          658 => 
          array (
            'id' => '658',
            'name' => '平遥县',
          ),
          659 => 
          array (
            'id' => '659',
            'name' => '灵石县',
          ),
          660 => 
          array (
            'id' => '660',
            'name' => '介休市',
          ),
        ),
      ),
      56 => 
      array (
        'id' => '56',
        'name' => '运城市',
        'child' => 
        array (
          661 => 
          array (
            'id' => '661',
            'name' => '盐湖区',
          ),
          662 => 
          array (
            'id' => '662',
            'name' => '临猗县',
          ),
          663 => 
          array (
            'id' => '663',
            'name' => '万荣县',
          ),
          664 => 
          array (
            'id' => '664',
            'name' => '闻喜县',
          ),
          665 => 
          array (
            'id' => '665',
            'name' => '稷山县',
          ),
          666 => 
          array (
            'id' => '666',
            'name' => '新绛县',
          ),
          667 => 
          array (
            'id' => '667',
            'name' => '绛县',
          ),
          668 => 
          array (
            'id' => '668',
            'name' => '垣曲县',
          ),
          669 => 
          array (
            'id' => '669',
            'name' => '夏县',
          ),
          670 => 
          array (
            'id' => '670',
            'name' => '平陆县',
          ),
          671 => 
          array (
            'id' => '671',
            'name' => '芮城县',
          ),
          672 => 
          array (
            'id' => '672',
            'name' => '永济市',
          ),
          673 => 
          array (
            'id' => '673',
            'name' => '河津市',
          ),
        ),
      ),
      57 => 
      array (
        'id' => '57',
        'name' => '忻州市',
        'child' => 
        array (
          674 => 
          array (
            'id' => '674',
            'name' => '忻府区',
          ),
          675 => 
          array (
            'id' => '675',
            'name' => '定襄县',
          ),
          676 => 
          array (
            'id' => '676',
            'name' => '五台县',
          ),
          677 => 
          array (
            'id' => '677',
            'name' => '代县',
          ),
          678 => 
          array (
            'id' => '678',
            'name' => '繁峙县',
          ),
          679 => 
          array (
            'id' => '679',
            'name' => '宁武县',
          ),
          680 => 
          array (
            'id' => '680',
            'name' => '静乐县',
          ),
          681 => 
          array (
            'id' => '681',
            'name' => '神池县',
          ),
          682 => 
          array (
            'id' => '682',
            'name' => '五寨县',
          ),
          683 => 
          array (
            'id' => '683',
            'name' => '岢岚县',
          ),
          684 => 
          array (
            'id' => '684',
            'name' => '河曲县',
          ),
          685 => 
          array (
            'id' => '685',
            'name' => '保德县',
          ),
          686 => 
          array (
            'id' => '686',
            'name' => '偏关县',
          ),
          687 => 
          array (
            'id' => '687',
            'name' => '原平市',
          ),
        ),
      ),
      58 => 
      array (
        'id' => '58',
        'name' => '临汾市',
        'child' => 
        array (
          688 => 
          array (
            'id' => '688',
            'name' => '尧都区',
          ),
          689 => 
          array (
            'id' => '689',
            'name' => '曲沃县',
          ),
          690 => 
          array (
            'id' => '690',
            'name' => '翼城县',
          ),
          691 => 
          array (
            'id' => '691',
            'name' => '襄汾县',
          ),
          692 => 
          array (
            'id' => '692',
            'name' => '洪洞县',
          ),
          693 => 
          array (
            'id' => '693',
            'name' => '古县',
          ),
          694 => 
          array (
            'id' => '694',
            'name' => '安泽县',
          ),
          695 => 
          array (
            'id' => '695',
            'name' => '浮山县',
          ),
          696 => 
          array (
            'id' => '696',
            'name' => '吉县',
          ),
          697 => 
          array (
            'id' => '697',
            'name' => '乡宁县',
          ),
          698 => 
          array (
            'id' => '698',
            'name' => '大宁县',
          ),
          699 => 
          array (
            'id' => '699',
            'name' => '隰县',
          ),
          700 => 
          array (
            'id' => '700',
            'name' => '永和县',
          ),
          701 => 
          array (
            'id' => '701',
            'name' => '蒲县',
          ),
          702 => 
          array (
            'id' => '702',
            'name' => '汾西县',
          ),
          703 => 
          array (
            'id' => '703',
            'name' => '侯马市',
          ),
          704 => 
          array (
            'id' => '704',
            'name' => '霍州市',
          ),
        ),
      ),
      59 => 
      array (
        'id' => '59',
        'name' => '吕梁市',
        'child' => 
        array (
          705 => 
          array (
            'id' => '705',
            'name' => '离石区',
          ),
          706 => 
          array (
            'id' => '706',
            'name' => '文水县',
          ),
          707 => 
          array (
            'id' => '707',
            'name' => '交城县',
          ),
          708 => 
          array (
            'id' => '708',
            'name' => '兴县',
          ),
          709 => 
          array (
            'id' => '709',
            'name' => '临县',
          ),
          710 => 
          array (
            'id' => '710',
            'name' => '柳林县',
          ),
          711 => 
          array (
            'id' => '711',
            'name' => '石楼县',
          ),
          712 => 
          array (
            'id' => '712',
            'name' => '岚县',
          ),
          713 => 
          array (
            'id' => '713',
            'name' => '方山县',
          ),
          714 => 
          array (
            'id' => '714',
            'name' => '中阳县',
          ),
          715 => 
          array (
            'id' => '715',
            'name' => '交口县',
          ),
          716 => 
          array (
            'id' => '716',
            'name' => '孝义市',
          ),
          717 => 
          array (
            'id' => '717',
            'name' => '汾阳市',
          ),
        ),
      ),
    ),
  ),
  6 => 
  array (
    'id' => '6',
    'name' => '内蒙古自治区',
    'child' => 
    array (
      60 => 
      array (
        'id' => '60',
        'name' => '呼和浩特市',
        'child' => 
        array (
          718 => 
          array (
            'id' => '718',
            'name' => '回民区',
          ),
          719 => 
          array (
            'id' => '719',
            'name' => '玉泉区',
          ),
          720 => 
          array (
            'id' => '720',
            'name' => '新城区',
          ),
          721 => 
          array (
            'id' => '721',
            'name' => '赛罕区',
          ),
          722 => 
          array (
            'id' => '722',
            'name' => '土默特左旗',
          ),
          723 => 
          array (
            'id' => '723',
            'name' => '托克托县',
          ),
          724 => 
          array (
            'id' => '724',
            'name' => '和林格尔县',
          ),
          725 => 
          array (
            'id' => '725',
            'name' => '清水河县',
          ),
          726 => 
          array (
            'id' => '726',
            'name' => '武川县',
          ),
        ),
      ),
      61 => 
      array (
        'id' => '61',
        'name' => '包头市',
        'child' => 
        array (
          727 => 
          array (
            'id' => '727',
            'name' => '东河区',
          ),
          728 => 
          array (
            'id' => '728',
            'name' => '昆都仑区',
          ),
          729 => 
          array (
            'id' => '729',
            'name' => '青山区',
          ),
          730 => 
          array (
            'id' => '730',
            'name' => '石拐区',
          ),
          731 => 
          array (
            'id' => '731',
            'name' => '白云矿区',
          ),
          732 => 
          array (
            'id' => '732',
            'name' => '九原区',
          ),
          733 => 
          array (
            'id' => '733',
            'name' => '土默特右旗',
          ),
          734 => 
          array (
            'id' => '734',
            'name' => '固阳县',
          ),
          735 => 
          array (
            'id' => '735',
            'name' => '达尔罕茂明安联合旗',
          ),
        ),
      ),
      62 => 
      array (
        'id' => '62',
        'name' => '乌海市',
        'child' => 
        array (
          736 => 
          array (
            'id' => '736',
            'name' => '海勃湾区',
          ),
          737 => 
          array (
            'id' => '737',
            'name' => '海南区',
          ),
          738 => 
          array (
            'id' => '738',
            'name' => '乌达区',
          ),
        ),
      ),
      63 => 
      array (
        'id' => '63',
        'name' => '赤峰市',
        'child' => 
        array (
          739 => 
          array (
            'id' => '739',
            'name' => '红山区',
          ),
          740 => 
          array (
            'id' => '740',
            'name' => '元宝山区',
          ),
          741 => 
          array (
            'id' => '741',
            'name' => '松山区',
          ),
          742 => 
          array (
            'id' => '742',
            'name' => '阿鲁科尔沁旗',
          ),
          743 => 
          array (
            'id' => '743',
            'name' => '巴林左旗',
          ),
          744 => 
          array (
            'id' => '744',
            'name' => '巴林右旗',
          ),
          745 => 
          array (
            'id' => '745',
            'name' => '林西县',
          ),
          746 => 
          array (
            'id' => '746',
            'name' => '克什克腾旗',
          ),
          747 => 
          array (
            'id' => '747',
            'name' => '翁牛特旗',
          ),
          748 => 
          array (
            'id' => '748',
            'name' => '喀喇沁旗',
          ),
          749 => 
          array (
            'id' => '749',
            'name' => '宁城县',
          ),
          750 => 
          array (
            'id' => '750',
            'name' => '敖汉旗',
          ),
          751 => 
          array (
            'id' => '751',
            'name' => '新城区',
          ),
        ),
      ),
      64 => 
      array (
        'id' => '64',
        'name' => '通辽市',
        'child' => 
        array (
          752 => 
          array (
            'id' => '752',
            'name' => '科尔沁区',
          ),
          753 => 
          array (
            'id' => '753',
            'name' => '科尔沁左翼中旗',
          ),
          754 => 
          array (
            'id' => '754',
            'name' => '科尔沁左翼后旗',
          ),
          755 => 
          array (
            'id' => '755',
            'name' => '开鲁县',
          ),
          756 => 
          array (
            'id' => '756',
            'name' => '库伦旗',
          ),
          757 => 
          array (
            'id' => '757',
            'name' => '奈曼旗',
          ),
          758 => 
          array (
            'id' => '758',
            'name' => '扎鲁特旗',
          ),
          759 => 
          array (
            'id' => '759',
            'name' => '霍林郭勒市',
          ),
        ),
      ),
      65 => 
      array (
        'id' => '65',
        'name' => '鄂尔多斯市',
        'child' => 
        array (
          760 => 
          array (
            'id' => '760',
            'name' => '东胜区',
          ),
          761 => 
          array (
            'id' => '761',
            'name' => '达拉特旗',
          ),
          762 => 
          array (
            'id' => '762',
            'name' => '准格尔旗',
          ),
          763 => 
          array (
            'id' => '763',
            'name' => '鄂托克前旗',
          ),
          764 => 
          array (
            'id' => '764',
            'name' => '鄂托克旗',
          ),
          765 => 
          array (
            'id' => '765',
            'name' => '杭锦旗',
          ),
          766 => 
          array (
            'id' => '766',
            'name' => '乌审旗',
          ),
          767 => 
          array (
            'id' => '767',
            'name' => '伊金霍洛旗',
          ),
        ),
      ),
      66 => 
      array (
        'id' => '66',
        'name' => '呼伦贝尔市',
        'child' => 
        array (
          768 => 
          array (
            'id' => '768',
            'name' => '海拉尔区',
          ),
          769 => 
          array (
            'id' => '769',
            'name' => '阿荣旗',
          ),
          770 => 
          array (
            'id' => '770',
            'name' => '莫力达瓦达斡尔族自治旗',
          ),
          771 => 
          array (
            'id' => '771',
            'name' => '鄂伦春自治旗',
          ),
          772 => 
          array (
            'id' => '772',
            'name' => '鄂温克族自治旗',
          ),
          773 => 
          array (
            'id' => '773',
            'name' => '陈巴尔虎旗',
          ),
          774 => 
          array (
            'id' => '774',
            'name' => '新巴尔虎左旗',
          ),
          775 => 
          array (
            'id' => '775',
            'name' => '新巴尔虎右旗',
          ),
          776 => 
          array (
            'id' => '776',
            'name' => '满洲里市',
          ),
          777 => 
          array (
            'id' => '777',
            'name' => '牙克石市',
          ),
          778 => 
          array (
            'id' => '778',
            'name' => '扎兰屯市',
          ),
          779 => 
          array (
            'id' => '779',
            'name' => '额尔古纳市',
          ),
          780 => 
          array (
            'id' => '780',
            'name' => '根河市',
          ),
        ),
      ),
      67 => 
      array (
        'id' => '67',
        'name' => '巴彦淖尔市',
        'child' => 
        array (
          781 => 
          array (
            'id' => '781',
            'name' => '临河区',
          ),
          782 => 
          array (
            'id' => '782',
            'name' => '五原县',
          ),
          783 => 
          array (
            'id' => '783',
            'name' => '磴口县',
          ),
          784 => 
          array (
            'id' => '784',
            'name' => '乌拉特前旗',
          ),
          785 => 
          array (
            'id' => '785',
            'name' => '乌拉特中旗',
          ),
          786 => 
          array (
            'id' => '786',
            'name' => '乌拉特后旗',
          ),
          787 => 
          array (
            'id' => '787',
            'name' => '杭锦后旗',
          ),
        ),
      ),
      68 => 
      array (
        'id' => '68',
        'name' => '乌兰察布市',
        'child' => 
        array (
          788 => 
          array (
            'id' => '788',
            'name' => '集宁区',
          ),
          789 => 
          array (
            'id' => '789',
            'name' => '卓资县',
          ),
          790 => 
          array (
            'id' => '790',
            'name' => '化德县',
          ),
          791 => 
          array (
            'id' => '791',
            'name' => '商都县',
          ),
          792 => 
          array (
            'id' => '792',
            'name' => '兴和县',
          ),
          793 => 
          array (
            'id' => '793',
            'name' => '凉城县',
          ),
          794 => 
          array (
            'id' => '794',
            'name' => '察哈尔右翼前旗',
          ),
          795 => 
          array (
            'id' => '795',
            'name' => '察哈尔右翼中旗',
          ),
          796 => 
          array (
            'id' => '796',
            'name' => '察哈尔右翼后旗',
          ),
          797 => 
          array (
            'id' => '797',
            'name' => '四子王旗',
          ),
          798 => 
          array (
            'id' => '798',
            'name' => '丰镇市',
          ),
        ),
      ),
      69 => 
      array (
        'id' => '69',
        'name' => '兴安盟',
        'child' => 
        array (
          799 => 
          array (
            'id' => '799',
            'name' => '乌兰浩特市',
          ),
          800 => 
          array (
            'id' => '800',
            'name' => '阿尔山市',
          ),
          801 => 
          array (
            'id' => '801',
            'name' => '科尔沁右翼前旗',
          ),
          802 => 
          array (
            'id' => '802',
            'name' => '科尔沁右翼中旗',
          ),
          803 => 
          array (
            'id' => '803',
            'name' => '扎赉特旗',
          ),
          804 => 
          array (
            'id' => '804',
            'name' => '突泉县',
          ),
        ),
      ),
      70 => 
      array (
        'id' => '70',
        'name' => '锡林郭勒盟',
        'child' => 
        array (
          805 => 
          array (
            'id' => '805',
            'name' => '二连浩特市',
          ),
          806 => 
          array (
            'id' => '806',
            'name' => '锡林浩特市',
          ),
          807 => 
          array (
            'id' => '807',
            'name' => '阿巴嘎旗',
          ),
          808 => 
          array (
            'id' => '808',
            'name' => '苏尼特左旗',
          ),
          809 => 
          array (
            'id' => '809',
            'name' => '苏尼特右旗',
          ),
          810 => 
          array (
            'id' => '810',
            'name' => '东乌珠穆沁旗',
          ),
          811 => 
          array (
            'id' => '811',
            'name' => '西乌珠穆沁旗',
          ),
          812 => 
          array (
            'id' => '812',
            'name' => '太仆寺旗',
          ),
          813 => 
          array (
            'id' => '813',
            'name' => '镶黄旗',
          ),
          814 => 
          array (
            'id' => '814',
            'name' => '正镶白旗',
          ),
          815 => 
          array (
            'id' => '815',
            'name' => '正蓝旗',
          ),
          816 => 
          array (
            'id' => '816',
            'name' => '多伦县',
          ),
        ),
      ),
      71 => 
      array (
        'id' => '71',
        'name' => '阿拉善盟',
        'child' => 
        array (
          817 => 
          array (
            'id' => '817',
            'name' => '阿拉善左旗',
          ),
          818 => 
          array (
            'id' => '818',
            'name' => '阿拉善右旗',
          ),
          819 => 
          array (
            'id' => '819',
            'name' => '额济纳旗',
          ),
        ),
      ),
    ),
  ),
  7 => 
  array (
    'id' => '7',
    'name' => '辽宁省',
    'child' => 
    array (
      72 => 
      array (
        'id' => '72',
        'name' => '沈阳市',
        'child' => 
        array (
          820 => 
          array (
            'id' => '820',
            'name' => '和平区',
          ),
          821 => 
          array (
            'id' => '821',
            'name' => '沈河区',
          ),
          822 => 
          array (
            'id' => '822',
            'name' => '大东区',
          ),
          823 => 
          array (
            'id' => '823',
            'name' => '皇姑区',
          ),
          824 => 
          array (
            'id' => '824',
            'name' => '铁西区',
          ),
          825 => 
          array (
            'id' => '825',
            'name' => '苏家屯区',
          ),
          826 => 
          array (
            'id' => '826',
            'name' => '东陵区',
          ),
          827 => 
          array (
            'id' => '827',
            'name' => '沈北新区',
          ),
          828 => 
          array (
            'id' => '828',
            'name' => '于洪区',
          ),
          829 => 
          array (
            'id' => '829',
            'name' => '辽中县',
          ),
          830 => 
          array (
            'id' => '830',
            'name' => '康平县',
          ),
          831 => 
          array (
            'id' => '831',
            'name' => '法库县',
          ),
          832 => 
          array (
            'id' => '832',
            'name' => '新民市',
          ),
          833 => 
          array (
            'id' => '833',
            'name' => '经济技术开发区',
          ),
          834 => 
          array (
            'id' => '834',
            'name' => '浑南新区',
          ),
          835 => 
          array (
            'id' => '835',
            'name' => '新城子经济技术开发区',
          ),
        ),
      ),
      73 => 
      array (
        'id' => '73',
        'name' => '大连市',
        'child' => 
        array (
          836 => 
          array (
            'id' => '836',
            'name' => '中山区',
          ),
          837 => 
          array (
            'id' => '837',
            'name' => '西岗区',
          ),
          838 => 
          array (
            'id' => '838',
            'name' => '沙河口区',
          ),
          839 => 
          array (
            'id' => '839',
            'name' => '甘井子区',
          ),
          840 => 
          array (
            'id' => '840',
            'name' => '旅顺口区',
          ),
          841 => 
          array (
            'id' => '841',
            'name' => '金州区',
          ),
          842 => 
          array (
            'id' => '842',
            'name' => '长海县',
          ),
          843 => 
          array (
            'id' => '843',
            'name' => '瓦房店市',
          ),
          844 => 
          array (
            'id' => '844',
            'name' => '普兰店市',
          ),
          845 => 
          array (
            'id' => '845',
            'name' => '庄河市',
          ),
          846 => 
          array (
            'id' => '846',
            'name' => '开发区',
          ),
          847 => 
          array (
            'id' => '847',
            'name' => '保税区',
          ),
        ),
      ),
      74 => 
      array (
        'id' => '74',
        'name' => '鞍山市',
        'child' => 
        array (
          848 => 
          array (
            'id' => '848',
            'name' => '铁东区',
          ),
          849 => 
          array (
            'id' => '849',
            'name' => '铁西区',
          ),
          850 => 
          array (
            'id' => '850',
            'name' => '立山区',
          ),
          851 => 
          array (
            'id' => '851',
            'name' => '千山区',
          ),
          852 => 
          array (
            'id' => '852',
            'name' => '台安县',
          ),
          853 => 
          array (
            'id' => '853',
            'name' => '岫岩满族自治县',
          ),
          854 => 
          array (
            'id' => '854',
            'name' => '海城市',
          ),
        ),
      ),
      75 => 
      array (
        'id' => '75',
        'name' => '抚顺市',
        'child' => 
        array (
          855 => 
          array (
            'id' => '855',
            'name' => '新抚区',
          ),
          856 => 
          array (
            'id' => '856',
            'name' => '东洲区',
          ),
          857 => 
          array (
            'id' => '857',
            'name' => '望花区',
          ),
          858 => 
          array (
            'id' => '858',
            'name' => '顺城区',
          ),
          859 => 
          array (
            'id' => '859',
            'name' => '抚顺县',
          ),
          860 => 
          array (
            'id' => '860',
            'name' => '新宾满族自治县',
          ),
          861 => 
          array (
            'id' => '861',
            'name' => '清原满族自治县',
          ),
        ),
      ),
      76 => 
      array (
        'id' => '76',
        'name' => '本溪市',
        'child' => 
        array (
          862 => 
          array (
            'id' => '862',
            'name' => '平山区',
          ),
          863 => 
          array (
            'id' => '863',
            'name' => '明山区',
          ),
          864 => 
          array (
            'id' => '864',
            'name' => '溪湖区',
          ),
          865 => 
          array (
            'id' => '865',
            'name' => '南芬区',
          ),
          866 => 
          array (
            'id' => '866',
            'name' => '本溪满族自治县',
          ),
          867 => 
          array (
            'id' => '867',
            'name' => '桓仁满族自治县',
          ),
        ),
      ),
      77 => 
      array (
        'id' => '77',
        'name' => '丹东市',
        'child' => 
        array (
          868 => 
          array (
            'id' => '868',
            'name' => '元宝区',
          ),
          869 => 
          array (
            'id' => '869',
            'name' => '振兴区',
          ),
          870 => 
          array (
            'id' => '870',
            'name' => '振安区',
          ),
          871 => 
          array (
            'id' => '871',
            'name' => '宽甸满族自治县',
          ),
          872 => 
          array (
            'id' => '872',
            'name' => '东港市',
          ),
          873 => 
          array (
            'id' => '873',
            'name' => '凤城市',
          ),
        ),
      ),
      78 => 
      array (
        'id' => '78',
        'name' => '锦州市',
        'child' => 
        array (
          874 => 
          array (
            'id' => '874',
            'name' => '古塔区',
          ),
          875 => 
          array (
            'id' => '875',
            'name' => '凌河区',
          ),
          876 => 
          array (
            'id' => '876',
            'name' => '太和区',
          ),
          877 => 
          array (
            'id' => '877',
            'name' => '黑山县',
          ),
          878 => 
          array (
            'id' => '878',
            'name' => '义县',
          ),
          879 => 
          array (
            'id' => '879',
            'name' => '凌海市',
          ),
          880 => 
          array (
            'id' => '880',
            'name' => '北宁市',
          ),
          881 => 
          array (
            'id' => '881',
            'name' => '松山新区',
          ),
          882 => 
          array (
            'id' => '882',
            'name' => '经济技术开发区',
          ),
        ),
      ),
      79 => 
      array (
        'id' => '79',
        'name' => '营口市',
        'child' => 
        array (
          883 => 
          array (
            'id' => '883',
            'name' => '站前区',
          ),
          884 => 
          array (
            'id' => '884',
            'name' => '西市区',
          ),
          885 => 
          array (
            'id' => '885',
            'name' => '鲅鱼圈区',
          ),
          886 => 
          array (
            'id' => '886',
            'name' => '老边区',
          ),
          887 => 
          array (
            'id' => '887',
            'name' => '盖州市',
          ),
          888 => 
          array (
            'id' => '888',
            'name' => '大石桥市',
          ),
        ),
      ),
      80 => 
      array (
        'id' => '80',
        'name' => '阜新市',
        'child' => 
        array (
          889 => 
          array (
            'id' => '889',
            'name' => '海州区',
          ),
          890 => 
          array (
            'id' => '890',
            'name' => '新邱区',
          ),
          891 => 
          array (
            'id' => '891',
            'name' => '太平区',
          ),
          892 => 
          array (
            'id' => '892',
            'name' => '清河门区',
          ),
          893 => 
          array (
            'id' => '893',
            'name' => '细河区',
          ),
          894 => 
          array (
            'id' => '894',
            'name' => '阜新蒙古族自治县',
          ),
          895 => 
          array (
            'id' => '895',
            'name' => '彰武县',
          ),
        ),
      ),
      81 => 
      array (
        'id' => '81',
        'name' => '辽阳市',
        'child' => 
        array (
          896 => 
          array (
            'id' => '896',
            'name' => '白塔区',
          ),
          897 => 
          array (
            'id' => '897',
            'name' => '文圣区',
          ),
          898 => 
          array (
            'id' => '898',
            'name' => '宏伟区',
          ),
          899 => 
          array (
            'id' => '899',
            'name' => '弓长岭区',
          ),
          900 => 
          array (
            'id' => '900',
            'name' => '太子河区',
          ),
          901 => 
          array (
            'id' => '901',
            'name' => '辽阳县',
          ),
          902 => 
          array (
            'id' => '902',
            'name' => '灯塔市',
          ),
        ),
      ),
      82 => 
      array (
        'id' => '82',
        'name' => '盘锦市',
        'child' => 
        array (
          903 => 
          array (
            'id' => '903',
            'name' => '双台子区',
          ),
          904 => 
          array (
            'id' => '904',
            'name' => '兴隆台区',
          ),
          905 => 
          array (
            'id' => '905',
            'name' => '大洼县',
          ),
          906 => 
          array (
            'id' => '906',
            'name' => '盘山县',
          ),
        ),
      ),
      83 => 
      array (
        'id' => '83',
        'name' => '铁岭市',
        'child' => 
        array (
          907 => 
          array (
            'id' => '907',
            'name' => '银州区',
          ),
          908 => 
          array (
            'id' => '908',
            'name' => '清河区',
          ),
          909 => 
          array (
            'id' => '909',
            'name' => '铁岭县',
          ),
          910 => 
          array (
            'id' => '910',
            'name' => '西丰县',
          ),
          911 => 
          array (
            'id' => '911',
            'name' => '昌图县',
          ),
          912 => 
          array (
            'id' => '912',
            'name' => '调兵山市',
          ),
          913 => 
          array (
            'id' => '913',
            'name' => '开原市',
          ),
        ),
      ),
      84 => 
      array (
        'id' => '84',
        'name' => '朝阳市',
        'child' => 
        array (
          914 => 
          array (
            'id' => '914',
            'name' => '双塔区',
          ),
          915 => 
          array (
            'id' => '915',
            'name' => '龙城区',
          ),
          916 => 
          array (
            'id' => '916',
            'name' => '朝阳县',
          ),
          917 => 
          array (
            'id' => '917',
            'name' => '建平县',
          ),
          918 => 
          array (
            'id' => '918',
            'name' => '喀喇沁左翼蒙古族自治县',
          ),
          919 => 
          array (
            'id' => '919',
            'name' => '北票市',
          ),
          920 => 
          array (
            'id' => '920',
            'name' => '凌源市',
          ),
        ),
      ),
      85 => 
      array (
        'id' => '85',
        'name' => '葫芦岛市',
        'child' => 
        array (
          921 => 
          array (
            'id' => '921',
            'name' => '连山区',
          ),
          922 => 
          array (
            'id' => '922',
            'name' => '龙港区',
          ),
          923 => 
          array (
            'id' => '923',
            'name' => '南票区',
          ),
          924 => 
          array (
            'id' => '924',
            'name' => '绥中县',
          ),
          925 => 
          array (
            'id' => '925',
            'name' => '建昌县',
          ),
          926 => 
          array (
            'id' => '926',
            'name' => '兴城市',
          ),
        ),
      ),
    ),
  ),
  8 => 
  array (
    'id' => '8',
    'name' => '吉林省',
    'child' => 
    array (
      86 => 
      array (
        'id' => '86',
        'name' => '长春市',
        'child' => 
        array (
          927 => 
          array (
            'id' => '927',
            'name' => '南关区',
          ),
          928 => 
          array (
            'id' => '928',
            'name' => '宽城区',
          ),
          929 => 
          array (
            'id' => '929',
            'name' => '朝阳区',
          ),
          930 => 
          array (
            'id' => '930',
            'name' => '二道区',
          ),
          931 => 
          array (
            'id' => '931',
            'name' => '绿园区',
          ),
          932 => 
          array (
            'id' => '932',
            'name' => '双阳区',
          ),
          933 => 
          array (
            'id' => '933',
            'name' => '农安县',
          ),
          934 => 
          array (
            'id' => '934',
            'name' => '九台市',
          ),
          935 => 
          array (
            'id' => '935',
            'name' => '榆树市',
          ),
          936 => 
          array (
            'id' => '936',
            'name' => '德惠市',
          ),
          937 => 
          array (
            'id' => '937',
            'name' => '净月经济开发区',
          ),
          938 => 
          array (
            'id' => '938',
            'name' => '高新技术产业开发区',
          ),
        ),
      ),
      87 => 
      array (
        'id' => '87',
        'name' => '吉林市',
        'child' => 
        array (
          939 => 
          array (
            'id' => '939',
            'name' => '昌邑区',
          ),
          940 => 
          array (
            'id' => '940',
            'name' => '龙潭区',
          ),
          941 => 
          array (
            'id' => '941',
            'name' => '船营区',
          ),
          942 => 
          array (
            'id' => '942',
            'name' => '丰满区',
          ),
          943 => 
          array (
            'id' => '943',
            'name' => '永吉县',
          ),
          944 => 
          array (
            'id' => '944',
            'name' => '蛟河市',
          ),
          945 => 
          array (
            'id' => '945',
            'name' => '桦甸市',
          ),
          946 => 
          array (
            'id' => '946',
            'name' => '舒兰市',
          ),
          947 => 
          array (
            'id' => '947',
            'name' => '磐石市',
          ),
        ),
      ),
      88 => 
      array (
        'id' => '88',
        'name' => '四平市',
        'child' => 
        array (
          948 => 
          array (
            'id' => '948',
            'name' => '铁西区',
          ),
          949 => 
          array (
            'id' => '949',
            'name' => '铁东区',
          ),
          950 => 
          array (
            'id' => '950',
            'name' => '梨树县',
          ),
          951 => 
          array (
            'id' => '951',
            'name' => '伊通满族自治县',
          ),
          952 => 
          array (
            'id' => '952',
            'name' => '公主岭市',
          ),
          953 => 
          array (
            'id' => '953',
            'name' => '双辽市',
          ),
        ),
      ),
      89 => 
      array (
        'id' => '89',
        'name' => '辽源市',
        'child' => 
        array (
          954 => 
          array (
            'id' => '954',
            'name' => '龙山区',
          ),
          955 => 
          array (
            'id' => '955',
            'name' => '西安区',
          ),
          956 => 
          array (
            'id' => '956',
            'name' => '东丰县',
          ),
          957 => 
          array (
            'id' => '957',
            'name' => '东辽县',
          ),
        ),
      ),
      90 => 
      array (
        'id' => '90',
        'name' => '通化市',
        'child' => 
        array (
          958 => 
          array (
            'id' => '958',
            'name' => '东昌区',
          ),
          959 => 
          array (
            'id' => '959',
            'name' => '二道江区',
          ),
          960 => 
          array (
            'id' => '960',
            'name' => '通化县',
          ),
          961 => 
          array (
            'id' => '961',
            'name' => '辉南县',
          ),
          962 => 
          array (
            'id' => '962',
            'name' => '柳河县',
          ),
          963 => 
          array (
            'id' => '963',
            'name' => '梅河口市',
          ),
          964 => 
          array (
            'id' => '964',
            'name' => '集安市',
          ),
        ),
      ),
      91 => 
      array (
        'id' => '91',
        'name' => '白山市',
        'child' => 
        array (
          965 => 
          array (
            'id' => '965',
            'name' => '八道江区',
          ),
          966 => 
          array (
            'id' => '966',
            'name' => '抚松县',
          ),
          967 => 
          array (
            'id' => '967',
            'name' => '靖宇县',
          ),
          968 => 
          array (
            'id' => '968',
            'name' => '长白朝鲜族自治县',
          ),
          969 => 
          array (
            'id' => '969',
            'name' => '江源县',
          ),
          970 => 
          array (
            'id' => '970',
            'name' => '临江市',
          ),
        ),
      ),
      92 => 
      array (
        'id' => '92',
        'name' => '松原市',
        'child' => 
        array (
          971 => 
          array (
            'id' => '971',
            'name' => '宁江区',
          ),
          972 => 
          array (
            'id' => '972',
            'name' => '前郭尔罗斯蒙古族自治县',
          ),
          973 => 
          array (
            'id' => '973',
            'name' => '长岭县',
          ),
          974 => 
          array (
            'id' => '974',
            'name' => '乾安县',
          ),
          975 => 
          array (
            'id' => '975',
            'name' => '扶余县',
          ),
        ),
      ),
      93 => 
      array (
        'id' => '93',
        'name' => '白城市',
        'child' => 
        array (
          976 => 
          array (
            'id' => '976',
            'name' => '洮北区',
          ),
          977 => 
          array (
            'id' => '977',
            'name' => '镇赉县',
          ),
          978 => 
          array (
            'id' => '978',
            'name' => '通榆县',
          ),
          979 => 
          array (
            'id' => '979',
            'name' => '洮南市',
          ),
          980 => 
          array (
            'id' => '980',
            'name' => '大安市',
          ),
        ),
      ),
      94 => 
      array (
        'id' => '94',
        'name' => '延边朝鲜族自治州',
        'child' => 
        array (
          981 => 
          array (
            'id' => '981',
            'name' => '延吉市',
          ),
          982 => 
          array (
            'id' => '982',
            'name' => '图们市',
          ),
          983 => 
          array (
            'id' => '983',
            'name' => '敦化市',
          ),
          984 => 
          array (
            'id' => '984',
            'name' => '珲春市',
          ),
          985 => 
          array (
            'id' => '985',
            'name' => '龙井市',
          ),
          986 => 
          array (
            'id' => '986',
            'name' => '和龙市',
          ),
          987 => 
          array (
            'id' => '987',
            'name' => '汪清县',
          ),
          988 => 
          array (
            'id' => '988',
            'name' => '安图县',
          ),
        ),
      ),
    ),
  ),
  9 => 
  array (
    'id' => '9',
    'name' => '黑龙江省',
    'child' => 
    array (
      95 => 
      array (
        'id' => '95',
        'name' => '哈尔滨市',
        'child' => 
        array (
          989 => 
          array (
            'id' => '989',
            'name' => '道里区',
          ),
          990 => 
          array (
            'id' => '990',
            'name' => '南岗区',
          ),
          991 => 
          array (
            'id' => '991',
            'name' => '道外区',
          ),
          992 => 
          array (
            'id' => '992',
            'name' => '香坊区',
          ),
          993 => 
          array (
            'id' => '993',
            'name' => '动力区',
          ),
          994 => 
          array (
            'id' => '994',
            'name' => '平房区',
          ),
          995 => 
          array (
            'id' => '995',
            'name' => '松北区',
          ),
          996 => 
          array (
            'id' => '996',
            'name' => '呼兰区',
          ),
          997 => 
          array (
            'id' => '997',
            'name' => '依兰县',
          ),
          998 => 
          array (
            'id' => '998',
            'name' => '方正县',
          ),
          999 => 
          array (
            'id' => '999',
            'name' => '宾县',
          ),
          1000 => 
          array (
            'id' => '1000',
            'name' => '巴彦县',
          ),
          1001 => 
          array (
            'id' => '1001',
            'name' => '木兰县',
          ),
          1002 => 
          array (
            'id' => '1002',
            'name' => '通河县',
          ),
          1003 => 
          array (
            'id' => '1003',
            'name' => '延寿县',
          ),
          1004 => 
          array (
            'id' => '1004',
            'name' => '阿城区',
          ),
          1005 => 
          array (
            'id' => '1005',
            'name' => '双城市',
          ),
          1006 => 
          array (
            'id' => '1006',
            'name' => '尚志市',
          ),
          1007 => 
          array (
            'id' => '1007',
            'name' => '五常市',
          ),
        ),
      ),
      96 => 
      array (
        'id' => '96',
        'name' => '齐齐哈尔市',
        'child' => 
        array (
          1008 => 
          array (
            'id' => '1008',
            'name' => '龙沙区',
          ),
          1009 => 
          array (
            'id' => '1009',
            'name' => '建华区',
          ),
          1010 => 
          array (
            'id' => '1010',
            'name' => '铁锋区',
          ),
          1011 => 
          array (
            'id' => '1011',
            'name' => '昂昂溪区',
          ),
          1012 => 
          array (
            'id' => '1012',
            'name' => '富拉尔基区',
          ),
          1013 => 
          array (
            'id' => '1013',
            'name' => '碾子山区',
          ),
          1014 => 
          array (
            'id' => '1014',
            'name' => '梅里斯达斡尔族区',
          ),
          1015 => 
          array (
            'id' => '1015',
            'name' => '龙江县',
          ),
          1016 => 
          array (
            'id' => '1016',
            'name' => '依安县',
          ),
          1017 => 
          array (
            'id' => '1017',
            'name' => '泰来县',
          ),
          1018 => 
          array (
            'id' => '1018',
            'name' => '甘南县',
          ),
          1019 => 
          array (
            'id' => '1019',
            'name' => '富裕县',
          ),
          1020 => 
          array (
            'id' => '1020',
            'name' => '克山县',
          ),
          1021 => 
          array (
            'id' => '1021',
            'name' => '克东县',
          ),
          1022 => 
          array (
            'id' => '1022',
            'name' => '拜泉县',
          ),
          1023 => 
          array (
            'id' => '1023',
            'name' => '讷河市',
          ),
        ),
      ),
      97 => 
      array (
        'id' => '97',
        'name' => '鸡西市',
        'child' => 
        array (
          1024 => 
          array (
            'id' => '1024',
            'name' => '鸡冠区',
          ),
          1025 => 
          array (
            'id' => '1025',
            'name' => '恒山区',
          ),
          1026 => 
          array (
            'id' => '1026',
            'name' => '滴道区',
          ),
          1027 => 
          array (
            'id' => '1027',
            'name' => '梨树区',
          ),
          1028 => 
          array (
            'id' => '1028',
            'name' => '城子河区',
          ),
          1029 => 
          array (
            'id' => '1029',
            'name' => '麻山区',
          ),
          1030 => 
          array (
            'id' => '1030',
            'name' => '鸡东县',
          ),
          1031 => 
          array (
            'id' => '1031',
            'name' => '虎林市',
          ),
          1032 => 
          array (
            'id' => '1032',
            'name' => '密山市',
          ),
        ),
      ),
      98 => 
      array (
        'id' => '98',
        'name' => '鹤岗市',
        'child' => 
        array (
          1033 => 
          array (
            'id' => '1033',
            'name' => '向阳区',
          ),
          1034 => 
          array (
            'id' => '1034',
            'name' => '工农区',
          ),
          1035 => 
          array (
            'id' => '1035',
            'name' => '南山区',
          ),
          1036 => 
          array (
            'id' => '1036',
            'name' => '兴安区',
          ),
          1037 => 
          array (
            'id' => '1037',
            'name' => '东山区',
          ),
          1038 => 
          array (
            'id' => '1038',
            'name' => '兴山区',
          ),
          1039 => 
          array (
            'id' => '1039',
            'name' => '萝北县',
          ),
          1040 => 
          array (
            'id' => '1040',
            'name' => '绥滨县',
          ),
        ),
      ),
      99 => 
      array (
        'id' => '99',
        'name' => '双鸭山市',
        'child' => 
        array (
          1041 => 
          array (
            'id' => '1041',
            'name' => '尖山区',
          ),
          1042 => 
          array (
            'id' => '1042',
            'name' => '岭东区',
          ),
          1043 => 
          array (
            'id' => '1043',
            'name' => '四方台区',
          ),
          1044 => 
          array (
            'id' => '1044',
            'name' => '宝山区',
          ),
          1045 => 
          array (
            'id' => '1045',
            'name' => '集贤县',
          ),
          1046 => 
          array (
            'id' => '1046',
            'name' => '友谊县',
          ),
          1047 => 
          array (
            'id' => '1047',
            'name' => '宝清县',
          ),
          1048 => 
          array (
            'id' => '1048',
            'name' => '饶河县',
          ),
        ),
      ),
      100 => 
      array (
        'id' => '100',
        'name' => '大庆市',
        'child' => 
        array (
          1049 => 
          array (
            'id' => '1049',
            'name' => '萨尔图区',
          ),
          1050 => 
          array (
            'id' => '1050',
            'name' => '龙凤区',
          ),
          1051 => 
          array (
            'id' => '1051',
            'name' => '让胡路区',
          ),
          1052 => 
          array (
            'id' => '1052',
            'name' => '红岗区',
          ),
          1053 => 
          array (
            'id' => '1053',
            'name' => '大同区',
          ),
          1054 => 
          array (
            'id' => '1054',
            'name' => '肇州县',
          ),
          1055 => 
          array (
            'id' => '1055',
            'name' => '肇源县',
          ),
          1056 => 
          array (
            'id' => '1056',
            'name' => '林甸县',
          ),
          1057 => 
          array (
            'id' => '1057',
            'name' => '杜尔伯特蒙古族自治县',
          ),
        ),
      ),
      101 => 
      array (
        'id' => '101',
        'name' => '伊春市',
        'child' => 
        array (
          1058 => 
          array (
            'id' => '1058',
            'name' => '伊春区',
          ),
          1059 => 
          array (
            'id' => '1059',
            'name' => '南岔区',
          ),
          1060 => 
          array (
            'id' => '1060',
            'name' => '友好区',
          ),
          1061 => 
          array (
            'id' => '1061',
            'name' => '西林区',
          ),
          1062 => 
          array (
            'id' => '1062',
            'name' => '翠峦区',
          ),
          1063 => 
          array (
            'id' => '1063',
            'name' => '新青区',
          ),
          1064 => 
          array (
            'id' => '1064',
            'name' => '美溪区',
          ),
          1065 => 
          array (
            'id' => '1065',
            'name' => '金山屯区',
          ),
          1066 => 
          array (
            'id' => '1066',
            'name' => '五营区',
          ),
          1067 => 
          array (
            'id' => '1067',
            'name' => '乌马河区',
          ),
          1068 => 
          array (
            'id' => '1068',
            'name' => '汤旺河区',
          ),
          1069 => 
          array (
            'id' => '1069',
            'name' => '带岭区',
          ),
          1070 => 
          array (
            'id' => '1070',
            'name' => '乌伊岭区',
          ),
          1071 => 
          array (
            'id' => '1071',
            'name' => '红星区',
          ),
          1072 => 
          array (
            'id' => '1072',
            'name' => '上甘岭区',
          ),
          1073 => 
          array (
            'id' => '1073',
            'name' => '嘉荫县',
          ),
          1074 => 
          array (
            'id' => '1074',
            'name' => '铁力市',
          ),
        ),
      ),
      102 => 
      array (
        'id' => '102',
        'name' => '佳木斯市',
        'child' => 
        array (
          1075 => 
          array (
            'id' => '1075',
            'name' => '向阳区',
          ),
          1076 => 
          array (
            'id' => '1076',
            'name' => '前进区',
          ),
          1077 => 
          array (
            'id' => '1077',
            'name' => '东风区',
          ),
          1078 => 
          array (
            'id' => '1078',
            'name' => '郊区',
          ),
          1079 => 
          array (
            'id' => '1079',
            'name' => '桦南县',
          ),
          1080 => 
          array (
            'id' => '1080',
            'name' => '桦川县',
          ),
          1081 => 
          array (
            'id' => '1081',
            'name' => '汤原县',
          ),
          1082 => 
          array (
            'id' => '1082',
            'name' => '抚远县',
          ),
          1083 => 
          array (
            'id' => '1083',
            'name' => '同江市',
          ),
          1084 => 
          array (
            'id' => '1084',
            'name' => '富锦市',
          ),
        ),
      ),
      103 => 
      array (
        'id' => '103',
        'name' => '七台河市',
        'child' => 
        array (
          1085 => 
          array (
            'id' => '1085',
            'name' => '新兴区',
          ),
          1086 => 
          array (
            'id' => '1086',
            'name' => '桃山区',
          ),
          1087 => 
          array (
            'id' => '1087',
            'name' => '茄子河区',
          ),
          1088 => 
          array (
            'id' => '1088',
            'name' => '勃利县',
          ),
        ),
      ),
      104 => 
      array (
        'id' => '104',
        'name' => '牡丹江市',
        'child' => 
        array (
          1089 => 
          array (
            'id' => '1089',
            'name' => '东安区',
          ),
          1090 => 
          array (
            'id' => '1090',
            'name' => '爱民区',
          ),
          1091 => 
          array (
            'id' => '1091',
            'name' => '阳明区',
          ),
          1092 => 
          array (
            'id' => '1092',
            'name' => '西安区',
          ),
          1093 => 
          array (
            'id' => '1093',
            'name' => '东宁县',
          ),
          1094 => 
          array (
            'id' => '1094',
            'name' => '林口县',
          ),
          1095 => 
          array (
            'id' => '1095',
            'name' => '绥芬河市',
          ),
          1096 => 
          array (
            'id' => '1096',
            'name' => '海林市',
          ),
          1097 => 
          array (
            'id' => '1097',
            'name' => '宁安市',
          ),
          1098 => 
          array (
            'id' => '1098',
            'name' => '穆棱市',
          ),
        ),
      ),
      105 => 
      array (
        'id' => '105',
        'name' => '黑河市',
        'child' => 
        array (
          1099 => 
          array (
            'id' => '1099',
            'name' => '爱辉区',
          ),
          1100 => 
          array (
            'id' => '1100',
            'name' => '嫩江县',
          ),
          1101 => 
          array (
            'id' => '1101',
            'name' => '逊克县',
          ),
          1102 => 
          array (
            'id' => '1102',
            'name' => '孙吴县',
          ),
          1103 => 
          array (
            'id' => '1103',
            'name' => '北安市',
          ),
          1104 => 
          array (
            'id' => '1104',
            'name' => '五大连池市',
          ),
        ),
      ),
      106 => 
      array (
        'id' => '106',
        'name' => '绥化市',
        'child' => 
        array (
          1105 => 
          array (
            'id' => '1105',
            'name' => '北林区',
          ),
          1106 => 
          array (
            'id' => '1106',
            'name' => '望奎县',
          ),
          1107 => 
          array (
            'id' => '1107',
            'name' => '兰西县',
          ),
          1108 => 
          array (
            'id' => '1108',
            'name' => '青冈县',
          ),
          1109 => 
          array (
            'id' => '1109',
            'name' => '庆安县',
          ),
          1110 => 
          array (
            'id' => '1110',
            'name' => '明水县',
          ),
          1111 => 
          array (
            'id' => '1111',
            'name' => '绥棱县',
          ),
          1112 => 
          array (
            'id' => '1112',
            'name' => '安达市',
          ),
          1113 => 
          array (
            'id' => '1113',
            'name' => '肇东市',
          ),
          1114 => 
          array (
            'id' => '1114',
            'name' => '海伦市',
          ),
        ),
      ),
      107 => 
      array (
        'id' => '107',
        'name' => '大兴安岭地区',
        'child' => 
        array (
          1115 => 
          array (
            'id' => '1115',
            'name' => '呼玛县',
          ),
          1116 => 
          array (
            'id' => '1116',
            'name' => '塔河县',
          ),
          1117 => 
          array (
            'id' => '1117',
            'name' => '漠河县',
          ),
          1118 => 
          array (
            'id' => '1118',
            'name' => '加格达奇区',
          ),
          1119 => 
          array (
            'id' => '1119',
            'name' => '松岭区',
          ),
          1120 => 
          array (
            'id' => '1120',
            'name' => '新林区',
          ),
          1121 => 
          array (
            'id' => '1121',
            'name' => '呼中区',
          ),
        ),
      ),
    ),
  ),
  10 => 
  array (
    'id' => '10',
    'name' => '上海市',
    'child' => 
    array (
      108 => 
      array (
        'id' => '108',
        'name' => '上海市',
        'child' => 
        array (
          1122 => 
          array (
            'id' => '1122',
            'name' => '黄浦区',
          ),
          1123 => 
          array (
            'id' => '1123',
            'name' => '卢湾区',
          ),
          1124 => 
          array (
            'id' => '1124',
            'name' => '徐汇区',
          ),
          1125 => 
          array (
            'id' => '1125',
            'name' => '长宁区',
          ),
          1126 => 
          array (
            'id' => '1126',
            'name' => '静安区',
          ),
          1127 => 
          array (
            'id' => '1127',
            'name' => '普陀区',
          ),
          1128 => 
          array (
            'id' => '1128',
            'name' => '闸北区',
          ),
          1129 => 
          array (
            'id' => '1129',
            'name' => '虹口区',
          ),
          1130 => 
          array (
            'id' => '1130',
            'name' => '杨浦区',
          ),
          1131 => 
          array (
            'id' => '1131',
            'name' => '闵行区',
          ),
          1132 => 
          array (
            'id' => '1132',
            'name' => '宝山区',
          ),
          1133 => 
          array (
            'id' => '1133',
            'name' => '嘉定区',
          ),
          1134 => 
          array (
            'id' => '1134',
            'name' => '浦东新区',
          ),
          1135 => 
          array (
            'id' => '1135',
            'name' => '金山区',
          ),
          1136 => 
          array (
            'id' => '1136',
            'name' => '松江区',
          ),
          1137 => 
          array (
            'id' => '1137',
            'name' => '青浦区',
          ),
          1138 => 
          array (
            'id' => '1138',
            'name' => '南汇区',
          ),
          1139 => 
          array (
            'id' => '1139',
            'name' => '奉贤区',
          ),
          1140 => 
          array (
            'id' => '1140',
            'name' => '崇明县',
          ),
        ),
      ),
    ),
  ),
  11 => 
  array (
    'id' => '11',
    'name' => '江苏省',
    'child' => 
    array (
      109 => 
      array (
        'id' => '109',
        'name' => '南京市',
        'child' => 
        array (
          1141 => 
          array (
            'id' => '1141',
            'name' => '玄武区',
          ),
          1142 => 
          array (
            'id' => '1142',
            'name' => '白下区',
          ),
          1143 => 
          array (
            'id' => '1143',
            'name' => '秦淮区',
          ),
          1144 => 
          array (
            'id' => '1144',
            'name' => '建邺区',
          ),
          1145 => 
          array (
            'id' => '1145',
            'name' => '鼓楼区',
          ),
          1146 => 
          array (
            'id' => '1146',
            'name' => '下关区',
          ),
          1147 => 
          array (
            'id' => '1147',
            'name' => '浦口区',
          ),
          1148 => 
          array (
            'id' => '1148',
            'name' => '栖霞区',
          ),
          1149 => 
          array (
            'id' => '1149',
            'name' => '雨花台区',
          ),
          1150 => 
          array (
            'id' => '1150',
            'name' => '江宁区',
          ),
          1151 => 
          array (
            'id' => '1151',
            'name' => '六合区',
          ),
          1152 => 
          array (
            'id' => '1152',
            'name' => '溧水县',
          ),
          1153 => 
          array (
            'id' => '1153',
            'name' => '高淳县',
          ),
        ),
      ),
      110 => 
      array (
        'id' => '110',
        'name' => '无锡市',
        'child' => 
        array (
          1154 => 
          array (
            'id' => '1154',
            'name' => '崇安区',
          ),
          1155 => 
          array (
            'id' => '1155',
            'name' => '南长区',
          ),
          1156 => 
          array (
            'id' => '1156',
            'name' => '北塘区',
          ),
          1157 => 
          array (
            'id' => '1157',
            'name' => '锡山区',
          ),
          1158 => 
          array (
            'id' => '1158',
            'name' => '惠山区',
          ),
          1159 => 
          array (
            'id' => '1159',
            'name' => '滨湖区',
          ),
          1160 => 
          array (
            'id' => '1160',
            'name' => '江阴市',
          ),
          1161 => 
          array (
            'id' => '1161',
            'name' => '宜兴市',
          ),
          1162 => 
          array (
            'id' => '1162',
            'name' => '新区',
          ),
        ),
      ),
      111 => 
      array (
        'id' => '111',
        'name' => '徐州市',
        'child' => 
        array (
          1163 => 
          array (
            'id' => '1163',
            'name' => '云龙区',
          ),
          1164 => 
          array (
            'id' => '1164',
            'name' => '鼓楼区',
          ),
          1165 => 
          array (
            'id' => '1165',
            'name' => '九里区',
          ),
          1166 => 
          array (
            'id' => '1166',
            'name' => '泉山区',
          ),
          1167 => 
          array (
            'id' => '1167',
            'name' => '铜山县',
          ),
          1168 => 
          array (
            'id' => '1168',
            'name' => '贾汪区',
          ),
          1169 => 
          array (
            'id' => '1169',
            'name' => '丰县',
          ),
          1170 => 
          array (
            'id' => '1170',
            'name' => '沛县',
          ),
          1171 => 
          array (
            'id' => '1171',
            'name' => '睢宁县',
          ),
          1172 => 
          array (
            'id' => '1172',
            'name' => '新沂市',
          ),
          1173 => 
          array (
            'id' => '1173',
            'name' => '邳州市',
          ),
        ),
      ),
      112 => 
      array (
        'id' => '112',
        'name' => '常州市',
        'child' => 
        array (
          1174 => 
          array (
            'id' => '1174',
            'name' => '天宁区',
          ),
          1175 => 
          array (
            'id' => '1175',
            'name' => '钟楼区',
          ),
          1176 => 
          array (
            'id' => '1176',
            'name' => '戚墅堰区',
          ),
          1177 => 
          array (
            'id' => '1177',
            'name' => '新北区',
          ),
          1178 => 
          array (
            'id' => '1178',
            'name' => '武进区',
          ),
          1179 => 
          array (
            'id' => '1179',
            'name' => '溧阳市',
          ),
          1180 => 
          array (
            'id' => '1180',
            'name' => '金坛市',
          ),
        ),
      ),
      113 => 
      array (
        'id' => '113',
        'name' => '苏州市',
        'child' => 
        array (
          1181 => 
          array (
            'id' => '1181',
            'name' => '沧浪区',
          ),
          1182 => 
          array (
            'id' => '1182',
            'name' => '平江区',
          ),
          1183 => 
          array (
            'id' => '1183',
            'name' => '金阊区',
          ),
          1184 => 
          array (
            'id' => '1184',
            'name' => '虎丘区',
          ),
          1185 => 
          array (
            'id' => '1185',
            'name' => '吴中区',
          ),
          1186 => 
          array (
            'id' => '1186',
            'name' => '相城区',
          ),
          1187 => 
          array (
            'id' => '1187',
            'name' => '常熟市',
          ),
          1188 => 
          array (
            'id' => '1188',
            'name' => '张家港市',
          ),
          1189 => 
          array (
            'id' => '1189',
            'name' => '昆山市',
          ),
          1190 => 
          array (
            'id' => '1190',
            'name' => '吴江市',
          ),
          1191 => 
          array (
            'id' => '1191',
            'name' => '太仓市',
          ),
          1192 => 
          array (
            'id' => '1192',
            'name' => '工业园区',
          ),
          1193 => 
          array (
            'id' => '1193',
            'name' => '高新区',
          ),
        ),
      ),
      114 => 
      array (
        'id' => '114',
        'name' => '南通市',
        'child' => 
        array (
          1194 => 
          array (
            'id' => '1194',
            'name' => '崇川区',
          ),
          1195 => 
          array (
            'id' => '1195',
            'name' => '港闸区',
          ),
          1196 => 
          array (
            'id' => '1196',
            'name' => '海安县',
          ),
          1197 => 
          array (
            'id' => '1197',
            'name' => '如东县',
          ),
          1198 => 
          array (
            'id' => '1198',
            'name' => '启东市',
          ),
          1199 => 
          array (
            'id' => '1199',
            'name' => '如皋市',
          ),
          1200 => 
          array (
            'id' => '1200',
            'name' => '通州市',
          ),
          1201 => 
          array (
            'id' => '1201',
            'name' => '海门市',
          ),
          1202 => 
          array (
            'id' => '1202',
            'name' => '经济技术开发区',
          ),
        ),
      ),
      115 => 
      array (
        'id' => '115',
        'name' => '连云港市',
        'child' => 
        array (
          1203 => 
          array (
            'id' => '1203',
            'name' => '连云区',
          ),
          1204 => 
          array (
            'id' => '1204',
            'name' => '新浦区',
          ),
          1205 => 
          array (
            'id' => '1205',
            'name' => '海州区',
          ),
          1206 => 
          array (
            'id' => '1206',
            'name' => '赣榆县',
          ),
          1207 => 
          array (
            'id' => '1207',
            'name' => '东海县',
          ),
          1208 => 
          array (
            'id' => '1208',
            'name' => '灌云县',
          ),
          1209 => 
          array (
            'id' => '1209',
            'name' => '灌南县',
          ),
        ),
      ),
      116 => 
      array (
        'id' => '116',
        'name' => '淮安市',
        'child' => 
        array (
          1210 => 
          array (
            'id' => '1210',
            'name' => '清河区',
          ),
          1211 => 
          array (
            'id' => '1211',
            'name' => '楚州区',
          ),
          1212 => 
          array (
            'id' => '1212',
            'name' => '淮阴区',
          ),
          1213 => 
          array (
            'id' => '1213',
            'name' => '清浦区',
          ),
          1214 => 
          array (
            'id' => '1214',
            'name' => '涟水县',
          ),
          1215 => 
          array (
            'id' => '1215',
            'name' => '洪泽县',
          ),
          1216 => 
          array (
            'id' => '1216',
            'name' => '盱眙县',
          ),
          1217 => 
          array (
            'id' => '1217',
            'name' => '金湖县',
          ),
        ),
      ),
      117 => 
      array (
        'id' => '117',
        'name' => '盐城市',
        'child' => 
        array (
          1218 => 
          array (
            'id' => '1218',
            'name' => '亭湖区',
          ),
          1219 => 
          array (
            'id' => '1219',
            'name' => '盐都区',
          ),
          1220 => 
          array (
            'id' => '1220',
            'name' => '响水县',
          ),
          1221 => 
          array (
            'id' => '1221',
            'name' => '滨海县',
          ),
          1222 => 
          array (
            'id' => '1222',
            'name' => '阜宁县',
          ),
          1223 => 
          array (
            'id' => '1223',
            'name' => '射阳县',
          ),
          1224 => 
          array (
            'id' => '1224',
            'name' => '建湖县',
          ),
          1225 => 
          array (
            'id' => '1225',
            'name' => '东台市',
          ),
          1226 => 
          array (
            'id' => '1226',
            'name' => '大丰市',
          ),
        ),
      ),
      118 => 
      array (
        'id' => '118',
        'name' => '扬州市',
        'child' => 
        array (
          1227 => 
          array (
            'id' => '1227',
            'name' => '广陵区',
          ),
          1228 => 
          array (
            'id' => '1228',
            'name' => '邗江区',
          ),
          1229 => 
          array (
            'id' => '1229',
            'name' => '宝应县',
          ),
          1230 => 
          array (
            'id' => '1230',
            'name' => '仪征市',
          ),
          1231 => 
          array (
            'id' => '1231',
            'name' => '高邮市',
          ),
          1232 => 
          array (
            'id' => '1232',
            'name' => '江都市',
          ),
          1233 => 
          array (
            'id' => '1233',
            'name' => '维扬区',
          ),
          1234 => 
          array (
            'id' => '1234',
            'name' => '经济开发区',
          ),
        ),
      ),
      119 => 
      array (
        'id' => '119',
        'name' => '镇江市',
        'child' => 
        array (
          1235 => 
          array (
            'id' => '1235',
            'name' => '京口区',
          ),
          1236 => 
          array (
            'id' => '1236',
            'name' => '润州区',
          ),
          1237 => 
          array (
            'id' => '1237',
            'name' => '丹徒区',
          ),
          1238 => 
          array (
            'id' => '1238',
            'name' => '丹阳市',
          ),
          1239 => 
          array (
            'id' => '1239',
            'name' => '扬中市',
          ),
          1240 => 
          array (
            'id' => '1240',
            'name' => '句容市',
          ),
          1241 => 
          array (
            'id' => '1241',
            'name' => '新区',
          ),
        ),
      ),
      120 => 
      array (
        'id' => '120',
        'name' => '泰州市',
        'child' => 
        array (
          1242 => 
          array (
            'id' => '1242',
            'name' => '海陵区',
          ),
          1243 => 
          array (
            'id' => '1243',
            'name' => '高港区',
          ),
          1244 => 
          array (
            'id' => '1244',
            'name' => '兴化市',
          ),
          1245 => 
          array (
            'id' => '1245',
            'name' => '靖江市',
          ),
          1246 => 
          array (
            'id' => '1246',
            'name' => '泰兴市',
          ),
          1247 => 
          array (
            'id' => '1247',
            'name' => '姜堰市',
          ),
        ),
      ),
      121 => 
      array (
        'id' => '121',
        'name' => '宿迁市',
        'child' => 
        array (
          1248 => 
          array (
            'id' => '1248',
            'name' => '宿城区',
          ),
          1249 => 
          array (
            'id' => '1249',
            'name' => '宿豫区',
          ),
          1250 => 
          array (
            'id' => '1250',
            'name' => '沭阳县',
          ),
          1251 => 
          array (
            'id' => '1251',
            'name' => '泗阳县',
          ),
          1252 => 
          array (
            'id' => '1252',
            'name' => '泗洪县',
          ),
        ),
      ),
    ),
  ),
  12 => 
  array (
    'id' => '12',
    'name' => '浙江省',
    'child' => 
    array (
      122 => 
      array (
        'id' => '122',
        'name' => '杭州市',
        'child' => 
        array (
          1253 => 
          array (
            'id' => '1253',
            'name' => '上城区',
          ),
          1254 => 
          array (
            'id' => '1254',
            'name' => '下城区',
          ),
          1255 => 
          array (
            'id' => '1255',
            'name' => '江干区',
          ),
          1256 => 
          array (
            'id' => '1256',
            'name' => '拱墅区',
          ),
          1257 => 
          array (
            'id' => '1257',
            'name' => '西湖区',
          ),
          1258 => 
          array (
            'id' => '1258',
            'name' => '滨江区',
          ),
          1259 => 
          array (
            'id' => '1259',
            'name' => '萧山区',
          ),
          1260 => 
          array (
            'id' => '1260',
            'name' => '余杭区',
          ),
          1261 => 
          array (
            'id' => '1261',
            'name' => '桐庐县',
          ),
          1262 => 
          array (
            'id' => '1262',
            'name' => '淳安县',
          ),
          1263 => 
          array (
            'id' => '1263',
            'name' => '建德市',
          ),
          1264 => 
          array (
            'id' => '1264',
            'name' => '富阳市',
          ),
          1265 => 
          array (
            'id' => '1265',
            'name' => '临安市',
          ),
        ),
      ),
      123 => 
      array (
        'id' => '123',
        'name' => '宁波市',
        'child' => 
        array (
          1266 => 
          array (
            'id' => '1266',
            'name' => '海曙区',
          ),
          1267 => 
          array (
            'id' => '1267',
            'name' => '江东区',
          ),
          1268 => 
          array (
            'id' => '1268',
            'name' => '江北区',
          ),
          1269 => 
          array (
            'id' => '1269',
            'name' => '北仑区',
          ),
          1270 => 
          array (
            'id' => '1270',
            'name' => '镇海区',
          ),
          1271 => 
          array (
            'id' => '1271',
            'name' => '鄞州区',
          ),
          1272 => 
          array (
            'id' => '1272',
            'name' => '象山县',
          ),
          1273 => 
          array (
            'id' => '1273',
            'name' => '宁海县',
          ),
          1274 => 
          array (
            'id' => '1274',
            'name' => '余姚市',
          ),
          1275 => 
          array (
            'id' => '1275',
            'name' => '慈溪市',
          ),
          1276 => 
          array (
            'id' => '1276',
            'name' => '奉化市',
          ),
          1277 => 
          array (
            'id' => '1277',
            'name' => '国家高新区',
          ),
        ),
      ),
      124 => 
      array (
        'id' => '124',
        'name' => '温州市',
        'child' => 
        array (
          1278 => 
          array (
            'id' => '1278',
            'name' => '鹿城区',
          ),
          1279 => 
          array (
            'id' => '1279',
            'name' => '龙湾区',
          ),
          1280 => 
          array (
            'id' => '1280',
            'name' => '瓯海区',
          ),
          1281 => 
          array (
            'id' => '1281',
            'name' => '洞头县',
          ),
          1282 => 
          array (
            'id' => '1282',
            'name' => '永嘉县',
          ),
          1283 => 
          array (
            'id' => '1283',
            'name' => '平阳县',
          ),
          1284 => 
          array (
            'id' => '1284',
            'name' => '苍南县',
          ),
          1285 => 
          array (
            'id' => '1285',
            'name' => '文成县',
          ),
          1286 => 
          array (
            'id' => '1286',
            'name' => '泰顺县',
          ),
          1287 => 
          array (
            'id' => '1287',
            'name' => '瑞安市',
          ),
          1288 => 
          array (
            'id' => '1288',
            'name' => '乐清市',
          ),
        ),
      ),
      125 => 
      array (
        'id' => '125',
        'name' => '嘉兴市',
        'child' => 
        array (
          1289 => 
          array (
            'id' => '1289',
            'name' => '秀洲区',
          ),
          1290 => 
          array (
            'id' => '1290',
            'name' => '嘉善县',
          ),
          1291 => 
          array (
            'id' => '1291',
            'name' => '海盐县',
          ),
          1292 => 
          array (
            'id' => '1292',
            'name' => '海宁市',
          ),
          1293 => 
          array (
            'id' => '1293',
            'name' => '平湖市',
          ),
          1294 => 
          array (
            'id' => '1294',
            'name' => '桐乡市',
          ),
          1295 => 
          array (
            'id' => '1295',
            'name' => '南湖区',
          ),
        ),
      ),
      126 => 
      array (
        'id' => '126',
        'name' => '湖州市',
        'child' => 
        array (
          1296 => 
          array (
            'id' => '1296',
            'name' => '吴兴区',
          ),
          1297 => 
          array (
            'id' => '1297',
            'name' => '南浔区',
          ),
          1298 => 
          array (
            'id' => '1298',
            'name' => '德清县',
          ),
          1299 => 
          array (
            'id' => '1299',
            'name' => '长兴县',
          ),
          1300 => 
          array (
            'id' => '1300',
            'name' => '安吉县',
          ),
        ),
      ),
      127 => 
      array (
        'id' => '127',
        'name' => '绍兴市',
        'child' => 
        array (
          1301 => 
          array (
            'id' => '1301',
            'name' => '越城区',
          ),
          1302 => 
          array (
            'id' => '1302',
            'name' => '绍兴县',
          ),
          1303 => 
          array (
            'id' => '1303',
            'name' => '新昌县',
          ),
          1304 => 
          array (
            'id' => '1304',
            'name' => '诸暨市',
          ),
          1305 => 
          array (
            'id' => '1305',
            'name' => '上虞市',
          ),
          1306 => 
          array (
            'id' => '1306',
            'name' => '嵊州市',
          ),
        ),
      ),
      128 => 
      array (
        'id' => '128',
        'name' => '金华市',
        'child' => 
        array (
          1307 => 
          array (
            'id' => '1307',
            'name' => '婺城区',
          ),
          1308 => 
          array (
            'id' => '1308',
            'name' => '金东区',
          ),
          1309 => 
          array (
            'id' => '1309',
            'name' => '武义县',
          ),
          1310 => 
          array (
            'id' => '1310',
            'name' => '浦江县',
          ),
          1311 => 
          array (
            'id' => '1311',
            'name' => '磐安县',
          ),
          1312 => 
          array (
            'id' => '1312',
            'name' => '兰溪市',
          ),
          1313 => 
          array (
            'id' => '1313',
            'name' => '义乌市',
          ),
          1314 => 
          array (
            'id' => '1314',
            'name' => '东阳市',
          ),
          1315 => 
          array (
            'id' => '1315',
            'name' => '永康市',
          ),
        ),
      ),
      129 => 
      array (
        'id' => '129',
        'name' => '衢州市',
        'child' => 
        array (
          1316 => 
          array (
            'id' => '1316',
            'name' => '柯城区',
          ),
          1317 => 
          array (
            'id' => '1317',
            'name' => '衢江区',
          ),
          1318 => 
          array (
            'id' => '1318',
            'name' => '常山县',
          ),
          1319 => 
          array (
            'id' => '1319',
            'name' => '开化县',
          ),
          1320 => 
          array (
            'id' => '1320',
            'name' => '龙游县',
          ),
          1321 => 
          array (
            'id' => '1321',
            'name' => '江山市',
          ),
        ),
      ),
      130 => 
      array (
        'id' => '130',
        'name' => '舟山市',
        'child' => 
        array (
          1322 => 
          array (
            'id' => '1322',
            'name' => '定海区',
          ),
          1323 => 
          array (
            'id' => '1323',
            'name' => '普陀区',
          ),
          1324 => 
          array (
            'id' => '1324',
            'name' => '岱山县',
          ),
          1325 => 
          array (
            'id' => '1325',
            'name' => '嵊泗县',
          ),
        ),
      ),
      131 => 
      array (
        'id' => '131',
        'name' => '台州市',
        'child' => 
        array (
          1326 => 
          array (
            'id' => '1326',
            'name' => '椒江区',
          ),
          1327 => 
          array (
            'id' => '1327',
            'name' => '路桥区',
          ),
          1328 => 
          array (
            'id' => '1328',
            'name' => '黄岩区',
          ),
          1329 => 
          array (
            'id' => '1329',
            'name' => '玉环县',
          ),
          1330 => 
          array (
            'id' => '1330',
            'name' => '三门县',
          ),
          1331 => 
          array (
            'id' => '1331',
            'name' => '天台县',
          ),
          1332 => 
          array (
            'id' => '1332',
            'name' => '仙居县',
          ),
          1333 => 
          array (
            'id' => '1333',
            'name' => '温岭市',
          ),
          1334 => 
          array (
            'id' => '1334',
            'name' => '临海市',
          ),
        ),
      ),
      132 => 
      array (
        'id' => '132',
        'name' => '丽水市',
        'child' => 
        array (
          1335 => 
          array (
            'id' => '1335',
            'name' => '莲都区',
          ),
          1336 => 
          array (
            'id' => '1336',
            'name' => '青田县',
          ),
          1337 => 
          array (
            'id' => '1337',
            'name' => '缙云县',
          ),
          1338 => 
          array (
            'id' => '1338',
            'name' => '遂昌县',
          ),
          1339 => 
          array (
            'id' => '1339',
            'name' => '松阳县',
          ),
          1340 => 
          array (
            'id' => '1340',
            'name' => '云和县',
          ),
          1341 => 
          array (
            'id' => '1341',
            'name' => '庆元县',
          ),
          1342 => 
          array (
            'id' => '1342',
            'name' => '景宁畲族自治县',
          ),
          1343 => 
          array (
            'id' => '1343',
            'name' => '龙泉市',
          ),
        ),
      ),
    ),
  ),
  13 => 
  array (
    'id' => '13',
    'name' => '安徽省',
    'child' => 
    array (
      133 => 
      array (
        'id' => '133',
        'name' => '合肥市',
        'child' => 
        array (
          1344 => 
          array (
            'id' => '1344',
            'name' => '瑶海区',
          ),
          1345 => 
          array (
            'id' => '1345',
            'name' => '庐阳区',
          ),
          1346 => 
          array (
            'id' => '1346',
            'name' => '蜀山区',
          ),
          1347 => 
          array (
            'id' => '1347',
            'name' => '包河区',
          ),
          1348 => 
          array (
            'id' => '1348',
            'name' => '长丰县',
          ),
          1349 => 
          array (
            'id' => '1349',
            'name' => '肥东县',
          ),
          1350 => 
          array (
            'id' => '1350',
            'name' => '肥西县',
          ),
          1351 => 
          array (
            'id' => '1351',
            'name' => '经济技术开发区',
          ),
          1352 => 
          array (
            'id' => '1352',
            'name' => '新站试验区',
          ),
          1353 => 
          array (
            'id' => '1353',
            'name' => '政务文化新区',
          ),
          1354 => 
          array (
            'id' => '1354',
            'name' => '高新技术产业开发区',
          ),
        ),
      ),
      134 => 
      array (
        'id' => '134',
        'name' => '芜湖市',
        'child' => 
        array (
          1355 => 
          array (
            'id' => '1355',
            'name' => '镜湖区',
          ),
          1356 => 
          array (
            'id' => '1356',
            'name' => '鸠江区',
          ),
          1357 => 
          array (
            'id' => '1357',
            'name' => '芜湖县',
          ),
          1358 => 
          array (
            'id' => '1358',
            'name' => '繁昌县',
          ),
          1359 => 
          array (
            'id' => '1359',
            'name' => '南陵县',
          ),
          1360 => 
          array (
            'id' => '1360',
            'name' => '弋江区',
          ),
          1361 => 
          array (
            'id' => '1361',
            'name' => '三山区',
          ),
        ),
      ),
      135 => 
      array (
        'id' => '135',
        'name' => '蚌埠市',
        'child' => 
        array (
          1362 => 
          array (
            'id' => '1362',
            'name' => '龙子湖区',
          ),
          1363 => 
          array (
            'id' => '1363',
            'name' => '蚌山区',
          ),
          1364 => 
          array (
            'id' => '1364',
            'name' => '禹会区',
          ),
          1365 => 
          array (
            'id' => '1365',
            'name' => '淮上区',
          ),
          1366 => 
          array (
            'id' => '1366',
            'name' => '怀远县',
          ),
          1367 => 
          array (
            'id' => '1367',
            'name' => '五河县',
          ),
          1368 => 
          array (
            'id' => '1368',
            'name' => '固镇县',
          ),
        ),
      ),
      136 => 
      array (
        'id' => '136',
        'name' => '淮南市',
        'child' => 
        array (
          1369 => 
          array (
            'id' => '1369',
            'name' => '大通区',
          ),
          1370 => 
          array (
            'id' => '1370',
            'name' => '田家庵区',
          ),
          1371 => 
          array (
            'id' => '1371',
            'name' => '谢家集区',
          ),
          1372 => 
          array (
            'id' => '1372',
            'name' => '八公山区',
          ),
          1373 => 
          array (
            'id' => '1373',
            'name' => '潘集区',
          ),
          1374 => 
          array (
            'id' => '1374',
            'name' => '凤台县',
          ),
        ),
      ),
      137 => 
      array (
        'id' => '137',
        'name' => '马鞍山市',
        'child' => 
        array (
          1375 => 
          array (
            'id' => '1375',
            'name' => '雨山区',
          ),
          1376 => 
          array (
            'id' => '1376',
            'name' => '花山区',
          ),
          1377 => 
          array (
            'id' => '1377',
            'name' => '金家庄区',
          ),
          1378 => 
          array (
            'id' => '1378',
            'name' => '当涂县',
          ),
          1379 => 
          array (
            'id' => '1379',
            'name' => '经济技术开发区',
          ),
        ),
      ),
      138 => 
      array (
        'id' => '138',
        'name' => '淮北市',
        'child' => 
        array (
          1380 => 
          array (
            'id' => '1380',
            'name' => '杜集区',
          ),
          1381 => 
          array (
            'id' => '1381',
            'name' => '相山区',
          ),
          1382 => 
          array (
            'id' => '1382',
            'name' => '烈山区',
          ),
          1383 => 
          array (
            'id' => '1383',
            'name' => '濉溪县',
          ),
        ),
      ),
      139 => 
      array (
        'id' => '139',
        'name' => '铜陵市',
        'child' => 
        array (
          1384 => 
          array (
            'id' => '1384',
            'name' => '铜官山区',
          ),
          1385 => 
          array (
            'id' => '1385',
            'name' => '狮子山区',
          ),
          1386 => 
          array (
            'id' => '1386',
            'name' => '郊区',
          ),
          1387 => 
          array (
            'id' => '1387',
            'name' => '铜陵县',
          ),
        ),
      ),
      140 => 
      array (
        'id' => '140',
        'name' => '安庆市',
        'child' => 
        array (
          1388 => 
          array (
            'id' => '1388',
            'name' => '迎江区',
          ),
          1389 => 
          array (
            'id' => '1389',
            'name' => '大观区',
          ),
          1390 => 
          array (
            'id' => '1390',
            'name' => '怀宁县',
          ),
          1391 => 
          array (
            'id' => '1391',
            'name' => '枞阳县',
          ),
          1392 => 
          array (
            'id' => '1392',
            'name' => '潜山县',
          ),
          1393 => 
          array (
            'id' => '1393',
            'name' => '太湖县',
          ),
          1394 => 
          array (
            'id' => '1394',
            'name' => '宿松县',
          ),
          1395 => 
          array (
            'id' => '1395',
            'name' => '望江县',
          ),
          1396 => 
          array (
            'id' => '1396',
            'name' => '岳西县',
          ),
          1397 => 
          array (
            'id' => '1397',
            'name' => '桐城市',
          ),
          1398 => 
          array (
            'id' => '1398',
            'name' => '宜秀区',
          ),
        ),
      ),
      141 => 
      array (
        'id' => '141',
        'name' => '黄山市',
        'child' => 
        array (
          1399 => 
          array (
            'id' => '1399',
            'name' => '屯溪区',
          ),
          1400 => 
          array (
            'id' => '1400',
            'name' => '黄山区',
          ),
          1401 => 
          array (
            'id' => '1401',
            'name' => '徽州区',
          ),
          1402 => 
          array (
            'id' => '1402',
            'name' => '歙县',
          ),
          1403 => 
          array (
            'id' => '1403',
            'name' => '休宁县',
          ),
          1404 => 
          array (
            'id' => '1404',
            'name' => '黟县',
          ),
          1405 => 
          array (
            'id' => '1405',
            'name' => '祁门县',
          ),
        ),
      ),
      142 => 
      array (
        'id' => '142',
        'name' => '滁州市',
        'child' => 
        array (
          1406 => 
          array (
            'id' => '1406',
            'name' => '琅琊区',
          ),
          1407 => 
          array (
            'id' => '1407',
            'name' => '南谯区',
          ),
          1408 => 
          array (
            'id' => '1408',
            'name' => '来安县',
          ),
          1409 => 
          array (
            'id' => '1409',
            'name' => '全椒县',
          ),
          1410 => 
          array (
            'id' => '1410',
            'name' => '定远县',
          ),
          1411 => 
          array (
            'id' => '1411',
            'name' => '凤阳县',
          ),
          1412 => 
          array (
            'id' => '1412',
            'name' => '天长市',
          ),
          1413 => 
          array (
            'id' => '1413',
            'name' => '明光市',
          ),
        ),
      ),
      143 => 
      array (
        'id' => '143',
        'name' => '阜阳市',
        'child' => 
        array (
          1414 => 
          array (
            'id' => '1414',
            'name' => '颍州区',
          ),
          1415 => 
          array (
            'id' => '1415',
            'name' => '颍东区',
          ),
          1416 => 
          array (
            'id' => '1416',
            'name' => '颍泉区',
          ),
          1417 => 
          array (
            'id' => '1417',
            'name' => '临泉县',
          ),
          1418 => 
          array (
            'id' => '1418',
            'name' => '太和县',
          ),
          1419 => 
          array (
            'id' => '1419',
            'name' => '阜南县',
          ),
          1420 => 
          array (
            'id' => '1420',
            'name' => '颍上县',
          ),
          1421 => 
          array (
            'id' => '1421',
            'name' => '界首市',
          ),
          1422 => 
          array (
            'id' => '1422',
            'name' => '经济开发区',
          ),
        ),
      ),
      144 => 
      array (
        'id' => '144',
        'name' => '宿州市',
        'child' => 
        array (
          1423 => 
          array (
            'id' => '1423',
            'name' => '埇桥区',
          ),
          1424 => 
          array (
            'id' => '1424',
            'name' => '砀山县',
          ),
          1425 => 
          array (
            'id' => '1425',
            'name' => '萧县',
          ),
          1426 => 
          array (
            'id' => '1426',
            'name' => '灵璧县',
          ),
          1427 => 
          array (
            'id' => '1427',
            'name' => '泗县',
          ),
        ),
      ),
      145 => 
      array (
        'id' => '145',
        'name' => '巢湖市',
        'child' => 
        array (
          1428 => 
          array (
            'id' => '1428',
            'name' => '居巢区',
          ),
          1429 => 
          array (
            'id' => '1429',
            'name' => '庐江县',
          ),
          1430 => 
          array (
            'id' => '1430',
            'name' => '无为县',
          ),
          1431 => 
          array (
            'id' => '1431',
            'name' => '含山县',
          ),
          1432 => 
          array (
            'id' => '1432',
            'name' => '和县',
          ),
        ),
      ),
      146 => 
      array (
        'id' => '146',
        'name' => '六安市',
        'child' => 
        array (
          1433 => 
          array (
            'id' => '1433',
            'name' => '金安区',
          ),
          1434 => 
          array (
            'id' => '1434',
            'name' => '裕安区',
          ),
          1435 => 
          array (
            'id' => '1435',
            'name' => '寿县',
          ),
          1436 => 
          array (
            'id' => '1436',
            'name' => '霍邱县',
          ),
          1437 => 
          array (
            'id' => '1437',
            'name' => '舒城县',
          ),
          1438 => 
          array (
            'id' => '1438',
            'name' => '金寨县',
          ),
          1439 => 
          array (
            'id' => '1439',
            'name' => '霍山县',
          ),
        ),
      ),
      147 => 
      array (
        'id' => '147',
        'name' => '亳州市',
        'child' => 
        array (
          1440 => 
          array (
            'id' => '1440',
            'name' => '谯城区',
          ),
          1441 => 
          array (
            'id' => '1441',
            'name' => '涡阳县',
          ),
          1442 => 
          array (
            'id' => '1442',
            'name' => '蒙城县',
          ),
          1443 => 
          array (
            'id' => '1443',
            'name' => '利辛县',
          ),
        ),
      ),
      148 => 
      array (
        'id' => '148',
        'name' => '池州市',
        'child' => 
        array (
          1444 => 
          array (
            'id' => '1444',
            'name' => '贵池区',
          ),
          1445 => 
          array (
            'id' => '1445',
            'name' => '东至县',
          ),
          1446 => 
          array (
            'id' => '1446',
            'name' => '石台县',
          ),
          1447 => 
          array (
            'id' => '1447',
            'name' => '青阳县',
          ),
        ),
      ),
      149 => 
      array (
        'id' => '149',
        'name' => '宣城市',
        'child' => 
        array (
          1448 => 
          array (
            'id' => '1448',
            'name' => '宣州区',
          ),
          1449 => 
          array (
            'id' => '1449',
            'name' => '郎溪县',
          ),
          1450 => 
          array (
            'id' => '1450',
            'name' => '广德县',
          ),
          1451 => 
          array (
            'id' => '1451',
            'name' => '泾县',
          ),
          1452 => 
          array (
            'id' => '1452',
            'name' => '绩溪县',
          ),
          1453 => 
          array (
            'id' => '1453',
            'name' => '旌德县',
          ),
          1454 => 
          array (
            'id' => '1454',
            'name' => '宁国市',
          ),
        ),
      ),
    ),
  ),
  14 => 
  array (
    'id' => '14',
    'name' => '福建省',
    'child' => 
    array (
      150 => 
      array (
        'id' => '150',
        'name' => '福州市',
        'child' => 
        array (
          1455 => 
          array (
            'id' => '1455',
            'name' => '鼓楼区',
          ),
          1456 => 
          array (
            'id' => '1456',
            'name' => '台江区',
          ),
          1457 => 
          array (
            'id' => '1457',
            'name' => '仓山区',
          ),
          1458 => 
          array (
            'id' => '1458',
            'name' => '马尾区',
          ),
          1459 => 
          array (
            'id' => '1459',
            'name' => '晋安区',
          ),
          1460 => 
          array (
            'id' => '1460',
            'name' => '闽侯县',
          ),
          1461 => 
          array (
            'id' => '1461',
            'name' => '连江县',
          ),
          1462 => 
          array (
            'id' => '1462',
            'name' => '罗源县',
          ),
          1463 => 
          array (
            'id' => '1463',
            'name' => '闽清县',
          ),
          1464 => 
          array (
            'id' => '1464',
            'name' => '永泰县',
          ),
          1465 => 
          array (
            'id' => '1465',
            'name' => '平潭县',
          ),
          1466 => 
          array (
            'id' => '1466',
            'name' => '福清市',
          ),
          1467 => 
          array (
            'id' => '1467',
            'name' => '长乐市',
          ),
        ),
      ),
      151 => 
      array (
        'id' => '151',
        'name' => '厦门市',
        'child' => 
        array (
          1468 => 
          array (
            'id' => '1468',
            'name' => '思明区',
          ),
          1469 => 
          array (
            'id' => '1469',
            'name' => '海沧区',
          ),
          1470 => 
          array (
            'id' => '1470',
            'name' => '湖里区',
          ),
          1471 => 
          array (
            'id' => '1471',
            'name' => '集美区',
          ),
          1472 => 
          array (
            'id' => '1472',
            'name' => '同安区',
          ),
          1473 => 
          array (
            'id' => '1473',
            'name' => '翔安区',
          ),
          1474 => 
          array (
            'id' => '1474',
            'name' => '鼓浪屿区',
          ),
          1475 => 
          array (
            'id' => '1475',
            'name' => '象屿保税区',
          ),
          1476 => 
          array (
            'id' => '1476',
            'name' => '火炬高新区',
          ),
        ),
      ),
      152 => 
      array (
        'id' => '152',
        'name' => '莆田市',
        'child' => 
        array (
          1477 => 
          array (
            'id' => '1477',
            'name' => '城厢区',
          ),
          1478 => 
          array (
            'id' => '1478',
            'name' => '涵江区',
          ),
          1479 => 
          array (
            'id' => '1479',
            'name' => '荔城区',
          ),
          1480 => 
          array (
            'id' => '1480',
            'name' => '秀屿区',
          ),
          1481 => 
          array (
            'id' => '1481',
            'name' => '仙游县',
          ),
        ),
      ),
      153 => 
      array (
        'id' => '153',
        'name' => '三明市',
        'child' => 
        array (
          1482 => 
          array (
            'id' => '1482',
            'name' => '梅列区',
          ),
          1483 => 
          array (
            'id' => '1483',
            'name' => '三元区',
          ),
          1484 => 
          array (
            'id' => '1484',
            'name' => '明溪县',
          ),
          1485 => 
          array (
            'id' => '1485',
            'name' => '清流县',
          ),
          1486 => 
          array (
            'id' => '1486',
            'name' => '宁化县',
          ),
          1487 => 
          array (
            'id' => '1487',
            'name' => '大田县',
          ),
          1488 => 
          array (
            'id' => '1488',
            'name' => '尤溪县',
          ),
          1489 => 
          array (
            'id' => '1489',
            'name' => '沙县',
          ),
          1490 => 
          array (
            'id' => '1490',
            'name' => '将乐县',
          ),
          1491 => 
          array (
            'id' => '1491',
            'name' => '泰宁县',
          ),
          1492 => 
          array (
            'id' => '1492',
            'name' => '建宁县',
          ),
          1493 => 
          array (
            'id' => '1493',
            'name' => '永安市',
          ),
        ),
      ),
      154 => 
      array (
        'id' => '154',
        'name' => '泉州市',
        'child' => 
        array (
          1494 => 
          array (
            'id' => '1494',
            'name' => '鲤城区',
          ),
          1495 => 
          array (
            'id' => '1495',
            'name' => '丰泽区',
          ),
          1496 => 
          array (
            'id' => '1496',
            'name' => '洛江区',
          ),
          1497 => 
          array (
            'id' => '1497',
            'name' => '泉港区',
          ),
          1498 => 
          array (
            'id' => '1498',
            'name' => '惠安县',
          ),
          1499 => 
          array (
            'id' => '1499',
            'name' => '安溪县',
          ),
          1500 => 
          array (
            'id' => '1500',
            'name' => '永春县',
          ),
          1501 => 
          array (
            'id' => '1501',
            'name' => '德化县',
          ),
          1502 => 
          array (
            'id' => '1502',
            'name' => '金门县',
          ),
          1503 => 
          array (
            'id' => '1503',
            'name' => '石狮市',
          ),
          1504 => 
          array (
            'id' => '1504',
            'name' => '晋江市',
          ),
          1505 => 
          array (
            'id' => '1505',
            'name' => '南安市',
          ),
          1506 => 
          array (
            'id' => '1506',
            'name' => '经济技术开发区',
          ),
        ),
      ),
      155 => 
      array (
        'id' => '155',
        'name' => '漳州市',
        'child' => 
        array (
          1507 => 
          array (
            'id' => '1507',
            'name' => '芗城区',
          ),
          1508 => 
          array (
            'id' => '1508',
            'name' => '龙文区',
          ),
          1509 => 
          array (
            'id' => '1509',
            'name' => '云霄县',
          ),
          1510 => 
          array (
            'id' => '1510',
            'name' => '漳浦县',
          ),
          1511 => 
          array (
            'id' => '1511',
            'name' => '诏安县',
          ),
          1512 => 
          array (
            'id' => '1512',
            'name' => '长泰县',
          ),
          1513 => 
          array (
            'id' => '1513',
            'name' => '东山县',
          ),
          1514 => 
          array (
            'id' => '1514',
            'name' => '南靖县',
          ),
          1515 => 
          array (
            'id' => '1515',
            'name' => '平和县',
          ),
          1516 => 
          array (
            'id' => '1516',
            'name' => '华安县',
          ),
          1517 => 
          array (
            'id' => '1517',
            'name' => '龙海市',
          ),
        ),
      ),
      156 => 
      array (
        'id' => '156',
        'name' => '南平市',
        'child' => 
        array (
          1518 => 
          array (
            'id' => '1518',
            'name' => '延平区',
          ),
          1519 => 
          array (
            'id' => '1519',
            'name' => '顺昌县',
          ),
          1520 => 
          array (
            'id' => '1520',
            'name' => '浦城县',
          ),
          1521 => 
          array (
            'id' => '1521',
            'name' => '光泽县',
          ),
          1522 => 
          array (
            'id' => '1522',
            'name' => '松溪县',
          ),
          1523 => 
          array (
            'id' => '1523',
            'name' => '政和县',
          ),
          1524 => 
          array (
            'id' => '1524',
            'name' => '邵武市',
          ),
          1525 => 
          array (
            'id' => '1525',
            'name' => '武夷山市',
          ),
          1526 => 
          array (
            'id' => '1526',
            'name' => '建瓯市',
          ),
          1527 => 
          array (
            'id' => '1527',
            'name' => '建阳市',
          ),
        ),
      ),
      157 => 
      array (
        'id' => '157',
        'name' => '龙岩市',
        'child' => 
        array (
          1528 => 
          array (
            'id' => '1528',
            'name' => '新罗区',
          ),
          1529 => 
          array (
            'id' => '1529',
            'name' => '长汀县',
          ),
          1530 => 
          array (
            'id' => '1530',
            'name' => '永定县',
          ),
          1531 => 
          array (
            'id' => '1531',
            'name' => '上杭县',
          ),
          1532 => 
          array (
            'id' => '1532',
            'name' => '武平县',
          ),
          1533 => 
          array (
            'id' => '1533',
            'name' => '连城县',
          ),
          1534 => 
          array (
            'id' => '1534',
            'name' => '漳平市',
          ),
        ),
      ),
      158 => 
      array (
        'id' => '158',
        'name' => '宁德市',
        'child' => 
        array (
          1535 => 
          array (
            'id' => '1535',
            'name' => '蕉城区',
          ),
          1536 => 
          array (
            'id' => '1536',
            'name' => '霞浦县',
          ),
          1537 => 
          array (
            'id' => '1537',
            'name' => '古田县',
          ),
          1538 => 
          array (
            'id' => '1538',
            'name' => '屏南县',
          ),
          1539 => 
          array (
            'id' => '1539',
            'name' => '寿宁县',
          ),
          1540 => 
          array (
            'id' => '1540',
            'name' => '周宁县',
          ),
          1541 => 
          array (
            'id' => '1541',
            'name' => '柘荣县',
          ),
          1542 => 
          array (
            'id' => '1542',
            'name' => '福安市',
          ),
          1543 => 
          array (
            'id' => '1543',
            'name' => '福鼎市',
          ),
        ),
      ),
    ),
  ),
  15 => 
  array (
    'id' => '15',
    'name' => '江西省',
    'child' => 
    array (
      159 => 
      array (
        'id' => '159',
        'name' => '南昌市',
        'child' => 
        array (
          1544 => 
          array (
            'id' => '1544',
            'name' => '东湖区',
          ),
          1545 => 
          array (
            'id' => '1545',
            'name' => '西湖区',
          ),
          1546 => 
          array (
            'id' => '1546',
            'name' => '青云谱区',
          ),
          1547 => 
          array (
            'id' => '1547',
            'name' => '湾里区',
          ),
          1548 => 
          array (
            'id' => '1548',
            'name' => '青山湖区',
          ),
          1549 => 
          array (
            'id' => '1549',
            'name' => '南昌县',
          ),
          1550 => 
          array (
            'id' => '1550',
            'name' => '新建县',
          ),
          1551 => 
          array (
            'id' => '1551',
            'name' => '安义县',
          ),
          1552 => 
          array (
            'id' => '1552',
            'name' => '进贤县',
          ),
          1553 => 
          array (
            'id' => '1553',
            'name' => '经济技术开发区',
          ),
          1554 => 
          array (
            'id' => '1554',
            'name' => '红谷滩新区',
          ),
          1555 => 
          array (
            'id' => '1555',
            'name' => '高新技术产业开发区',
          ),
          1556 => 
          array (
            'id' => '1556',
            'name' => '桑海经济技术开发区',
          ),
          1557 => 
          array (
            'id' => '1557',
            'name' => '英雄经济开发区',
          ),
        ),
      ),
      160 => 
      array (
        'id' => '160',
        'name' => '景德镇市',
        'child' => 
        array (
          1558 => 
          array (
            'id' => '1558',
            'name' => '昌江区',
          ),
          1559 => 
          array (
            'id' => '1559',
            'name' => '珠山区',
          ),
          1560 => 
          array (
            'id' => '1560',
            'name' => '浮梁县',
          ),
          1561 => 
          array (
            'id' => '1561',
            'name' => '乐平市',
          ),
        ),
      ),
      161 => 
      array (
        'id' => '161',
        'name' => '萍乡市',
        'child' => 
        array (
          1562 => 
          array (
            'id' => '1562',
            'name' => '安源区',
          ),
          1563 => 
          array (
            'id' => '1563',
            'name' => '湘东区',
          ),
          1564 => 
          array (
            'id' => '1564',
            'name' => '莲花县',
          ),
          1565 => 
          array (
            'id' => '1565',
            'name' => '上栗县',
          ),
          1566 => 
          array (
            'id' => '1566',
            'name' => '芦溪县',
          ),
        ),
      ),
      162 => 
      array (
        'id' => '162',
        'name' => '九江市',
        'child' => 
        array (
          1567 => 
          array (
            'id' => '1567',
            'name' => '庐山区',
          ),
          1568 => 
          array (
            'id' => '1568',
            'name' => '浔阳区',
          ),
          1569 => 
          array (
            'id' => '1569',
            'name' => '九江县',
          ),
          1570 => 
          array (
            'id' => '1570',
            'name' => '武宁县',
          ),
          1571 => 
          array (
            'id' => '1571',
            'name' => '修水县',
          ),
          1572 => 
          array (
            'id' => '1572',
            'name' => '永修县',
          ),
          1573 => 
          array (
            'id' => '1573',
            'name' => '德安县',
          ),
          1574 => 
          array (
            'id' => '1574',
            'name' => '星子县',
          ),
          1575 => 
          array (
            'id' => '1575',
            'name' => '都昌县',
          ),
          1576 => 
          array (
            'id' => '1576',
            'name' => '湖口县',
          ),
          1577 => 
          array (
            'id' => '1577',
            'name' => '彭泽县',
          ),
          1578 => 
          array (
            'id' => '1578',
            'name' => '瑞昌市',
          ),
          1579 => 
          array (
            'id' => '1579',
            'name' => '共青城市',
          ),
        ),
      ),
      163 => 
      array (
        'id' => '163',
        'name' => '新余市',
        'child' => 
        array (
          1580 => 
          array (
            'id' => '1580',
            'name' => '渝水区',
          ),
          1581 => 
          array (
            'id' => '1581',
            'name' => '分宜县',
          ),
        ),
      ),
      164 => 
      array (
        'id' => '164',
        'name' => '鹰潭市',
        'child' => 
        array (
          1582 => 
          array (
            'id' => '1582',
            'name' => '月湖区',
          ),
          1583 => 
          array (
            'id' => '1583',
            'name' => '余江县',
          ),
          1584 => 
          array (
            'id' => '1584',
            'name' => '贵溪市',
          ),
        ),
      ),
      165 => 
      array (
        'id' => '165',
        'name' => '赣州市',
        'child' => 
        array (
          1585 => 
          array (
            'id' => '1585',
            'name' => '章贡区',
          ),
          1586 => 
          array (
            'id' => '1586',
            'name' => '赣县',
          ),
          1587 => 
          array (
            'id' => '1587',
            'name' => '信丰县',
          ),
          1588 => 
          array (
            'id' => '1588',
            'name' => '大余县',
          ),
          1589 => 
          array (
            'id' => '1589',
            'name' => '上犹县',
          ),
          1590 => 
          array (
            'id' => '1590',
            'name' => '崇义县',
          ),
          1591 => 
          array (
            'id' => '1591',
            'name' => '安远县',
          ),
          1592 => 
          array (
            'id' => '1592',
            'name' => '龙南县',
          ),
          1593 => 
          array (
            'id' => '1593',
            'name' => '定南县',
          ),
          1594 => 
          array (
            'id' => '1594',
            'name' => '全南县',
          ),
          1595 => 
          array (
            'id' => '1595',
            'name' => '宁都县',
          ),
          1596 => 
          array (
            'id' => '1596',
            'name' => '于都县',
          ),
          1597 => 
          array (
            'id' => '1597',
            'name' => '兴国县',
          ),
          1598 => 
          array (
            'id' => '1598',
            'name' => '会昌县',
          ),
          1599 => 
          array (
            'id' => '1599',
            'name' => '寻乌县',
          ),
          1600 => 
          array (
            'id' => '1600',
            'name' => '石城县',
          ),
          1601 => 
          array (
            'id' => '1601',
            'name' => '瑞金市',
          ),
          1602 => 
          array (
            'id' => '1602',
            'name' => '南康市',
          ),
        ),
      ),
      166 => 
      array (
        'id' => '166',
        'name' => '吉安市',
        'child' => 
        array (
          1603 => 
          array (
            'id' => '1603',
            'name' => '吉州区',
          ),
          1604 => 
          array (
            'id' => '1604',
            'name' => '青原区',
          ),
          1605 => 
          array (
            'id' => '1605',
            'name' => '吉安县',
          ),
          1606 => 
          array (
            'id' => '1606',
            'name' => '吉水县',
          ),
          1607 => 
          array (
            'id' => '1607',
            'name' => '峡江县',
          ),
          1608 => 
          array (
            'id' => '1608',
            'name' => '新干县',
          ),
          1609 => 
          array (
            'id' => '1609',
            'name' => '永丰县',
          ),
          1610 => 
          array (
            'id' => '1610',
            'name' => '泰和县',
          ),
          1611 => 
          array (
            'id' => '1611',
            'name' => '遂川县',
          ),
          1612 => 
          array (
            'id' => '1612',
            'name' => '万安县',
          ),
          1613 => 
          array (
            'id' => '1613',
            'name' => '安福县',
          ),
          1614 => 
          array (
            'id' => '1614',
            'name' => '永新县',
          ),
          1615 => 
          array (
            'id' => '1615',
            'name' => '井冈山市',
          ),
        ),
      ),
      167 => 
      array (
        'id' => '167',
        'name' => '宜春市',
        'child' => 
        array (
          1616 => 
          array (
            'id' => '1616',
            'name' => '袁州区',
          ),
          1617 => 
          array (
            'id' => '1617',
            'name' => '奉新县',
          ),
          1618 => 
          array (
            'id' => '1618',
            'name' => '万载县',
          ),
          1619 => 
          array (
            'id' => '1619',
            'name' => '上高县',
          ),
          1620 => 
          array (
            'id' => '1620',
            'name' => '宜丰县',
          ),
          1621 => 
          array (
            'id' => '1621',
            'name' => '靖安县',
          ),
          1622 => 
          array (
            'id' => '1622',
            'name' => '铜鼓县',
          ),
          1623 => 
          array (
            'id' => '1623',
            'name' => '丰城市',
          ),
          1624 => 
          array (
            'id' => '1624',
            'name' => '樟树市',
          ),
          1625 => 
          array (
            'id' => '1625',
            'name' => '高安市',
          ),
        ),
      ),
      168 => 
      array (
        'id' => '168',
        'name' => '抚州市',
        'child' => 
        array (
          1626 => 
          array (
            'id' => '1626',
            'name' => '临川区',
          ),
          1627 => 
          array (
            'id' => '1627',
            'name' => '南城县',
          ),
          1628 => 
          array (
            'id' => '1628',
            'name' => '黎川县',
          ),
          1629 => 
          array (
            'id' => '1629',
            'name' => '南丰县',
          ),
          1630 => 
          array (
            'id' => '1630',
            'name' => '崇仁县',
          ),
          1631 => 
          array (
            'id' => '1631',
            'name' => '乐安县',
          ),
          1632 => 
          array (
            'id' => '1632',
            'name' => '宜黄县',
          ),
          1633 => 
          array (
            'id' => '1633',
            'name' => '金溪县',
          ),
          1634 => 
          array (
            'id' => '1634',
            'name' => '资溪县',
          ),
          1635 => 
          array (
            'id' => '1635',
            'name' => '东乡县',
          ),
          1636 => 
          array (
            'id' => '1636',
            'name' => '广昌县',
          ),
        ),
      ),
      169 => 
      array (
        'id' => '169',
        'name' => '上饶市',
        'child' => 
        array (
          1637 => 
          array (
            'id' => '1637',
            'name' => '信州区',
          ),
          1638 => 
          array (
            'id' => '1638',
            'name' => '上饶县',
          ),
          1639 => 
          array (
            'id' => '1639',
            'name' => '广丰县',
          ),
          1640 => 
          array (
            'id' => '1640',
            'name' => '玉山县',
          ),
          1641 => 
          array (
            'id' => '1641',
            'name' => '铅山县',
          ),
          1642 => 
          array (
            'id' => '1642',
            'name' => '横峰县',
          ),
          1643 => 
          array (
            'id' => '1643',
            'name' => '弋阳县',
          ),
          1644 => 
          array (
            'id' => '1644',
            'name' => '余干县',
          ),
          1645 => 
          array (
            'id' => '1645',
            'name' => '鄱阳县',
          ),
          1646 => 
          array (
            'id' => '1646',
            'name' => '万年县',
          ),
          1647 => 
          array (
            'id' => '1647',
            'name' => '婺源县',
          ),
          1648 => 
          array (
            'id' => '1648',
            'name' => '德兴市',
          ),
        ),
      ),
    ),
  ),
  16 => 
  array (
    'id' => '16',
    'name' => '山东省',
    'child' => 
    array (
      170 => 
      array (
        'id' => '170',
        'name' => '济南市',
        'child' => 
        array (
          1649 => 
          array (
            'id' => '1649',
            'name' => '历下区',
          ),
          1650 => 
          array (
            'id' => '1650',
            'name' => '市中区',
          ),
          1651 => 
          array (
            'id' => '1651',
            'name' => '槐荫区',
          ),
          1652 => 
          array (
            'id' => '1652',
            'name' => '天桥区',
          ),
          1653 => 
          array (
            'id' => '1653',
            'name' => '历城区',
          ),
          1654 => 
          array (
            'id' => '1654',
            'name' => '长清区',
          ),
          1655 => 
          array (
            'id' => '1655',
            'name' => '平阴县',
          ),
          1656 => 
          array (
            'id' => '1656',
            'name' => '济阳县',
          ),
          1657 => 
          array (
            'id' => '1657',
            'name' => '商河县',
          ),
          1658 => 
          array (
            'id' => '1658',
            'name' => '章丘市',
          ),
          1659 => 
          array (
            'id' => '1659',
            'name' => '高新区',
          ),
          1660 => 
          array (
            'id' => '1660',
            'name' => '经济开发区',
          ),
        ),
      ),
      171 => 
      array (
        'id' => '171',
        'name' => '青岛市',
        'child' => 
        array (
          1661 => 
          array (
            'id' => '1661',
            'name' => '市南区',
          ),
          1662 => 
          array (
            'id' => '1662',
            'name' => '市北区',
          ),
          1663 => 
          array (
            'id' => '1663',
            'name' => '四方区',
          ),
          1664 => 
          array (
            'id' => '1664',
            'name' => '黄岛区',
          ),
          1665 => 
          array (
            'id' => '1665',
            'name' => '崂山区',
          ),
          1666 => 
          array (
            'id' => '1666',
            'name' => '李沧区',
          ),
          1667 => 
          array (
            'id' => '1667',
            'name' => '城阳区',
          ),
          1668 => 
          array (
            'id' => '1668',
            'name' => '胶州市',
          ),
          1669 => 
          array (
            'id' => '1669',
            'name' => '即墨市',
          ),
          1670 => 
          array (
            'id' => '1670',
            'name' => '平度市',
          ),
          1671 => 
          array (
            'id' => '1671',
            'name' => '胶南市',
          ),
          1672 => 
          array (
            'id' => '1672',
            'name' => '莱西市',
          ),
        ),
      ),
      172 => 
      array (
        'id' => '172',
        'name' => '淄博市',
        'child' => 
        array (
          1673 => 
          array (
            'id' => '1673',
            'name' => '淄川区',
          ),
          1674 => 
          array (
            'id' => '1674',
            'name' => '张店区',
          ),
          1675 => 
          array (
            'id' => '1675',
            'name' => '博山区',
          ),
          1676 => 
          array (
            'id' => '1676',
            'name' => '临淄区',
          ),
          1677 => 
          array (
            'id' => '1677',
            'name' => '周村区',
          ),
          1678 => 
          array (
            'id' => '1678',
            'name' => '桓台县',
          ),
          1679 => 
          array (
            'id' => '1679',
            'name' => '高青县',
          ),
          1680 => 
          array (
            'id' => '1680',
            'name' => '沂源县',
          ),
          1681 => 
          array (
            'id' => '1681',
            'name' => '高新区',
          ),
        ),
      ),
      173 => 
      array (
        'id' => '173',
        'name' => '枣庄市',
        'child' => 
        array (
          1682 => 
          array (
            'id' => '1682',
            'name' => '市中区',
          ),
          1683 => 
          array (
            'id' => '1683',
            'name' => '薛城区',
          ),
          1684 => 
          array (
            'id' => '1684',
            'name' => '峄城区',
          ),
          1685 => 
          array (
            'id' => '1685',
            'name' => '台儿庄区',
          ),
          1686 => 
          array (
            'id' => '1686',
            'name' => '山亭区',
          ),
          1687 => 
          array (
            'id' => '1687',
            'name' => '滕州市',
          ),
        ),
      ),
      174 => 
      array (
        'id' => '174',
        'name' => '东营市',
        'child' => 
        array (
          1688 => 
          array (
            'id' => '1688',
            'name' => '东营区',
          ),
          1689 => 
          array (
            'id' => '1689',
            'name' => '河口区',
          ),
          1690 => 
          array (
            'id' => '1690',
            'name' => '垦利县',
          ),
          1691 => 
          array (
            'id' => '1691',
            'name' => '利津县',
          ),
          1692 => 
          array (
            'id' => '1692',
            'name' => '广饶县',
          ),
        ),
      ),
      175 => 
      array (
        'id' => '175',
        'name' => '烟台市',
        'child' => 
        array (
          1693 => 
          array (
            'id' => '1693',
            'name' => '芝罘区',
          ),
          1694 => 
          array (
            'id' => '1694',
            'name' => '福山区',
          ),
          1695 => 
          array (
            'id' => '1695',
            'name' => '牟平区',
          ),
          1696 => 
          array (
            'id' => '1696',
            'name' => '莱山区',
          ),
          1697 => 
          array (
            'id' => '1697',
            'name' => '长岛县',
          ),
          1698 => 
          array (
            'id' => '1698',
            'name' => '龙口市',
          ),
          1699 => 
          array (
            'id' => '1699',
            'name' => '莱阳市',
          ),
          1700 => 
          array (
            'id' => '1700',
            'name' => '莱州市',
          ),
          1701 => 
          array (
            'id' => '1701',
            'name' => '蓬莱市',
          ),
          1702 => 
          array (
            'id' => '1702',
            'name' => '招远市',
          ),
          1703 => 
          array (
            'id' => '1703',
            'name' => '栖霞市',
          ),
          1704 => 
          array (
            'id' => '1704',
            'name' => '海阳市',
          ),
          1705 => 
          array (
            'id' => '1705',
            'name' => '开发区',
          ),
        ),
      ),
      176 => 
      array (
        'id' => '176',
        'name' => '潍坊市',
        'child' => 
        array (
          1706 => 
          array (
            'id' => '1706',
            'name' => '潍城区',
          ),
          1707 => 
          array (
            'id' => '1707',
            'name' => '寒亭区',
          ),
          1708 => 
          array (
            'id' => '1708',
            'name' => '坊子区',
          ),
          1709 => 
          array (
            'id' => '1709',
            'name' => '奎文区',
          ),
          1710 => 
          array (
            'id' => '1710',
            'name' => '临朐县',
          ),
          1711 => 
          array (
            'id' => '1711',
            'name' => '昌乐县',
          ),
          1712 => 
          array (
            'id' => '1712',
            'name' => '青州市',
          ),
          1713 => 
          array (
            'id' => '1713',
            'name' => '诸城市',
          ),
          1714 => 
          array (
            'id' => '1714',
            'name' => '寿光市',
          ),
          1715 => 
          array (
            'id' => '1715',
            'name' => '安丘市',
          ),
          1716 => 
          array (
            'id' => '1716',
            'name' => '高密市',
          ),
          1717 => 
          array (
            'id' => '1717',
            'name' => '昌邑市',
          ),
          1718 => 
          array (
            'id' => '1718',
            'name' => '经济开发区',
          ),
          1719 => 
          array (
            'id' => '1719',
            'name' => '滨海经济开发区',
          ),
          1720 => 
          array (
            'id' => '1720',
            'name' => '高新技术开发区',
          ),
          1721 => 
          array (
            'id' => '1721',
            'name' => '出口加工区',
          ),
        ),
      ),
      177 => 
      array (
        'id' => '177',
        'name' => '济宁市',
        'child' => 
        array (
          1722 => 
          array (
            'id' => '1722',
            'name' => '市中区',
          ),
          1723 => 
          array (
            'id' => '1723',
            'name' => '任城区',
          ),
          1724 => 
          array (
            'id' => '1724',
            'name' => '微山县',
          ),
          1725 => 
          array (
            'id' => '1725',
            'name' => '鱼台县',
          ),
          1726 => 
          array (
            'id' => '1726',
            'name' => '金乡县',
          ),
          1727 => 
          array (
            'id' => '1727',
            'name' => '嘉祥县',
          ),
          1728 => 
          array (
            'id' => '1728',
            'name' => '汶上县',
          ),
          1729 => 
          array (
            'id' => '1729',
            'name' => '泗水县',
          ),
          1730 => 
          array (
            'id' => '1730',
            'name' => '梁山县',
          ),
          1731 => 
          array (
            'id' => '1731',
            'name' => '曲阜市',
          ),
          1732 => 
          array (
            'id' => '1732',
            'name' => '兖州市',
          ),
          1733 => 
          array (
            'id' => '1733',
            'name' => '邹城市',
          ),
        ),
      ),
      178 => 
      array (
        'id' => '178',
        'name' => '泰安市',
        'child' => 
        array (
          1734 => 
          array (
            'id' => '1734',
            'name' => '泰山区',
          ),
          1735 => 
          array (
            'id' => '1735',
            'name' => '岱岳区',
          ),
          1736 => 
          array (
            'id' => '1736',
            'name' => '宁阳县',
          ),
          1737 => 
          array (
            'id' => '1737',
            'name' => '东平县',
          ),
          1738 => 
          array (
            'id' => '1738',
            'name' => '新泰市',
          ),
          1739 => 
          array (
            'id' => '1739',
            'name' => '肥城市',
          ),
        ),
      ),
      179 => 
      array (
        'id' => '179',
        'name' => '威海市',
        'child' => 
        array (
          1740 => 
          array (
            'id' => '1740',
            'name' => '环翠区',
          ),
          1741 => 
          array (
            'id' => '1741',
            'name' => '文登市',
          ),
          1742 => 
          array (
            'id' => '1742',
            'name' => '荣成市',
          ),
          1743 => 
          array (
            'id' => '1743',
            'name' => '乳山市',
          ),
          1744 => 
          array (
            'id' => '1744',
            'name' => '经济技术开发区',
          ),
          1745 => 
          array (
            'id' => '1745',
            'name' => '高新技术开发区',
          ),
        ),
      ),
      180 => 
      array (
        'id' => '180',
        'name' => '日照市',
        'child' => 
        array (
          1746 => 
          array (
            'id' => '1746',
            'name' => '东港区',
          ),
          1747 => 
          array (
            'id' => '1747',
            'name' => '岚山区',
          ),
          1748 => 
          array (
            'id' => '1748',
            'name' => '五莲县',
          ),
          1749 => 
          array (
            'id' => '1749',
            'name' => '莒县',
          ),
        ),
      ),
      181 => 
      array (
        'id' => '181',
        'name' => '莱芜市',
        'child' => 
        array (
          1750 => 
          array (
            'id' => '1750',
            'name' => '莱城区',
          ),
          1751 => 
          array (
            'id' => '1751',
            'name' => '钢城区',
          ),
        ),
      ),
      182 => 
      array (
        'id' => '182',
        'name' => '临沂市',
        'child' => 
        array (
          1752 => 
          array (
            'id' => '1752',
            'name' => '兰山区',
          ),
          1753 => 
          array (
            'id' => '1753',
            'name' => '罗庄区',
          ),
          1754 => 
          array (
            'id' => '1754',
            'name' => '河东区',
          ),
          1755 => 
          array (
            'id' => '1755',
            'name' => '沂南县',
          ),
          1756 => 
          array (
            'id' => '1756',
            'name' => '郯城县',
          ),
          1757 => 
          array (
            'id' => '1757',
            'name' => '沂水县',
          ),
          1758 => 
          array (
            'id' => '1758',
            'name' => '苍山县',
          ),
          1759 => 
          array (
            'id' => '1759',
            'name' => '费县',
          ),
          1760 => 
          array (
            'id' => '1760',
            'name' => '平邑县',
          ),
          1761 => 
          array (
            'id' => '1761',
            'name' => '莒南县',
          ),
          1762 => 
          array (
            'id' => '1762',
            'name' => '蒙阴县',
          ),
          1763 => 
          array (
            'id' => '1763',
            'name' => '临沭县',
          ),
        ),
      ),
      183 => 
      array (
        'id' => '183',
        'name' => '德州市',
        'child' => 
        array (
          1764 => 
          array (
            'id' => '1764',
            'name' => '德城区',
          ),
          1765 => 
          array (
            'id' => '1765',
            'name' => '陵县',
          ),
          1766 => 
          array (
            'id' => '1766',
            'name' => '宁津县',
          ),
          1767 => 
          array (
            'id' => '1767',
            'name' => '庆云县',
          ),
          1768 => 
          array (
            'id' => '1768',
            'name' => '临邑县',
          ),
          1769 => 
          array (
            'id' => '1769',
            'name' => '齐河县',
          ),
          1770 => 
          array (
            'id' => '1770',
            'name' => '平原县',
          ),
          1771 => 
          array (
            'id' => '1771',
            'name' => '夏津县',
          ),
          1772 => 
          array (
            'id' => '1772',
            'name' => '武城县',
          ),
          1773 => 
          array (
            'id' => '1773',
            'name' => '乐陵市',
          ),
          1774 => 
          array (
            'id' => '1774',
            'name' => '禹城市',
          ),
        ),
      ),
      184 => 
      array (
        'id' => '184',
        'name' => '聊城市',
        'child' => 
        array (
          1775 => 
          array (
            'id' => '1775',
            'name' => '东昌府区',
          ),
          1776 => 
          array (
            'id' => '1776',
            'name' => '阳谷县',
          ),
          1777 => 
          array (
            'id' => '1777',
            'name' => '莘县',
          ),
          1778 => 
          array (
            'id' => '1778',
            'name' => '茌平县',
          ),
          1779 => 
          array (
            'id' => '1779',
            'name' => '东阿县',
          ),
          1780 => 
          array (
            'id' => '1780',
            'name' => '冠县',
          ),
          1781 => 
          array (
            'id' => '1781',
            'name' => '高唐县',
          ),
          1782 => 
          array (
            'id' => '1782',
            'name' => '临清市',
          ),
        ),
      ),
      185 => 
      array (
        'id' => '185',
        'name' => '滨州市',
        'child' => 
        array (
          1783 => 
          array (
            'id' => '1783',
            'name' => '滨城区',
          ),
          1784 => 
          array (
            'id' => '1784',
            'name' => '惠民县',
          ),
          1785 => 
          array (
            'id' => '1785',
            'name' => '阳信县',
          ),
          1786 => 
          array (
            'id' => '1786',
            'name' => '无棣县',
          ),
          1787 => 
          array (
            'id' => '1787',
            'name' => '沾化县',
          ),
          1788 => 
          array (
            'id' => '1788',
            'name' => '博兴县',
          ),
          1789 => 
          array (
            'id' => '1789',
            'name' => '邹平县',
          ),
        ),
      ),
      186 => 
      array (
        'id' => '186',
        'name' => '菏泽市',
        'child' => 
        array (
          1790 => 
          array (
            'id' => '1790',
            'name' => '牡丹区',
          ),
          1791 => 
          array (
            'id' => '1791',
            'name' => '曹县',
          ),
          1792 => 
          array (
            'id' => '1792',
            'name' => '单县',
          ),
          1793 => 
          array (
            'id' => '1793',
            'name' => '成武县',
          ),
          1794 => 
          array (
            'id' => '1794',
            'name' => '巨野县',
          ),
          1795 => 
          array (
            'id' => '1795',
            'name' => '郓城县',
          ),
          1796 => 
          array (
            'id' => '1796',
            'name' => '鄄城县',
          ),
          1797 => 
          array (
            'id' => '1797',
            'name' => '定陶县',
          ),
          1798 => 
          array (
            'id' => '1798',
            'name' => '东明县',
          ),
        ),
      ),
    ),
  ),
  17 => 
  array (
    'id' => '17',
    'name' => '河南省',
    'child' => 
    array (
      187 => 
      array (
        'id' => '187',
        'name' => '郑州市',
        'child' => 
        array (
          1799 => 
          array (
            'id' => '1799',
            'name' => '中原区',
          ),
          1800 => 
          array (
            'id' => '1800',
            'name' => '二七区',
          ),
          1801 => 
          array (
            'id' => '1801',
            'name' => '管城回族区',
          ),
          1802 => 
          array (
            'id' => '1802',
            'name' => '金水区',
          ),
          1803 => 
          array (
            'id' => '1803',
            'name' => '上街区',
          ),
          1804 => 
          array (
            'id' => '1804',
            'name' => '中牟县',
          ),
          1805 => 
          array (
            'id' => '1805',
            'name' => '巩义市',
          ),
          1806 => 
          array (
            'id' => '1806',
            'name' => '荥阳市',
          ),
          1807 => 
          array (
            'id' => '1807',
            'name' => '新密市',
          ),
          1808 => 
          array (
            'id' => '1808',
            'name' => '新郑市',
          ),
          1809 => 
          array (
            'id' => '1809',
            'name' => '登封市',
          ),
          1810 => 
          array (
            'id' => '1810',
            'name' => '高新技术开发区',
          ),
          1811 => 
          array (
            'id' => '1811',
            'name' => '惠济区',
          ),
          1812 => 
          array (
            'id' => '1812',
            'name' => '经济技术开发区',
          ),
          1813 => 
          array (
            'id' => '1813',
            'name' => '郑东新区',
          ),
          1814 => 
          array (
            'id' => '1814',
            'name' => '出口加工区',
          ),
        ),
      ),
      188 => 
      array (
        'id' => '188',
        'name' => '开封市',
        'child' => 
        array (
          1815 => 
          array (
            'id' => '1815',
            'name' => '龙亭区',
          ),
          1816 => 
          array (
            'id' => '1816',
            'name' => '顺河回族区',
          ),
          1817 => 
          array (
            'id' => '1817',
            'name' => '鼓楼区',
          ),
          1818 => 
          array (
            'id' => '1818',
            'name' => '杞县',
          ),
          1819 => 
          array (
            'id' => '1819',
            'name' => '通许县',
          ),
          1820 => 
          array (
            'id' => '1820',
            'name' => '尉氏县',
          ),
          1821 => 
          array (
            'id' => '1821',
            'name' => '开封县',
          ),
          1822 => 
          array (
            'id' => '1822',
            'name' => '兰考县',
          ),
          1823 => 
          array (
            'id' => '1823',
            'name' => '金明区',
          ),
          1824 => 
          array (
            'id' => '1824',
            'name' => '禹王台区',
          ),
        ),
      ),
      189 => 
      array (
        'id' => '189',
        'name' => '洛阳市',
        'child' => 
        array (
          1825 => 
          array (
            'id' => '1825',
            'name' => '老城区',
          ),
          1826 => 
          array (
            'id' => '1826',
            'name' => '西工区',
          ),
          1827 => 
          array (
            'id' => '1827',
            'name' => '瀍河回族区',
          ),
          1828 => 
          array (
            'id' => '1828',
            'name' => '涧西区',
          ),
          1829 => 
          array (
            'id' => '1829',
            'name' => '吉利区',
          ),
          1830 => 
          array (
            'id' => '1830',
            'name' => '洛龙区',
          ),
          1831 => 
          array (
            'id' => '1831',
            'name' => '孟津县',
          ),
          1832 => 
          array (
            'id' => '1832',
            'name' => '新安县',
          ),
          1833 => 
          array (
            'id' => '1833',
            'name' => '栾川县',
          ),
          1834 => 
          array (
            'id' => '1834',
            'name' => '嵩县',
          ),
          1835 => 
          array (
            'id' => '1835',
            'name' => '汝阳县',
          ),
          1836 => 
          array (
            'id' => '1836',
            'name' => '宜阳县',
          ),
          1837 => 
          array (
            'id' => '1837',
            'name' => '洛宁县',
          ),
          1838 => 
          array (
            'id' => '1838',
            'name' => '伊川县',
          ),
          1839 => 
          array (
            'id' => '1839',
            'name' => '偃师市',
          ),
          1840 => 
          array (
            'id' => '1840',
            'name' => '高新技术开发区',
          ),
          1841 => 
          array (
            'id' => '1841',
            'name' => '经济技术开发区',
          ),
        ),
      ),
      190 => 
      array (
        'id' => '190',
        'name' => '平顶山市',
        'child' => 
        array (
          1842 => 
          array (
            'id' => '1842',
            'name' => '新华区',
          ),
          1843 => 
          array (
            'id' => '1843',
            'name' => '卫东区',
          ),
          1844 => 
          array (
            'id' => '1844',
            'name' => '石龙区',
          ),
          1845 => 
          array (
            'id' => '1845',
            'name' => '湛河区',
          ),
          1846 => 
          array (
            'id' => '1846',
            'name' => '宝丰县',
          ),
          1847 => 
          array (
            'id' => '1847',
            'name' => '叶县',
          ),
          1848 => 
          array (
            'id' => '1848',
            'name' => '鲁山县',
          ),
          1849 => 
          array (
            'id' => '1849',
            'name' => '郏县',
          ),
          1850 => 
          array (
            'id' => '1850',
            'name' => '舞钢市',
          ),
          1851 => 
          array (
            'id' => '1851',
            'name' => '汝州市',
          ),
        ),
      ),
      191 => 
      array (
        'id' => '191',
        'name' => '安阳市',
        'child' => 
        array (
          1852 => 
          array (
            'id' => '1852',
            'name' => '文峰区',
          ),
          1853 => 
          array (
            'id' => '1853',
            'name' => '北关区',
          ),
          1854 => 
          array (
            'id' => '1854',
            'name' => '殷都区',
          ),
          1855 => 
          array (
            'id' => '1855',
            'name' => '龙安区',
          ),
          1856 => 
          array (
            'id' => '1856',
            'name' => '安阳县',
          ),
          1857 => 
          array (
            'id' => '1857',
            'name' => '汤阴县',
          ),
          1858 => 
          array (
            'id' => '1858',
            'name' => '滑县',
          ),
          1859 => 
          array (
            'id' => '1859',
            'name' => '内黄县',
          ),
          1860 => 
          array (
            'id' => '1860',
            'name' => '林州市',
          ),
        ),
      ),
      192 => 
      array (
        'id' => '192',
        'name' => '鹤壁市',
        'child' => 
        array (
          1861 => 
          array (
            'id' => '1861',
            'name' => '鹤山区',
          ),
          1862 => 
          array (
            'id' => '1862',
            'name' => '山城区',
          ),
          1863 => 
          array (
            'id' => '1863',
            'name' => '淇滨区',
          ),
          1864 => 
          array (
            'id' => '1864',
            'name' => '浚县',
          ),
          1865 => 
          array (
            'id' => '1865',
            'name' => '淇县',
          ),
        ),
      ),
      193 => 
      array (
        'id' => '193',
        'name' => '新乡市',
        'child' => 
        array (
          1866 => 
          array (
            'id' => '1866',
            'name' => '红旗区',
          ),
          1867 => 
          array (
            'id' => '1867',
            'name' => '卫滨区',
          ),
          1868 => 
          array (
            'id' => '1868',
            'name' => '凤泉区',
          ),
          1869 => 
          array (
            'id' => '1869',
            'name' => '牧野区',
          ),
          1870 => 
          array (
            'id' => '1870',
            'name' => '新乡县',
          ),
          1871 => 
          array (
            'id' => '1871',
            'name' => '获嘉县',
          ),
          1872 => 
          array (
            'id' => '1872',
            'name' => '原阳县',
          ),
          1873 => 
          array (
            'id' => '1873',
            'name' => '延津县',
          ),
          1874 => 
          array (
            'id' => '1874',
            'name' => '封丘县',
          ),
          1875 => 
          array (
            'id' => '1875',
            'name' => '长垣县',
          ),
          1876 => 
          array (
            'id' => '1876',
            'name' => '卫辉市',
          ),
          1877 => 
          array (
            'id' => '1877',
            'name' => '辉县市',
          ),
        ),
      ),
      194 => 
      array (
        'id' => '194',
        'name' => '焦作市',
        'child' => 
        array (
          1878 => 
          array (
            'id' => '1878',
            'name' => '解放区',
          ),
          1879 => 
          array (
            'id' => '1879',
            'name' => '中站区',
          ),
          1880 => 
          array (
            'id' => '1880',
            'name' => '马村区',
          ),
          1881 => 
          array (
            'id' => '1881',
            'name' => '山阳区',
          ),
          1882 => 
          array (
            'id' => '1882',
            'name' => '修武县',
          ),
          1883 => 
          array (
            'id' => '1883',
            'name' => '博爱县',
          ),
          1884 => 
          array (
            'id' => '1884',
            'name' => '武陟县',
          ),
          1885 => 
          array (
            'id' => '1885',
            'name' => '温县',
          ),
          1886 => 
          array (
            'id' => '1886',
            'name' => '沁阳市',
          ),
          1887 => 
          array (
            'id' => '1887',
            'name' => '孟州市',
          ),
        ),
      ),
      195 => 
      array (
        'id' => '195',
        'name' => '济源市',
        'child' => 
        array (
          1888 => 
          array (
            'id' => '1888',
            'name' => '济源市',
          ),
        ),
      ),
      196 => 
      array (
        'id' => '196',
        'name' => '濮阳市',
        'child' => 
        array (
          1889 => 
          array (
            'id' => '1889',
            'name' => '华龙区',
          ),
          1890 => 
          array (
            'id' => '1890',
            'name' => '清丰县',
          ),
          1891 => 
          array (
            'id' => '1891',
            'name' => '南乐县',
          ),
          1892 => 
          array (
            'id' => '1892',
            'name' => '范县',
          ),
          1893 => 
          array (
            'id' => '1893',
            'name' => '台前县',
          ),
          1894 => 
          array (
            'id' => '1894',
            'name' => '濮阳县',
          ),
        ),
      ),
      197 => 
      array (
        'id' => '197',
        'name' => '许昌市',
        'child' => 
        array (
          1895 => 
          array (
            'id' => '1895',
            'name' => '魏都区',
          ),
          1896 => 
          array (
            'id' => '1896',
            'name' => '许昌县',
          ),
          1897 => 
          array (
            'id' => '1897',
            'name' => '鄢陵县',
          ),
          1898 => 
          array (
            'id' => '1898',
            'name' => '襄城县',
          ),
          1899 => 
          array (
            'id' => '1899',
            'name' => '禹州市',
          ),
          1900 => 
          array (
            'id' => '1900',
            'name' => '长葛市',
          ),
        ),
      ),
      198 => 
      array (
        'id' => '198',
        'name' => '漯河市',
        'child' => 
        array (
          1901 => 
          array (
            'id' => '1901',
            'name' => '源汇区',
          ),
          1902 => 
          array (
            'id' => '1902',
            'name' => '郾城区',
          ),
          1903 => 
          array (
            'id' => '1903',
            'name' => '召陵区',
          ),
          1904 => 
          array (
            'id' => '1904',
            'name' => '舞阳县',
          ),
          1905 => 
          array (
            'id' => '1905',
            'name' => '临颍县',
          ),
        ),
      ),
      199 => 
      array (
        'id' => '199',
        'name' => '三门峡市',
        'child' => 
        array (
          1906 => 
          array (
            'id' => '1906',
            'name' => '湖滨区',
          ),
          1907 => 
          array (
            'id' => '1907',
            'name' => '渑池县',
          ),
          1908 => 
          array (
            'id' => '1908',
            'name' => '陕县',
          ),
          1909 => 
          array (
            'id' => '1909',
            'name' => '卢氏县',
          ),
          1910 => 
          array (
            'id' => '1910',
            'name' => '义马市',
          ),
          1911 => 
          array (
            'id' => '1911',
            'name' => '灵宝市',
          ),
        ),
      ),
      200 => 
      array (
        'id' => '200',
        'name' => '南阳市',
        'child' => 
        array (
          1912 => 
          array (
            'id' => '1912',
            'name' => '宛城区',
          ),
          1913 => 
          array (
            'id' => '1913',
            'name' => '卧龙区',
          ),
          1914 => 
          array (
            'id' => '1914',
            'name' => '南召县',
          ),
          1915 => 
          array (
            'id' => '1915',
            'name' => '方城县',
          ),
          1916 => 
          array (
            'id' => '1916',
            'name' => '西峡县',
          ),
          1917 => 
          array (
            'id' => '1917',
            'name' => '镇平县',
          ),
          1918 => 
          array (
            'id' => '1918',
            'name' => '内乡县',
          ),
          1919 => 
          array (
            'id' => '1919',
            'name' => '淅川县',
          ),
          1920 => 
          array (
            'id' => '1920',
            'name' => '社旗县',
          ),
          1921 => 
          array (
            'id' => '1921',
            'name' => '唐河县',
          ),
          1922 => 
          array (
            'id' => '1922',
            'name' => '新野县',
          ),
          1923 => 
          array (
            'id' => '1923',
            'name' => '桐柏县',
          ),
          1924 => 
          array (
            'id' => '1924',
            'name' => '邓州市',
          ),
        ),
      ),
      201 => 
      array (
        'id' => '201',
        'name' => '商丘市',
        'child' => 
        array (
          1925 => 
          array (
            'id' => '1925',
            'name' => '梁园区',
          ),
          1926 => 
          array (
            'id' => '1926',
            'name' => '睢阳区',
          ),
          1927 => 
          array (
            'id' => '1927',
            'name' => '民权县',
          ),
          1928 => 
          array (
            'id' => '1928',
            'name' => '睢县',
          ),
          1929 => 
          array (
            'id' => '1929',
            'name' => '宁陵县',
          ),
          1930 => 
          array (
            'id' => '1930',
            'name' => '柘城县',
          ),
          1931 => 
          array (
            'id' => '1931',
            'name' => '虞城县',
          ),
          1932 => 
          array (
            'id' => '1932',
            'name' => '夏邑县',
          ),
          1933 => 
          array (
            'id' => '1933',
            'name' => '永城市',
          ),
        ),
      ),
      202 => 
      array (
        'id' => '202',
        'name' => '信阳市',
        'child' => 
        array (
          1934 => 
          array (
            'id' => '1934',
            'name' => '浉河区',
          ),
          1935 => 
          array (
            'id' => '1935',
            'name' => '平桥区',
          ),
          1936 => 
          array (
            'id' => '1936',
            'name' => '罗山县',
          ),
          1937 => 
          array (
            'id' => '1937',
            'name' => '光山县',
          ),
          1938 => 
          array (
            'id' => '1938',
            'name' => '新县',
          ),
          1939 => 
          array (
            'id' => '1939',
            'name' => '商城县',
          ),
          1940 => 
          array (
            'id' => '1940',
            'name' => '固始县',
          ),
          1941 => 
          array (
            'id' => '1941',
            'name' => '潢川县',
          ),
          1942 => 
          array (
            'id' => '1942',
            'name' => '淮滨县',
          ),
          1943 => 
          array (
            'id' => '1943',
            'name' => '息县',
          ),
        ),
      ),
      203 => 
      array (
        'id' => '203',
        'name' => '周口市',
        'child' => 
        array (
          1944 => 
          array (
            'id' => '1944',
            'name' => '川汇区',
          ),
          1945 => 
          array (
            'id' => '1945',
            'name' => '扶沟县',
          ),
          1946 => 
          array (
            'id' => '1946',
            'name' => '西华县',
          ),
          1947 => 
          array (
            'id' => '1947',
            'name' => '商水县',
          ),
          1948 => 
          array (
            'id' => '1948',
            'name' => '沈丘县',
          ),
          1949 => 
          array (
            'id' => '1949',
            'name' => '郸城县',
          ),
          1950 => 
          array (
            'id' => '1950',
            'name' => '淮阳县',
          ),
          1951 => 
          array (
            'id' => '1951',
            'name' => '太康县',
          ),
          1952 => 
          array (
            'id' => '1952',
            'name' => '鹿邑县',
          ),
          1953 => 
          array (
            'id' => '1953',
            'name' => '项城市',
          ),
        ),
      ),
      204 => 
      array (
        'id' => '204',
        'name' => '驻马店市',
        'child' => 
        array (
          1954 => 
          array (
            'id' => '1954',
            'name' => '驿城区',
          ),
          1955 => 
          array (
            'id' => '1955',
            'name' => '西平县',
          ),
          1956 => 
          array (
            'id' => '1956',
            'name' => '上蔡县',
          ),
          1957 => 
          array (
            'id' => '1957',
            'name' => '平舆县',
          ),
          1958 => 
          array (
            'id' => '1958',
            'name' => '正阳县',
          ),
          1959 => 
          array (
            'id' => '1959',
            'name' => '确山县',
          ),
          1960 => 
          array (
            'id' => '1960',
            'name' => '泌阳县',
          ),
          1961 => 
          array (
            'id' => '1961',
            'name' => '汝南县',
          ),
          1962 => 
          array (
            'id' => '1962',
            'name' => '遂平县',
          ),
          1963 => 
          array (
            'id' => '1963',
            'name' => '新蔡县',
          ),
        ),
      ),
    ),
  ),
  18 => 
  array (
    'id' => '18',
    'name' => '湖北省',
    'child' => 
    array (
      205 => 
      array (
        'id' => '205',
        'name' => '武汉市',
        'child' => 
        array (
          1964 => 
          array (
            'id' => '1964',
            'name' => '江岸区',
          ),
          1965 => 
          array (
            'id' => '1965',
            'name' => '江汉区',
          ),
          1966 => 
          array (
            'id' => '1966',
            'name' => '硚口区',
          ),
          1967 => 
          array (
            'id' => '1967',
            'name' => '汉阳区',
          ),
          1968 => 
          array (
            'id' => '1968',
            'name' => '武昌区',
          ),
          1969 => 
          array (
            'id' => '1969',
            'name' => '青山区',
          ),
          1970 => 
          array (
            'id' => '1970',
            'name' => '洪山区',
          ),
          1971 => 
          array (
            'id' => '1971',
            'name' => '东西湖区',
          ),
          1972 => 
          array (
            'id' => '1972',
            'name' => '汉南区',
          ),
          1973 => 
          array (
            'id' => '1973',
            'name' => '蔡甸区',
          ),
          1974 => 
          array (
            'id' => '1974',
            'name' => '江夏区',
          ),
          1975 => 
          array (
            'id' => '1975',
            'name' => '黄陂区',
          ),
          1976 => 
          array (
            'id' => '1976',
            'name' => '新洲区',
          ),
        ),
      ),
      206 => 
      array (
        'id' => '206',
        'name' => '黄石市',
        'child' => 
        array (
          1977 => 
          array (
            'id' => '1977',
            'name' => '黄石港区',
          ),
          1978 => 
          array (
            'id' => '1978',
            'name' => '西塞山区',
          ),
          1979 => 
          array (
            'id' => '1979',
            'name' => '下陆区',
          ),
          1980 => 
          array (
            'id' => '1980',
            'name' => '铁山区',
          ),
          1981 => 
          array (
            'id' => '1981',
            'name' => '阳新县',
          ),
          1982 => 
          array (
            'id' => '1982',
            'name' => '大冶市',
          ),
        ),
      ),
      207 => 
      array (
        'id' => '207',
        'name' => '十堰市',
        'child' => 
        array (
          1983 => 
          array (
            'id' => '1983',
            'name' => '茅箭区',
          ),
          1984 => 
          array (
            'id' => '1984',
            'name' => '张湾区',
          ),
          1985 => 
          array (
            'id' => '1985',
            'name' => '郧县',
          ),
          1986 => 
          array (
            'id' => '1986',
            'name' => '郧西县',
          ),
          1987 => 
          array (
            'id' => '1987',
            'name' => '竹山县',
          ),
          1988 => 
          array (
            'id' => '1988',
            'name' => '竹溪县',
          ),
          1989 => 
          array (
            'id' => '1989',
            'name' => '房县',
          ),
          1990 => 
          array (
            'id' => '1990',
            'name' => '丹江口市',
          ),
        ),
      ),
      208 => 
      array (
        'id' => '208',
        'name' => '宜昌市',
        'child' => 
        array (
          1991 => 
          array (
            'id' => '1991',
            'name' => '西陵区',
          ),
          1992 => 
          array (
            'id' => '1992',
            'name' => '伍家岗区',
          ),
          1993 => 
          array (
            'id' => '1993',
            'name' => '点军区',
          ),
          1994 => 
          array (
            'id' => '1994',
            'name' => '猇亭区',
          ),
          1995 => 
          array (
            'id' => '1995',
            'name' => '夷陵区',
          ),
          1996 => 
          array (
            'id' => '1996',
            'name' => '远安县',
          ),
          1997 => 
          array (
            'id' => '1997',
            'name' => '兴山县',
          ),
          1998 => 
          array (
            'id' => '1998',
            'name' => '秭归县',
          ),
          1999 => 
          array (
            'id' => '1999',
            'name' => '长阳土家族自治县',
          ),
          2000 => 
          array (
            'id' => '2000',
            'name' => '五峰土家族自治县',
          ),
          2001 => 
          array (
            'id' => '2001',
            'name' => '宜都市',
          ),
          2002 => 
          array (
            'id' => '2002',
            'name' => '当阳市',
          ),
          2003 => 
          array (
            'id' => '2003',
            'name' => '枝江市',
          ),
          2004 => 
          array (
            'id' => '2004',
            'name' => '经济技术开发区',
          ),
        ),
      ),
      209 => 
      array (
        'id' => '209',
        'name' => '襄阳市',
        'child' => 
        array (
          2005 => 
          array (
            'id' => '2005',
            'name' => '襄城区',
          ),
          2006 => 
          array (
            'id' => '2006',
            'name' => '樊城区',
          ),
          2007 => 
          array (
            'id' => '2007',
            'name' => '襄阳区',
          ),
          2008 => 
          array (
            'id' => '2008',
            'name' => '南漳县',
          ),
          2009 => 
          array (
            'id' => '2009',
            'name' => '谷城县',
          ),
          2010 => 
          array (
            'id' => '2010',
            'name' => '保康县',
          ),
          2011 => 
          array (
            'id' => '2011',
            'name' => '老河口市',
          ),
          2012 => 
          array (
            'id' => '2012',
            'name' => '枣阳市',
          ),
          2013 => 
          array (
            'id' => '2013',
            'name' => '宜城市',
          ),
        ),
      ),
      210 => 
      array (
        'id' => '210',
        'name' => '鄂州市',
        'child' => 
        array (
          2014 => 
          array (
            'id' => '2014',
            'name' => '梁子湖区',
          ),
          2015 => 
          array (
            'id' => '2015',
            'name' => '华容区',
          ),
          2016 => 
          array (
            'id' => '2016',
            'name' => '鄂城区',
          ),
        ),
      ),
      211 => 
      array (
        'id' => '211',
        'name' => '荆门市',
        'child' => 
        array (
          2017 => 
          array (
            'id' => '2017',
            'name' => '东宝区',
          ),
          2018 => 
          array (
            'id' => '2018',
            'name' => '掇刀区',
          ),
          2019 => 
          array (
            'id' => '2019',
            'name' => '京山县',
          ),
          2020 => 
          array (
            'id' => '2020',
            'name' => '沙洋县',
          ),
          2021 => 
          array (
            'id' => '2021',
            'name' => '钟祥市',
          ),
        ),
      ),
      212 => 
      array (
        'id' => '212',
        'name' => '孝感市',
        'child' => 
        array (
          2022 => 
          array (
            'id' => '2022',
            'name' => '孝南区',
          ),
          2023 => 
          array (
            'id' => '2023',
            'name' => '孝昌县',
          ),
          2024 => 
          array (
            'id' => '2024',
            'name' => '大悟县',
          ),
          2025 => 
          array (
            'id' => '2025',
            'name' => '云梦县',
          ),
          2026 => 
          array (
            'id' => '2026',
            'name' => '应城市',
          ),
          2027 => 
          array (
            'id' => '2027',
            'name' => '安陆市',
          ),
          2028 => 
          array (
            'id' => '2028',
            'name' => '汉川市',
          ),
        ),
      ),
      213 => 
      array (
        'id' => '213',
        'name' => '荆州市',
        'child' => 
        array (
          2029 => 
          array (
            'id' => '2029',
            'name' => '沙市区',
          ),
          2030 => 
          array (
            'id' => '2030',
            'name' => '荆州区',
          ),
          2031 => 
          array (
            'id' => '2031',
            'name' => '公安县',
          ),
          2032 => 
          array (
            'id' => '2032',
            'name' => '监利县',
          ),
          2033 => 
          array (
            'id' => '2033',
            'name' => '江陵县',
          ),
          2034 => 
          array (
            'id' => '2034',
            'name' => '石首市',
          ),
          2035 => 
          array (
            'id' => '2035',
            'name' => '洪湖市',
          ),
          2036 => 
          array (
            'id' => '2036',
            'name' => '松滋市',
          ),
        ),
      ),
      214 => 
      array (
        'id' => '214',
        'name' => '黄冈市',
        'child' => 
        array (
          2037 => 
          array (
            'id' => '2037',
            'name' => '黄州区',
          ),
          2038 => 
          array (
            'id' => '2038',
            'name' => '团风县',
          ),
          2039 => 
          array (
            'id' => '2039',
            'name' => '红安县',
          ),
          2040 => 
          array (
            'id' => '2040',
            'name' => '罗田县',
          ),
          2041 => 
          array (
            'id' => '2041',
            'name' => '英山县',
          ),
          2042 => 
          array (
            'id' => '2042',
            'name' => '浠水县',
          ),
          2043 => 
          array (
            'id' => '2043',
            'name' => '蕲春县',
          ),
          2044 => 
          array (
            'id' => '2044',
            'name' => '黄梅县',
          ),
          2045 => 
          array (
            'id' => '2045',
            'name' => '麻城市',
          ),
          2046 => 
          array (
            'id' => '2046',
            'name' => '武穴市',
          ),
        ),
      ),
      215 => 
      array (
        'id' => '215',
        'name' => '咸宁市',
        'child' => 
        array (
          2047 => 
          array (
            'id' => '2047',
            'name' => '咸安区',
          ),
          2048 => 
          array (
            'id' => '2048',
            'name' => '嘉鱼县',
          ),
          2049 => 
          array (
            'id' => '2049',
            'name' => '通城县',
          ),
          2050 => 
          array (
            'id' => '2050',
            'name' => '崇阳县',
          ),
          2051 => 
          array (
            'id' => '2051',
            'name' => '通山县',
          ),
          2052 => 
          array (
            'id' => '2052',
            'name' => '赤壁市',
          ),
        ),
      ),
      216 => 
      array (
        'id' => '216',
        'name' => '随州市',
        'child' => 
        array (
          2053 => 
          array (
            'id' => '2053',
            'name' => '曾都区',
          ),
          2054 => 
          array (
            'id' => '2054',
            'name' => '广水市',
          ),
        ),
      ),
      217 => 
      array (
        'id' => '217',
        'name' => '恩施土家族苗族自治州',
        'child' => 
        array (
          2055 => 
          array (
            'id' => '2055',
            'name' => '恩施市',
          ),
          2056 => 
          array (
            'id' => '2056',
            'name' => '利川市',
          ),
          2057 => 
          array (
            'id' => '2057',
            'name' => '建始县',
          ),
          2058 => 
          array (
            'id' => '2058',
            'name' => '巴东县',
          ),
          2059 => 
          array (
            'id' => '2059',
            'name' => '宣恩县',
          ),
          2060 => 
          array (
            'id' => '2060',
            'name' => '咸丰县',
          ),
          2061 => 
          array (
            'id' => '2061',
            'name' => '来凤县',
          ),
          2062 => 
          array (
            'id' => '2062',
            'name' => '鹤峰县',
          ),
        ),
      ),
      218 => 
      array (
        'id' => '218',
        'name' => '省直辖县级行政单位',
        'child' => 
        array (
          2063 => 
          array (
            'id' => '2063',
            'name' => '仙桃市',
          ),
          2064 => 
          array (
            'id' => '2064',
            'name' => '潜江市',
          ),
          2065 => 
          array (
            'id' => '2065',
            'name' => '天门市',
          ),
          2066 => 
          array (
            'id' => '2066',
            'name' => '神农架林区',
          ),
        ),
      ),
    ),
  ),
  19 => 
  array (
    'id' => '19',
    'name' => '湖南省',
    'child' => 
    array (
      219 => 
      array (
        'id' => '219',
        'name' => '长沙市',
        'child' => 
        array (
          2067 => 
          array (
            'id' => '2067',
            'name' => '芙蓉区',
          ),
          2068 => 
          array (
            'id' => '2068',
            'name' => '天心区',
          ),
          2069 => 
          array (
            'id' => '2069',
            'name' => '岳麓区',
          ),
          2070 => 
          array (
            'id' => '2070',
            'name' => '开福区',
          ),
          2071 => 
          array (
            'id' => '2071',
            'name' => '雨花区',
          ),
          2072 => 
          array (
            'id' => '2072',
            'name' => '长沙县',
          ),
          2073 => 
          array (
            'id' => '2073',
            'name' => '望城县',
          ),
          2074 => 
          array (
            'id' => '2074',
            'name' => '宁乡县',
          ),
          2075 => 
          array (
            'id' => '2075',
            'name' => '浏阳市',
          ),
        ),
      ),
      220 => 
      array (
        'id' => '220',
        'name' => '株洲市',
        'child' => 
        array (
          2076 => 
          array (
            'id' => '2076',
            'name' => '荷塘区',
          ),
          2077 => 
          array (
            'id' => '2077',
            'name' => '芦淞区',
          ),
          2078 => 
          array (
            'id' => '2078',
            'name' => '石峰区',
          ),
          2079 => 
          array (
            'id' => '2079',
            'name' => '天元区',
          ),
          2080 => 
          array (
            'id' => '2080',
            'name' => '株洲县',
          ),
          2081 => 
          array (
            'id' => '2081',
            'name' => '攸县',
          ),
          2082 => 
          array (
            'id' => '2082',
            'name' => '茶陵县',
          ),
          2083 => 
          array (
            'id' => '2083',
            'name' => '炎陵县',
          ),
          2084 => 
          array (
            'id' => '2084',
            'name' => '醴陵市',
          ),
        ),
      ),
      221 => 
      array (
        'id' => '221',
        'name' => '湘潭市',
        'child' => 
        array (
          2085 => 
          array (
            'id' => '2085',
            'name' => '雨湖区',
          ),
          2086 => 
          array (
            'id' => '2086',
            'name' => '岳塘区',
          ),
          2087 => 
          array (
            'id' => '2087',
            'name' => '湘潭县',
          ),
          2088 => 
          array (
            'id' => '2088',
            'name' => '湘乡市',
          ),
          2089 => 
          array (
            'id' => '2089',
            'name' => '韶山市',
          ),
        ),
      ),
      222 => 
      array (
        'id' => '222',
        'name' => '衡阳市',
        'child' => 
        array (
          2090 => 
          array (
            'id' => '2090',
            'name' => '珠晖区',
          ),
          2091 => 
          array (
            'id' => '2091',
            'name' => '雁峰区',
          ),
          2092 => 
          array (
            'id' => '2092',
            'name' => '石鼓区',
          ),
          2093 => 
          array (
            'id' => '2093',
            'name' => '蒸湘区',
          ),
          2094 => 
          array (
            'id' => '2094',
            'name' => '南岳区',
          ),
          2095 => 
          array (
            'id' => '2095',
            'name' => '衡阳县',
          ),
          2096 => 
          array (
            'id' => '2096',
            'name' => '衡南县',
          ),
          2097 => 
          array (
            'id' => '2097',
            'name' => '衡山县',
          ),
          2098 => 
          array (
            'id' => '2098',
            'name' => '衡东县',
          ),
          2099 => 
          array (
            'id' => '2099',
            'name' => '祁东县',
          ),
          2100 => 
          array (
            'id' => '2100',
            'name' => '耒阳市',
          ),
          2101 => 
          array (
            'id' => '2101',
            'name' => '常宁市',
          ),
        ),
      ),
      223 => 
      array (
        'id' => '223',
        'name' => '邵阳市',
        'child' => 
        array (
          2102 => 
          array (
            'id' => '2102',
            'name' => '双清区',
          ),
          2103 => 
          array (
            'id' => '2103',
            'name' => '大祥区',
          ),
          2104 => 
          array (
            'id' => '2104',
            'name' => '北塔区',
          ),
          2105 => 
          array (
            'id' => '2105',
            'name' => '邵东县',
          ),
          2106 => 
          array (
            'id' => '2106',
            'name' => '新邵县',
          ),
          2107 => 
          array (
            'id' => '2107',
            'name' => '邵阳县',
          ),
          2108 => 
          array (
            'id' => '2108',
            'name' => '隆回县',
          ),
          2109 => 
          array (
            'id' => '2109',
            'name' => '洞口县',
          ),
          2110 => 
          array (
            'id' => '2110',
            'name' => '绥宁县',
          ),
          2111 => 
          array (
            'id' => '2111',
            'name' => '新宁县',
          ),
          2112 => 
          array (
            'id' => '2112',
            'name' => '城步苗族自治县',
          ),
          2113 => 
          array (
            'id' => '2113',
            'name' => '武冈市',
          ),
        ),
      ),
      224 => 
      array (
        'id' => '224',
        'name' => '岳阳市',
        'child' => 
        array (
          2114 => 
          array (
            'id' => '2114',
            'name' => '岳阳楼区',
          ),
          2115 => 
          array (
            'id' => '2115',
            'name' => '云溪区',
          ),
          2116 => 
          array (
            'id' => '2116',
            'name' => '君山区',
          ),
          2117 => 
          array (
            'id' => '2117',
            'name' => '岳阳县',
          ),
          2118 => 
          array (
            'id' => '2118',
            'name' => '华容县',
          ),
          2119 => 
          array (
            'id' => '2119',
            'name' => '湘阴县',
          ),
          2120 => 
          array (
            'id' => '2120',
            'name' => '平江县',
          ),
          2121 => 
          array (
            'id' => '2121',
            'name' => '汨罗市',
          ),
          2122 => 
          array (
            'id' => '2122',
            'name' => '临湘市',
          ),
        ),
      ),
      225 => 
      array (
        'id' => '225',
        'name' => '常德市',
        'child' => 
        array (
          2123 => 
          array (
            'id' => '2123',
            'name' => '武陵区',
          ),
          2124 => 
          array (
            'id' => '2124',
            'name' => '鼎城区',
          ),
          2125 => 
          array (
            'id' => '2125',
            'name' => '安乡县',
          ),
          2126 => 
          array (
            'id' => '2126',
            'name' => '汉寿县',
          ),
          2127 => 
          array (
            'id' => '2127',
            'name' => '澧县',
          ),
          2128 => 
          array (
            'id' => '2128',
            'name' => '临澧县',
          ),
          2129 => 
          array (
            'id' => '2129',
            'name' => '桃源县',
          ),
          2130 => 
          array (
            'id' => '2130',
            'name' => '石门县',
          ),
          2131 => 
          array (
            'id' => '2131',
            'name' => '津市市',
          ),
        ),
      ),
      226 => 
      array (
        'id' => '226',
        'name' => '张家界市',
        'child' => 
        array (
          2132 => 
          array (
            'id' => '2132',
            'name' => '永定区',
          ),
          2133 => 
          array (
            'id' => '2133',
            'name' => '武陵源区',
          ),
          2134 => 
          array (
            'id' => '2134',
            'name' => '慈利县',
          ),
          2135 => 
          array (
            'id' => '2135',
            'name' => '桑植县',
          ),
        ),
      ),
      227 => 
      array (
        'id' => '227',
        'name' => '益阳市',
        'child' => 
        array (
          2136 => 
          array (
            'id' => '2136',
            'name' => '资阳区',
          ),
          2137 => 
          array (
            'id' => '2137',
            'name' => '赫山区',
          ),
          2138 => 
          array (
            'id' => '2138',
            'name' => '南县',
          ),
          2139 => 
          array (
            'id' => '2139',
            'name' => '桃江县',
          ),
          2140 => 
          array (
            'id' => '2140',
            'name' => '安化县',
          ),
          2141 => 
          array (
            'id' => '2141',
            'name' => '沅江市',
          ),
        ),
      ),
      228 => 
      array (
        'id' => '228',
        'name' => '郴州市',
        'child' => 
        array (
          2142 => 
          array (
            'id' => '2142',
            'name' => '北湖区',
          ),
          2143 => 
          array (
            'id' => '2143',
            'name' => '苏仙区',
          ),
          2144 => 
          array (
            'id' => '2144',
            'name' => '桂阳县',
          ),
          2145 => 
          array (
            'id' => '2145',
            'name' => '宜章县',
          ),
          2146 => 
          array (
            'id' => '2146',
            'name' => '永兴县',
          ),
          2147 => 
          array (
            'id' => '2147',
            'name' => '嘉禾县',
          ),
          2148 => 
          array (
            'id' => '2148',
            'name' => '临武县',
          ),
          2149 => 
          array (
            'id' => '2149',
            'name' => '汝城县',
          ),
          2150 => 
          array (
            'id' => '2150',
            'name' => '桂东县',
          ),
          2151 => 
          array (
            'id' => '2151',
            'name' => '安仁县',
          ),
          2152 => 
          array (
            'id' => '2152',
            'name' => '资兴市',
          ),
        ),
      ),
      229 => 
      array (
        'id' => '229',
        'name' => '永州市',
        'child' => 
        array (
          2153 => 
          array (
            'id' => '2153',
            'name' => '冷水滩区',
          ),
          2154 => 
          array (
            'id' => '2154',
            'name' => '祁阳县',
          ),
          2155 => 
          array (
            'id' => '2155',
            'name' => '东安县',
          ),
          2156 => 
          array (
            'id' => '2156',
            'name' => '双牌县',
          ),
          2157 => 
          array (
            'id' => '2157',
            'name' => '道县',
          ),
          2158 => 
          array (
            'id' => '2158',
            'name' => '江永县',
          ),
          2159 => 
          array (
            'id' => '2159',
            'name' => '宁远县',
          ),
          2160 => 
          array (
            'id' => '2160',
            'name' => '蓝山县',
          ),
          2161 => 
          array (
            'id' => '2161',
            'name' => '新田县',
          ),
          2162 => 
          array (
            'id' => '2162',
            'name' => '江华瑶族自治县',
          ),
          2163 => 
          array (
            'id' => '2163',
            'name' => '零陵区',
          ),
        ),
      ),
      230 => 
      array (
        'id' => '230',
        'name' => '怀化市',
        'child' => 
        array (
          2164 => 
          array (
            'id' => '2164',
            'name' => '鹤城区',
          ),
          2165 => 
          array (
            'id' => '2165',
            'name' => '中方县',
          ),
          2166 => 
          array (
            'id' => '2166',
            'name' => '沅陵县',
          ),
          2167 => 
          array (
            'id' => '2167',
            'name' => '辰溪县',
          ),
          2168 => 
          array (
            'id' => '2168',
            'name' => '溆浦县',
          ),
          2169 => 
          array (
            'id' => '2169',
            'name' => '会同县',
          ),
          2170 => 
          array (
            'id' => '2170',
            'name' => '麻阳苗族自治县',
          ),
          2171 => 
          array (
            'id' => '2171',
            'name' => '新晃侗族自治县',
          ),
          2172 => 
          array (
            'id' => '2172',
            'name' => '芷江侗族自治县',
          ),
          2173 => 
          array (
            'id' => '2173',
            'name' => '靖州苗族侗族自治县',
          ),
          2174 => 
          array (
            'id' => '2174',
            'name' => '通道侗族自治县',
          ),
          2175 => 
          array (
            'id' => '2175',
            'name' => '洪江市',
          ),
        ),
      ),
      231 => 
      array (
        'id' => '231',
        'name' => '娄底市',
        'child' => 
        array (
          2176 => 
          array (
            'id' => '2176',
            'name' => '娄星区',
          ),
          2177 => 
          array (
            'id' => '2177',
            'name' => '双峰县',
          ),
          2178 => 
          array (
            'id' => '2178',
            'name' => '新化县',
          ),
          2179 => 
          array (
            'id' => '2179',
            'name' => '冷水江市',
          ),
          2180 => 
          array (
            'id' => '2180',
            'name' => '涟源市',
          ),
        ),
      ),
      232 => 
      array (
        'id' => '232',
        'name' => '湘西土家族苗族自治州',
        'child' => 
        array (
          2181 => 
          array (
            'id' => '2181',
            'name' => '吉首市',
          ),
          2182 => 
          array (
            'id' => '2182',
            'name' => '泸溪县',
          ),
          2183 => 
          array (
            'id' => '2183',
            'name' => '凤凰县',
          ),
          2184 => 
          array (
            'id' => '2184',
            'name' => '花垣县',
          ),
          2185 => 
          array (
            'id' => '2185',
            'name' => '保靖县',
          ),
          2186 => 
          array (
            'id' => '2186',
            'name' => '古丈县',
          ),
          2187 => 
          array (
            'id' => '2187',
            'name' => '永顺县',
          ),
          2188 => 
          array (
            'id' => '2188',
            'name' => '龙山县',
          ),
        ),
      ),
    ),
  ),
  20 => 
  array (
    'id' => '20',
    'name' => '广东省',
    'child' => 
    array (
      233 => 
      array (
        'id' => '233',
        'name' => '广州市',
        'child' => 
        array (
          2189 => 
          array (
            'id' => '2189',
            'name' => '荔湾区',
          ),
          2190 => 
          array (
            'id' => '2190',
            'name' => '越秀区',
          ),
          2191 => 
          array (
            'id' => '2191',
            'name' => '海珠区',
          ),
          2192 => 
          array (
            'id' => '2192',
            'name' => '天河区',
          ),
          2193 => 
          array (
            'id' => '2193',
            'name' => '白云区',
          ),
          2194 => 
          array (
            'id' => '2194',
            'name' => '黄埔区',
          ),
          2195 => 
          array (
            'id' => '2195',
            'name' => '番禺区',
          ),
          2196 => 
          array (
            'id' => '2196',
            'name' => '花都区',
          ),
          2197 => 
          array (
            'id' => '2197',
            'name' => '增城市',
          ),
          2198 => 
          array (
            'id' => '2198',
            'name' => '从化市',
          ),
          2199 => 
          array (
            'id' => '2199',
            'name' => '南沙区',
          ),
          2200 => 
          array (
            'id' => '2200',
            'name' => '萝岗区',
          ),
        ),
      ),
      234 => 
      array (
        'id' => '234',
        'name' => '韶关市',
        'child' => 
        array (
          2201 => 
          array (
            'id' => '2201',
            'name' => '武江区',
          ),
          2202 => 
          array (
            'id' => '2202',
            'name' => '浈江区',
          ),
          2203 => 
          array (
            'id' => '2203',
            'name' => '曲江区',
          ),
          2204 => 
          array (
            'id' => '2204',
            'name' => '始兴县',
          ),
          2205 => 
          array (
            'id' => '2205',
            'name' => '仁化县',
          ),
          2206 => 
          array (
            'id' => '2206',
            'name' => '翁源县',
          ),
          2207 => 
          array (
            'id' => '2207',
            'name' => '乳源瑶族自治县',
          ),
          2208 => 
          array (
            'id' => '2208',
            'name' => '新丰县',
          ),
          2209 => 
          array (
            'id' => '2209',
            'name' => '乐昌市',
          ),
          2210 => 
          array (
            'id' => '2210',
            'name' => '南雄市',
          ),
        ),
      ),
      235 => 
      array (
        'id' => '235',
        'name' => '深圳市',
        'child' => 
        array (
          2211 => 
          array (
            'id' => '2211',
            'name' => '罗湖区',
          ),
          2212 => 
          array (
            'id' => '2212',
            'name' => '福田区',
          ),
          2213 => 
          array (
            'id' => '2213',
            'name' => '南山区',
          ),
          2214 => 
          array (
            'id' => '2214',
            'name' => '宝安区',
          ),
          2215 => 
          array (
            'id' => '2215',
            'name' => '龙岗区',
          ),
          2216 => 
          array (
            'id' => '2216',
            'name' => '盐田区',
          ),
          2217 => 
          array (
            'id' => '2217',
            'name' => '光明新区',
          ),
          2218 => 
          array (
            'id' => '2218',
            'name' => '坪山新区',
          ),
        ),
      ),
      236 => 
      array (
        'id' => '236',
        'name' => '珠海市',
        'child' => 
        array (
          2219 => 
          array (
            'id' => '2219',
            'name' => '香洲区',
          ),
          2220 => 
          array (
            'id' => '2220',
            'name' => '斗门区',
          ),
          2221 => 
          array (
            'id' => '2221',
            'name' => '金湾区',
          ),
        ),
      ),
      237 => 
      array (
        'id' => '237',
        'name' => '汕头市',
        'child' => 
        array (
          2222 => 
          array (
            'id' => '2222',
            'name' => '龙湖区',
          ),
          2223 => 
          array (
            'id' => '2223',
            'name' => '金平区',
          ),
          2224 => 
          array (
            'id' => '2224',
            'name' => '濠江区',
          ),
          2225 => 
          array (
            'id' => '2225',
            'name' => '潮阳区',
          ),
          2226 => 
          array (
            'id' => '2226',
            'name' => '潮南区',
          ),
          2227 => 
          array (
            'id' => '2227',
            'name' => '澄海区',
          ),
          2228 => 
          array (
            'id' => '2228',
            'name' => '南澳县',
          ),
        ),
      ),
      238 => 
      array (
        'id' => '238',
        'name' => '佛山市',
        'child' => 
        array (
          2229 => 
          array (
            'id' => '2229',
            'name' => '禅城区',
          ),
          2230 => 
          array (
            'id' => '2230',
            'name' => '南海区',
          ),
          2231 => 
          array (
            'id' => '2231',
            'name' => '顺德区',
          ),
          2232 => 
          array (
            'id' => '2232',
            'name' => '三水区',
          ),
          2233 => 
          array (
            'id' => '2233',
            'name' => '高明区',
          ),
        ),
      ),
      239 => 
      array (
        'id' => '239',
        'name' => '江门市',
        'child' => 
        array (
          2234 => 
          array (
            'id' => '2234',
            'name' => '蓬江区',
          ),
          2235 => 
          array (
            'id' => '2235',
            'name' => '江海区',
          ),
          2236 => 
          array (
            'id' => '2236',
            'name' => '新会区',
          ),
          2237 => 
          array (
            'id' => '2237',
            'name' => '台山市',
          ),
          2238 => 
          array (
            'id' => '2238',
            'name' => '开平市',
          ),
          2239 => 
          array (
            'id' => '2239',
            'name' => '鹤山市',
          ),
          2240 => 
          array (
            'id' => '2240',
            'name' => '恩平市',
          ),
        ),
      ),
      240 => 
      array (
        'id' => '240',
        'name' => '湛江市',
        'child' => 
        array (
          2241 => 
          array (
            'id' => '2241',
            'name' => '赤坎区',
          ),
          2242 => 
          array (
            'id' => '2242',
            'name' => '霞山区',
          ),
          2243 => 
          array (
            'id' => '2243',
            'name' => '坡头区',
          ),
          2244 => 
          array (
            'id' => '2244',
            'name' => '麻章区',
          ),
          2245 => 
          array (
            'id' => '2245',
            'name' => '遂溪县',
          ),
          2246 => 
          array (
            'id' => '2246',
            'name' => '徐闻县',
          ),
          2247 => 
          array (
            'id' => '2247',
            'name' => '廉江市',
          ),
          2248 => 
          array (
            'id' => '2248',
            'name' => '雷州市',
          ),
          2249 => 
          array (
            'id' => '2249',
            'name' => '吴川市',
          ),
          2250 => 
          array (
            'id' => '2250',
            'name' => '开发区',
          ),
        ),
      ),
      241 => 
      array (
        'id' => '241',
        'name' => '茂名市',
        'child' => 
        array (
          2251 => 
          array (
            'id' => '2251',
            'name' => '茂南区',
          ),
          2252 => 
          array (
            'id' => '2252',
            'name' => '茂港区',
          ),
          2253 => 
          array (
            'id' => '2253',
            'name' => '电白县',
          ),
          2254 => 
          array (
            'id' => '2254',
            'name' => '高州市',
          ),
          2255 => 
          array (
            'id' => '2255',
            'name' => '化州市',
          ),
          2256 => 
          array (
            'id' => '2256',
            'name' => '信宜市',
          ),
        ),
      ),
      242 => 
      array (
        'id' => '242',
        'name' => '肇庆市',
        'child' => 
        array (
          2257 => 
          array (
            'id' => '2257',
            'name' => '端州区',
          ),
          2258 => 
          array (
            'id' => '2258',
            'name' => '鼎湖区',
          ),
          2259 => 
          array (
            'id' => '2259',
            'name' => '广宁县',
          ),
          2260 => 
          array (
            'id' => '2260',
            'name' => '怀集县',
          ),
          2261 => 
          array (
            'id' => '2261',
            'name' => '封开县',
          ),
          2262 => 
          array (
            'id' => '2262',
            'name' => '德庆县',
          ),
          2263 => 
          array (
            'id' => '2263',
            'name' => '高要市',
          ),
          2264 => 
          array (
            'id' => '2264',
            'name' => '四会市',
          ),
          2265 => 
          array (
            'id' => '2265',
            'name' => '高新技术产业开发区',
          ),
        ),
      ),
      243 => 
      array (
        'id' => '243',
        'name' => '惠州市',
        'child' => 
        array (
          2266 => 
          array (
            'id' => '2266',
            'name' => '惠城区',
          ),
          2267 => 
          array (
            'id' => '2267',
            'name' => '惠阳区',
          ),
          2268 => 
          array (
            'id' => '2268',
            'name' => '博罗县',
          ),
          2269 => 
          array (
            'id' => '2269',
            'name' => '惠东县',
          ),
          2270 => 
          array (
            'id' => '2270',
            'name' => '龙门县',
          ),
          2271 => 
          array (
            'id' => '2271',
            'name' => '大亚湾区',
          ),
          2272 => 
          array (
            'id' => '2272',
            'name' => '仲恺高新区',
          ),
        ),
      ),
      244 => 
      array (
        'id' => '244',
        'name' => '梅州市',
        'child' => 
        array (
          2273 => 
          array (
            'id' => '2273',
            'name' => '梅江区',
          ),
          2274 => 
          array (
            'id' => '2274',
            'name' => '梅县',
          ),
          2275 => 
          array (
            'id' => '2275',
            'name' => '大埔县',
          ),
          2276 => 
          array (
            'id' => '2276',
            'name' => '丰顺县',
          ),
          2277 => 
          array (
            'id' => '2277',
            'name' => '五华县',
          ),
          2278 => 
          array (
            'id' => '2278',
            'name' => '平远县',
          ),
          2279 => 
          array (
            'id' => '2279',
            'name' => '蕉岭县',
          ),
          2280 => 
          array (
            'id' => '2280',
            'name' => '兴宁市',
          ),
        ),
      ),
      245 => 
      array (
        'id' => '245',
        'name' => '汕尾市',
        'child' => 
        array (
          2281 => 
          array (
            'id' => '2281',
            'name' => '城区',
          ),
          2282 => 
          array (
            'id' => '2282',
            'name' => '陆丰市',
          ),
          2283 => 
          array (
            'id' => '2283',
            'name' => '海丰县',
          ),
          2284 => 
          array (
            'id' => '2284',
            'name' => '陆河县',
          ),
        ),
      ),
      246 => 
      array (
        'id' => '246',
        'name' => '河源市',
        'child' => 
        array (
          2285 => 
          array (
            'id' => '2285',
            'name' => '源城区',
          ),
          2286 => 
          array (
            'id' => '2286',
            'name' => '紫金县',
          ),
          2287 => 
          array (
            'id' => '2287',
            'name' => '龙川县',
          ),
          2288 => 
          array (
            'id' => '2288',
            'name' => '连平县',
          ),
          2289 => 
          array (
            'id' => '2289',
            'name' => '和平县',
          ),
          2290 => 
          array (
            'id' => '2290',
            'name' => '东源县',
          ),
        ),
      ),
      247 => 
      array (
        'id' => '247',
        'name' => '阳江市',
        'child' => 
        array (
          2291 => 
          array (
            'id' => '2291',
            'name' => '江城区',
          ),
          2292 => 
          array (
            'id' => '2292',
            'name' => '阳西县',
          ),
          2293 => 
          array (
            'id' => '2293',
            'name' => '阳东县',
          ),
          2294 => 
          array (
            'id' => '2294',
            'name' => '阳春市',
          ),
        ),
      ),
      248 => 
      array (
        'id' => '248',
        'name' => '清远市',
        'child' => 
        array (
          2295 => 
          array (
            'id' => '2295',
            'name' => '清城区',
          ),
          2296 => 
          array (
            'id' => '2296',
            'name' => '佛冈县',
          ),
          2297 => 
          array (
            'id' => '2297',
            'name' => '阳山县',
          ),
          2298 => 
          array (
            'id' => '2298',
            'name' => '连山壮族瑶族自治县',
          ),
          2299 => 
          array (
            'id' => '2299',
            'name' => '连南瑶族自治县',
          ),
          2300 => 
          array (
            'id' => '2300',
            'name' => '清新县',
          ),
          2301 => 
          array (
            'id' => '2301',
            'name' => '英德市',
          ),
          2302 => 
          array (
            'id' => '2302',
            'name' => '连州市',
          ),
        ),
      ),
      249 => 
      array (
        'id' => '249',
        'name' => '潮州市',
        'child' => 
        array (
          2303 => 
          array (
            'id' => '2303',
            'name' => '湘桥区',
          ),
          2304 => 
          array (
            'id' => '2304',
            'name' => '潮安县',
          ),
          2305 => 
          array (
            'id' => '2305',
            'name' => '饶平县',
          ),
        ),
      ),
      250 => 
      array (
        'id' => '250',
        'name' => '揭阳市',
        'child' => 
        array (
          2306 => 
          array (
            'id' => '2306',
            'name' => '榕城区',
          ),
          2307 => 
          array (
            'id' => '2307',
            'name' => '揭东县',
          ),
          2308 => 
          array (
            'id' => '2308',
            'name' => '揭西县',
          ),
          2309 => 
          array (
            'id' => '2309',
            'name' => '惠来县',
          ),
          2310 => 
          array (
            'id' => '2310',
            'name' => '普宁市',
          ),
          2311 => 
          array (
            'id' => '2311',
            'name' => '东山区',
          ),
          2312 => 
          array (
            'id' => '2312',
            'name' => '普侨区',
          ),
          2313 => 
          array (
            'id' => '2313',
            'name' => '大南山侨区',
          ),
        ),
      ),
      251 => 
      array (
        'id' => '251',
        'name' => '云浮市',
        'child' => 
        array (
          2314 => 
          array (
            'id' => '2314',
            'name' => '云城区',
          ),
          2315 => 
          array (
            'id' => '2315',
            'name' => '新兴县',
          ),
          2316 => 
          array (
            'id' => '2316',
            'name' => '郁南县',
          ),
          2317 => 
          array (
            'id' => '2317',
            'name' => '云安县',
          ),
          2318 => 
          array (
            'id' => '2318',
            'name' => '罗定市',
          ),
        ),
      ),
      252 => 
      array (
        'id' => '252',
        'name' => '东莞市',
        'child' => 
        array (
          2319 => 
          array (
            'id' => '2319',
            'name' => '南城区',
          ),
          2320 => 
          array (
            'id' => '2320',
            'name' => '石龙镇',
          ),
          2321 => 
          array (
            'id' => '2321',
            'name' => '长安镇',
          ),
          2322 => 
          array (
            'id' => '2322',
            'name' => '虎门镇',
          ),
          2323 => 
          array (
            'id' => '2323',
            'name' => '横沥镇',
          ),
          2324 => 
          array (
            'id' => '2324',
            'name' => '寮步镇',
          ),
          2325 => 
          array (
            'id' => '2325',
            'name' => '黄江镇',
          ),
          2326 => 
          array (
            'id' => '2326',
            'name' => '清溪镇',
          ),
          2327 => 
          array (
            'id' => '2327',
            'name' => '莞城区',
          ),
          2328 => 
          array (
            'id' => '2328',
            'name' => '万江区',
          ),
          2329 => 
          array (
            'id' => '2329',
            'name' => '东城区',
          ),
          2330 => 
          array (
            'id' => '2330',
            'name' => '石碣镇',
          ),
          2331 => 
          array (
            'id' => '2331',
            'name' => '茶山镇',
          ),
          2332 => 
          array (
            'id' => '2332',
            'name' => '石排镇',
          ),
          2333 => 
          array (
            'id' => '2333',
            'name' => '企石镇',
          ),
          2334 => 
          array (
            'id' => '2334',
            'name' => '桥头镇',
          ),
          2335 => 
          array (
            'id' => '2335',
            'name' => '谢岗镇',
          ),
          2336 => 
          array (
            'id' => '2336',
            'name' => '东坑镇',
          ),
          2337 => 
          array (
            'id' => '2337',
            'name' => '常平镇',
          ),
          2338 => 
          array (
            'id' => '2338',
            'name' => '大朗镇',
          ),
          2339 => 
          array (
            'id' => '2339',
            'name' => '塘厦镇',
          ),
          2340 => 
          array (
            'id' => '2340',
            'name' => '凤岗镇',
          ),
          2341 => 
          array (
            'id' => '2341',
            'name' => '厚街镇',
          ),
          2342 => 
          array (
            'id' => '2342',
            'name' => '沙田镇',
          ),
          2343 => 
          array (
            'id' => '2343',
            'name' => '道滘镇',
          ),
          2344 => 
          array (
            'id' => '2344',
            'name' => '洪梅镇',
          ),
          2345 => 
          array (
            'id' => '2345',
            'name' => '麻涌镇',
          ),
          2346 => 
          array (
            'id' => '2346',
            'name' => '中堂镇',
          ),
          2347 => 
          array (
            'id' => '2347',
            'name' => '高埗镇',
          ),
          2348 => 
          array (
            'id' => '2348',
            'name' => '樟木头镇',
          ),
          2349 => 
          array (
            'id' => '2349',
            'name' => '大岭山镇',
          ),
          2350 => 
          array (
            'id' => '2350',
            'name' => '望牛墩镇',
          ),
        ),
      ),
      253 => 
      array (
        'id' => '253',
        'name' => '中山市',
        'child' => 
        array (
          2351 => 
          array (
            'id' => '2351',
            'name' => '中山市',
          ),
        ),
      ),
    ),
  ),
  21 => 
  array (
    'id' => '21',
    'name' => '广西壮族自治区',
    'child' => 
    array (
      254 => 
      array (
        'id' => '254',
        'name' => '南宁市',
        'child' => 
        array (
          2352 => 
          array (
            'id' => '2352',
            'name' => '兴宁区',
          ),
          2353 => 
          array (
            'id' => '2353',
            'name' => '青秀区',
          ),
          2354 => 
          array (
            'id' => '2354',
            'name' => '江南区',
          ),
          2355 => 
          array (
            'id' => '2355',
            'name' => '西乡塘区',
          ),
          2356 => 
          array (
            'id' => '2356',
            'name' => '良庆区',
          ),
          2357 => 
          array (
            'id' => '2357',
            'name' => '邕宁区',
          ),
          2358 => 
          array (
            'id' => '2358',
            'name' => '武鸣县',
          ),
          2359 => 
          array (
            'id' => '2359',
            'name' => '隆安县',
          ),
          2360 => 
          array (
            'id' => '2360',
            'name' => '马山县',
          ),
          2361 => 
          array (
            'id' => '2361',
            'name' => '上林县',
          ),
          2362 => 
          array (
            'id' => '2362',
            'name' => '宾阳县',
          ),
          2363 => 
          array (
            'id' => '2363',
            'name' => '横县',
          ),
        ),
      ),
      255 => 
      array (
        'id' => '255',
        'name' => '柳州市',
        'child' => 
        array (
          2364 => 
          array (
            'id' => '2364',
            'name' => '城中区',
          ),
          2365 => 
          array (
            'id' => '2365',
            'name' => '鱼峰区',
          ),
          2366 => 
          array (
            'id' => '2366',
            'name' => '柳南区',
          ),
          2367 => 
          array (
            'id' => '2367',
            'name' => '柳北区',
          ),
          2368 => 
          array (
            'id' => '2368',
            'name' => '柳江县',
          ),
          2369 => 
          array (
            'id' => '2369',
            'name' => '柳城县',
          ),
          2370 => 
          array (
            'id' => '2370',
            'name' => '鹿寨县',
          ),
          2371 => 
          array (
            'id' => '2371',
            'name' => '融安县',
          ),
          2372 => 
          array (
            'id' => '2372',
            'name' => '融水苗族自治县',
          ),
          2373 => 
          array (
            'id' => '2373',
            'name' => '三江侗族自治县',
          ),
        ),
      ),
      256 => 
      array (
        'id' => '256',
        'name' => '桂林市',
        'child' => 
        array (
          2374 => 
          array (
            'id' => '2374',
            'name' => '秀峰区',
          ),
          2375 => 
          array (
            'id' => '2375',
            'name' => '叠彩区',
          ),
          2376 => 
          array (
            'id' => '2376',
            'name' => '象山区',
          ),
          2377 => 
          array (
            'id' => '2377',
            'name' => '七星区',
          ),
          2378 => 
          array (
            'id' => '2378',
            'name' => '雁山区',
          ),
          2379 => 
          array (
            'id' => '2379',
            'name' => '阳朔县',
          ),
          2380 => 
          array (
            'id' => '2380',
            'name' => '临桂县',
          ),
          2381 => 
          array (
            'id' => '2381',
            'name' => '灵川县',
          ),
          2382 => 
          array (
            'id' => '2382',
            'name' => '全州县',
          ),
          2383 => 
          array (
            'id' => '2383',
            'name' => '兴安县',
          ),
          2384 => 
          array (
            'id' => '2384',
            'name' => '永福县',
          ),
          2385 => 
          array (
            'id' => '2385',
            'name' => '灌阳县',
          ),
          2386 => 
          array (
            'id' => '2386',
            'name' => '龙胜各族自治县',
          ),
          2387 => 
          array (
            'id' => '2387',
            'name' => '资源县',
          ),
          2388 => 
          array (
            'id' => '2388',
            'name' => '平乐县',
          ),
          2389 => 
          array (
            'id' => '2389',
            'name' => '荔浦县',
          ),
          2390 => 
          array (
            'id' => '2390',
            'name' => '恭城瑶族自治县',
          ),
        ),
      ),
      257 => 
      array (
        'id' => '257',
        'name' => '梧州市',
        'child' => 
        array (
          2391 => 
          array (
            'id' => '2391',
            'name' => '万秀区',
          ),
          2392 => 
          array (
            'id' => '2392',
            'name' => '蝶山区',
          ),
          2393 => 
          array (
            'id' => '2393',
            'name' => '长洲区',
          ),
          2394 => 
          array (
            'id' => '2394',
            'name' => '苍梧县',
          ),
          2395 => 
          array (
            'id' => '2395',
            'name' => '藤县',
          ),
          2396 => 
          array (
            'id' => '2396',
            'name' => '蒙山县',
          ),
          2397 => 
          array (
            'id' => '2397',
            'name' => '岑溪市',
          ),
        ),
      ),
      258 => 
      array (
        'id' => '258',
        'name' => '北海市',
        'child' => 
        array (
          2398 => 
          array (
            'id' => '2398',
            'name' => '海城区',
          ),
          2399 => 
          array (
            'id' => '2399',
            'name' => '银海区',
          ),
          2400 => 
          array (
            'id' => '2400',
            'name' => '铁山港区',
          ),
          2401 => 
          array (
            'id' => '2401',
            'name' => '合浦县',
          ),
        ),
      ),
      259 => 
      array (
        'id' => '259',
        'name' => '防城港市',
        'child' => 
        array (
          2402 => 
          array (
            'id' => '2402',
            'name' => '港口区',
          ),
          2403 => 
          array (
            'id' => '2403',
            'name' => '防城区',
          ),
          2404 => 
          array (
            'id' => '2404',
            'name' => '上思县',
          ),
          2405 => 
          array (
            'id' => '2405',
            'name' => '东兴市',
          ),
        ),
      ),
      260 => 
      array (
        'id' => '260',
        'name' => '钦州市',
        'child' => 
        array (
          2406 => 
          array (
            'id' => '2406',
            'name' => '钦南区',
          ),
          2407 => 
          array (
            'id' => '2407',
            'name' => '钦北区',
          ),
          2408 => 
          array (
            'id' => '2408',
            'name' => '灵山县',
          ),
          2409 => 
          array (
            'id' => '2409',
            'name' => '浦北县',
          ),
          2410 => 
          array (
            'id' => '2410',
            'name' => '钦州港经济开发区',
          ),
        ),
      ),
      261 => 
      array (
        'id' => '261',
        'name' => '贵港市',
        'child' => 
        array (
          2411 => 
          array (
            'id' => '2411',
            'name' => '港北区',
          ),
          2412 => 
          array (
            'id' => '2412',
            'name' => '港南区',
          ),
          2413 => 
          array (
            'id' => '2413',
            'name' => '覃塘区',
          ),
          2414 => 
          array (
            'id' => '2414',
            'name' => '平南县',
          ),
          2415 => 
          array (
            'id' => '2415',
            'name' => '桂平市',
          ),
        ),
      ),
      262 => 
      array (
        'id' => '262',
        'name' => '玉林市',
        'child' => 
        array (
          2416 => 
          array (
            'id' => '2416',
            'name' => '玉州区',
          ),
          2417 => 
          array (
            'id' => '2417',
            'name' => '容县',
          ),
          2418 => 
          array (
            'id' => '2418',
            'name' => '陆川县',
          ),
          2419 => 
          array (
            'id' => '2419',
            'name' => '博白县',
          ),
          2420 => 
          array (
            'id' => '2420',
            'name' => '兴业县',
          ),
          2421 => 
          array (
            'id' => '2421',
            'name' => '北流市',
          ),
        ),
      ),
      263 => 
      array (
        'id' => '263',
        'name' => '百色市',
        'child' => 
        array (
          2422 => 
          array (
            'id' => '2422',
            'name' => '右江区',
          ),
          2423 => 
          array (
            'id' => '2423',
            'name' => '田阳县',
          ),
          2424 => 
          array (
            'id' => '2424',
            'name' => '田东县',
          ),
          2425 => 
          array (
            'id' => '2425',
            'name' => '平果县',
          ),
          2426 => 
          array (
            'id' => '2426',
            'name' => '德保县',
          ),
          2427 => 
          array (
            'id' => '2427',
            'name' => '靖西县',
          ),
          2428 => 
          array (
            'id' => '2428',
            'name' => '那坡县',
          ),
          2429 => 
          array (
            'id' => '2429',
            'name' => '凌云县',
          ),
          2430 => 
          array (
            'id' => '2430',
            'name' => '乐业县',
          ),
          2431 => 
          array (
            'id' => '2431',
            'name' => '田林县',
          ),
          2432 => 
          array (
            'id' => '2432',
            'name' => '西林县',
          ),
          2433 => 
          array (
            'id' => '2433',
            'name' => '隆林各族自治县',
          ),
        ),
      ),
      264 => 
      array (
        'id' => '264',
        'name' => '贺州市',
        'child' => 
        array (
          2434 => 
          array (
            'id' => '2434',
            'name' => '八步区',
          ),
          2435 => 
          array (
            'id' => '2435',
            'name' => '昭平县',
          ),
          2436 => 
          array (
            'id' => '2436',
            'name' => '钟山县',
          ),
          2437 => 
          array (
            'id' => '2437',
            'name' => '富川瑶族自治县',
          ),
        ),
      ),
      265 => 
      array (
        'id' => '265',
        'name' => '河池市',
        'child' => 
        array (
          2438 => 
          array (
            'id' => '2438',
            'name' => '金城江区',
          ),
          2439 => 
          array (
            'id' => '2439',
            'name' => '南丹县',
          ),
          2440 => 
          array (
            'id' => '2440',
            'name' => '天峨县',
          ),
          2441 => 
          array (
            'id' => '2441',
            'name' => '凤山县',
          ),
          2442 => 
          array (
            'id' => '2442',
            'name' => '东兰县',
          ),
          2443 => 
          array (
            'id' => '2443',
            'name' => '罗城仫佬族自治县',
          ),
          2444 => 
          array (
            'id' => '2444',
            'name' => '环江毛南族自治县',
          ),
          2445 => 
          array (
            'id' => '2445',
            'name' => '巴马瑶族自治县',
          ),
          2446 => 
          array (
            'id' => '2446',
            'name' => '都安瑶族自治县',
          ),
          2447 => 
          array (
            'id' => '2447',
            'name' => '大化瑶族自治县',
          ),
          2448 => 
          array (
            'id' => '2448',
            'name' => '宜州市',
          ),
        ),
      ),
      266 => 
      array (
        'id' => '266',
        'name' => '来宾市',
        'child' => 
        array (
          2449 => 
          array (
            'id' => '2449',
            'name' => '兴宾区',
          ),
          2450 => 
          array (
            'id' => '2450',
            'name' => '忻城县',
          ),
          2451 => 
          array (
            'id' => '2451',
            'name' => '象州县',
          ),
          2452 => 
          array (
            'id' => '2452',
            'name' => '武宣县',
          ),
          2453 => 
          array (
            'id' => '2453',
            'name' => '金秀瑶族自治县',
          ),
          2454 => 
          array (
            'id' => '2454',
            'name' => '合山市',
          ),
        ),
      ),
      267 => 
      array (
        'id' => '267',
        'name' => '崇左市',
        'child' => 
        array (
          2455 => 
          array (
            'id' => '2455',
            'name' => '江洲区',
          ),
          2456 => 
          array (
            'id' => '2456',
            'name' => '扶绥县',
          ),
          2457 => 
          array (
            'id' => '2457',
            'name' => '宁明县',
          ),
          2458 => 
          array (
            'id' => '2458',
            'name' => '龙州县',
          ),
          2459 => 
          array (
            'id' => '2459',
            'name' => '大新县',
          ),
          2460 => 
          array (
            'id' => '2460',
            'name' => '天等县',
          ),
          2461 => 
          array (
            'id' => '2461',
            'name' => '凭祥市',
          ),
        ),
      ),
    ),
  ),
  22 => 
  array (
    'id' => '22',
    'name' => '海南省',
    'child' => 
    array (
      268 => 
      array (
        'id' => '268',
        'name' => '海口市',
        'child' => 
        array (
          2462 => 
          array (
            'id' => '2462',
            'name' => '秀英区',
          ),
          2463 => 
          array (
            'id' => '2463',
            'name' => '龙华区',
          ),
          2464 => 
          array (
            'id' => '2464',
            'name' => '琼山区',
          ),
          2465 => 
          array (
            'id' => '2465',
            'name' => '美兰区',
          ),
        ),
      ),
      269 => 
      array (
        'id' => '269',
        'name' => '省直辖县级行政单位',
        'child' => 
        array (
          2466 => 
          array (
            'id' => '2466',
            'name' => '五指山市',
          ),
          2467 => 
          array (
            'id' => '2467',
            'name' => '琼海市',
          ),
          2468 => 
          array (
            'id' => '2468',
            'name' => '儋州市',
          ),
          2469 => 
          array (
            'id' => '2469',
            'name' => '文昌市',
          ),
          2470 => 
          array (
            'id' => '2470',
            'name' => '万宁市',
          ),
          2471 => 
          array (
            'id' => '2471',
            'name' => '东方市',
          ),
          2472 => 
          array (
            'id' => '2472',
            'name' => '定安县',
          ),
          2473 => 
          array (
            'id' => '2473',
            'name' => '屯昌县',
          ),
          2474 => 
          array (
            'id' => '2474',
            'name' => '澄迈县',
          ),
          2475 => 
          array (
            'id' => '2475',
            'name' => '临高县',
          ),
          2476 => 
          array (
            'id' => '2476',
            'name' => '白沙黎族自治县',
          ),
          2477 => 
          array (
            'id' => '2477',
            'name' => '昌江黎族自治县',
          ),
          2478 => 
          array (
            'id' => '2478',
            'name' => '乐东黎族自治县',
          ),
          2479 => 
          array (
            'id' => '2479',
            'name' => '陵水黎族自治县',
          ),
          2480 => 
          array (
            'id' => '2480',
            'name' => '保亭黎族苗族自治县',
          ),
          2481 => 
          array (
            'id' => '2481',
            'name' => '琼中黎族苗族自治县',
          ),
          2482 => 
          array (
            'id' => '2482',
            'name' => '西、南、中沙群岛办事处',
          ),
        ),
      ),
      270 => 
      array (
        'id' => '270',
        'name' => '三亚市',
        'child' => 
        array (
          2483 => 
          array (
            'id' => '2483',
            'name' => '河西区',
          ),
          2484 => 
          array (
            'id' => '2484',
            'name' => '河东区',
          ),
          2485 => 
          array (
            'id' => '2485',
            'name' => '田独镇',
          ),
          2486 => 
          array (
            'id' => '2486',
            'name' => '凤凰镇',
          ),
          2487 => 
          array (
            'id' => '2487',
            'name' => '三亚市',
          ),
          2488 => 
          array (
            'id' => '2488',
            'name' => '崖城镇',
          ),
          2489 => 
          array (
            'id' => '2489',
            'name' => '天涯镇',
          ),
          2490 => 
          array (
            'id' => '2490',
            'name' => '育才乡',
          ),
          2491 => 
          array (
            'id' => '2491',
            'name' => '海棠湾镇',
          ),
        ),
      ),
    ),
  ),
  23 => 
  array (
    'id' => '23',
    'name' => '重庆市',
    'child' => 
    array (
      271 => 
      array (
        'id' => '271',
        'name' => '重庆市',
        'child' => 
        array (
          2492 => 
          array (
            'id' => '2492',
            'name' => '万州区',
          ),
          2493 => 
          array (
            'id' => '2493',
            'name' => '涪陵区',
          ),
          2494 => 
          array (
            'id' => '2494',
            'name' => '渝中区',
          ),
          2495 => 
          array (
            'id' => '2495',
            'name' => '大渡口区',
          ),
          2496 => 
          array (
            'id' => '2496',
            'name' => '江北区',
          ),
          2497 => 
          array (
            'id' => '2497',
            'name' => '沙坪坝区',
          ),
          2498 => 
          array (
            'id' => '2498',
            'name' => '九龙坡区',
          ),
          2499 => 
          array (
            'id' => '2499',
            'name' => '南岸区',
          ),
          2500 => 
          array (
            'id' => '2500',
            'name' => '北碚区',
          ),
          2501 => 
          array (
            'id' => '2501',
            'name' => '万盛区',
          ),
          2502 => 
          array (
            'id' => '2502',
            'name' => '双桥区',
          ),
          2503 => 
          array (
            'id' => '2503',
            'name' => '渝北区',
          ),
          2504 => 
          array (
            'id' => '2504',
            'name' => '巴南区',
          ),
          2505 => 
          array (
            'id' => '2505',
            'name' => '黔江区',
          ),
          2506 => 
          array (
            'id' => '2506',
            'name' => '长寿区',
          ),
          2507 => 
          array (
            'id' => '2507',
            'name' => '綦江县',
          ),
          2508 => 
          array (
            'id' => '2508',
            'name' => '潼南县',
          ),
          2509 => 
          array (
            'id' => '2509',
            'name' => '铜梁县',
          ),
          2510 => 
          array (
            'id' => '2510',
            'name' => '大足县',
          ),
          2511 => 
          array (
            'id' => '2511',
            'name' => '荣昌县',
          ),
          2512 => 
          array (
            'id' => '2512',
            'name' => '璧山县',
          ),
          2513 => 
          array (
            'id' => '2513',
            'name' => '梁平县',
          ),
          2514 => 
          array (
            'id' => '2514',
            'name' => '城口县',
          ),
          2515 => 
          array (
            'id' => '2515',
            'name' => '丰都县',
          ),
          2516 => 
          array (
            'id' => '2516',
            'name' => '垫江县',
          ),
          2517 => 
          array (
            'id' => '2517',
            'name' => '武隆县',
          ),
          2518 => 
          array (
            'id' => '2518',
            'name' => '忠县',
          ),
          2519 => 
          array (
            'id' => '2519',
            'name' => '开县',
          ),
          2520 => 
          array (
            'id' => '2520',
            'name' => '云阳县',
          ),
          2521 => 
          array (
            'id' => '2521',
            'name' => '奉节县',
          ),
          2522 => 
          array (
            'id' => '2522',
            'name' => '巫山县',
          ),
          2523 => 
          array (
            'id' => '2523',
            'name' => '巫溪县',
          ),
          2524 => 
          array (
            'id' => '2524',
            'name' => '石柱土家族自治县',
          ),
          2525 => 
          array (
            'id' => '2525',
            'name' => '秀山土家族苗族自治县',
          ),
          2526 => 
          array (
            'id' => '2526',
            'name' => '酉阳土家族苗族自治县',
          ),
          2527 => 
          array (
            'id' => '2527',
            'name' => '彭水苗族土家族自治县',
          ),
          2528 => 
          array (
            'id' => '2528',
            'name' => '高新区',
          ),
          2529 => 
          array (
            'id' => '2529',
            'name' => '江津区',
          ),
          2530 => 
          array (
            'id' => '2530',
            'name' => '合川区',
          ),
          2531 => 
          array (
            'id' => '2531',
            'name' => '永川区',
          ),
          2532 => 
          array (
            'id' => '2532',
            'name' => '南川区',
          ),
        ),
      ),
    ),
  ),
  24 => 
  array (
    'id' => '24',
    'name' => '四川省',
    'child' => 
    array (
      272 => 
      array (
        'id' => '272',
        'name' => '成都市',
        'child' => 
        array (
          2533 => 
          array (
            'id' => '2533',
            'name' => '锦江区',
          ),
          2534 => 
          array (
            'id' => '2534',
            'name' => '青羊区',
          ),
          2535 => 
          array (
            'id' => '2535',
            'name' => '金牛区',
          ),
          2536 => 
          array (
            'id' => '2536',
            'name' => '武侯区',
          ),
          2537 => 
          array (
            'id' => '2537',
            'name' => '成华区',
          ),
          2538 => 
          array (
            'id' => '2538',
            'name' => '龙泉驿区',
          ),
          2539 => 
          array (
            'id' => '2539',
            'name' => '青白江区',
          ),
          2540 => 
          array (
            'id' => '2540',
            'name' => '新都区',
          ),
          2541 => 
          array (
            'id' => '2541',
            'name' => '温江区',
          ),
          2542 => 
          array (
            'id' => '2542',
            'name' => '金堂县',
          ),
          2543 => 
          array (
            'id' => '2543',
            'name' => '双流县',
          ),
          2544 => 
          array (
            'id' => '2544',
            'name' => '郫县',
          ),
          2545 => 
          array (
            'id' => '2545',
            'name' => '大邑县',
          ),
          2546 => 
          array (
            'id' => '2546',
            'name' => '蒲江县',
          ),
          2547 => 
          array (
            'id' => '2547',
            'name' => '新津县',
          ),
          2548 => 
          array (
            'id' => '2548',
            'name' => '都江堰市',
          ),
          2549 => 
          array (
            'id' => '2549',
            'name' => '彭州市',
          ),
          2550 => 
          array (
            'id' => '2550',
            'name' => '邛崃市',
          ),
          2551 => 
          array (
            'id' => '2551',
            'name' => '崇州市',
          ),
          2552 => 
          array (
            'id' => '2552',
            'name' => '高新区',
          ),
          2553 => 
          array (
            'id' => '2553',
            'name' => '高新西区',
          ),
        ),
      ),
      273 => 
      array (
        'id' => '273',
        'name' => '自贡市',
        'child' => 
        array (
          2554 => 
          array (
            'id' => '2554',
            'name' => '自流井区',
          ),
          2555 => 
          array (
            'id' => '2555',
            'name' => '贡井区',
          ),
          2556 => 
          array (
            'id' => '2556',
            'name' => '大安区',
          ),
          2557 => 
          array (
            'id' => '2557',
            'name' => '沿滩区',
          ),
          2558 => 
          array (
            'id' => '2558',
            'name' => '荣县',
          ),
          2559 => 
          array (
            'id' => '2559',
            'name' => '富顺县',
          ),
        ),
      ),
      274 => 
      array (
        'id' => '274',
        'name' => '攀枝花市',
        'child' => 
        array (
          2560 => 
          array (
            'id' => '2560',
            'name' => '东区',
          ),
          2561 => 
          array (
            'id' => '2561',
            'name' => '西区',
          ),
          2562 => 
          array (
            'id' => '2562',
            'name' => '仁和区',
          ),
          2563 => 
          array (
            'id' => '2563',
            'name' => '米易县',
          ),
          2564 => 
          array (
            'id' => '2564',
            'name' => '盐边县',
          ),
        ),
      ),
      275 => 
      array (
        'id' => '275',
        'name' => '泸州市',
        'child' => 
        array (
          2565 => 
          array (
            'id' => '2565',
            'name' => '江阳区',
          ),
          2566 => 
          array (
            'id' => '2566',
            'name' => '纳溪区',
          ),
          2567 => 
          array (
            'id' => '2567',
            'name' => '龙马潭区',
          ),
          2568 => 
          array (
            'id' => '2568',
            'name' => '泸县',
          ),
          2569 => 
          array (
            'id' => '2569',
            'name' => '合江县',
          ),
          2570 => 
          array (
            'id' => '2570',
            'name' => '叙永县',
          ),
          2571 => 
          array (
            'id' => '2571',
            'name' => '古蔺县',
          ),
        ),
      ),
      276 => 
      array (
        'id' => '276',
        'name' => '德阳市',
        'child' => 
        array (
          2572 => 
          array (
            'id' => '2572',
            'name' => '旌阳区',
          ),
          2573 => 
          array (
            'id' => '2573',
            'name' => '中江县',
          ),
          2574 => 
          array (
            'id' => '2574',
            'name' => '罗江县',
          ),
          2575 => 
          array (
            'id' => '2575',
            'name' => '广汉市',
          ),
          2576 => 
          array (
            'id' => '2576',
            'name' => '什邡市',
          ),
          2577 => 
          array (
            'id' => '2577',
            'name' => '绵竹市',
          ),
        ),
      ),
      277 => 
      array (
        'id' => '277',
        'name' => '绵阳市',
        'child' => 
        array (
          2578 => 
          array (
            'id' => '2578',
            'name' => '涪城区',
          ),
          2579 => 
          array (
            'id' => '2579',
            'name' => '游仙区',
          ),
          2580 => 
          array (
            'id' => '2580',
            'name' => '三台县',
          ),
          2581 => 
          array (
            'id' => '2581',
            'name' => '盐亭县',
          ),
          2582 => 
          array (
            'id' => '2582',
            'name' => '安县',
          ),
          2583 => 
          array (
            'id' => '2583',
            'name' => '梓潼县',
          ),
          2584 => 
          array (
            'id' => '2584',
            'name' => '北川羌族自治县',
          ),
          2585 => 
          array (
            'id' => '2585',
            'name' => '平武县',
          ),
          2586 => 
          array (
            'id' => '2586',
            'name' => '江油市',
          ),
          2587 => 
          array (
            'id' => '2587',
            'name' => '农科区',
          ),
          2588 => 
          array (
            'id' => '2588',
            'name' => '经济技术开发区',
          ),
          2589 => 
          array (
            'id' => '2589',
            'name' => '高新区',
          ),
          2590 => 
          array (
            'id' => '2590',
            'name' => '仙海区',
          ),
        ),
      ),
      278 => 
      array (
        'id' => '278',
        'name' => '广元市',
        'child' => 
        array (
          2591 => 
          array (
            'id' => '2591',
            'name' => '利州区',
          ),
          2592 => 
          array (
            'id' => '2592',
            'name' => '元坝区',
          ),
          2593 => 
          array (
            'id' => '2593',
            'name' => '朝天区',
          ),
          2594 => 
          array (
            'id' => '2594',
            'name' => '旺苍县',
          ),
          2595 => 
          array (
            'id' => '2595',
            'name' => '青川县',
          ),
          2596 => 
          array (
            'id' => '2596',
            'name' => '剑阁县',
          ),
          2597 => 
          array (
            'id' => '2597',
            'name' => '苍溪县',
          ),
        ),
      ),
      279 => 
      array (
        'id' => '279',
        'name' => '遂宁市',
        'child' => 
        array (
          2598 => 
          array (
            'id' => '2598',
            'name' => '船山区',
          ),
          2599 => 
          array (
            'id' => '2599',
            'name' => '安居区',
          ),
          2600 => 
          array (
            'id' => '2600',
            'name' => '蓬溪县',
          ),
          2601 => 
          array (
            'id' => '2601',
            'name' => '射洪县',
          ),
          2602 => 
          array (
            'id' => '2602',
            'name' => '大英县',
          ),
        ),
      ),
      280 => 
      array (
        'id' => '280',
        'name' => '内江市',
        'child' => 
        array (
          2603 => 
          array (
            'id' => '2603',
            'name' => '市中区',
          ),
          2604 => 
          array (
            'id' => '2604',
            'name' => '东兴区',
          ),
          2605 => 
          array (
            'id' => '2605',
            'name' => '威远县',
          ),
          2606 => 
          array (
            'id' => '2606',
            'name' => '资中县',
          ),
          2607 => 
          array (
            'id' => '2607',
            'name' => '隆昌县',
          ),
        ),
      ),
      281 => 
      array (
        'id' => '281',
        'name' => '乐山市',
        'child' => 
        array (
          2608 => 
          array (
            'id' => '2608',
            'name' => '市中区',
          ),
          2609 => 
          array (
            'id' => '2609',
            'name' => '沙湾区',
          ),
          2610 => 
          array (
            'id' => '2610',
            'name' => '五通桥区',
          ),
          2611 => 
          array (
            'id' => '2611',
            'name' => '金口河区',
          ),
          2612 => 
          array (
            'id' => '2612',
            'name' => '犍为县',
          ),
          2613 => 
          array (
            'id' => '2613',
            'name' => '井研县',
          ),
          2614 => 
          array (
            'id' => '2614',
            'name' => '夹江县',
          ),
          2615 => 
          array (
            'id' => '2615',
            'name' => '沐川县',
          ),
          2616 => 
          array (
            'id' => '2616',
            'name' => '峨边彝族自治县',
          ),
          2617 => 
          array (
            'id' => '2617',
            'name' => '马边彝族自治县',
          ),
          2618 => 
          array (
            'id' => '2618',
            'name' => '峨眉山市',
          ),
        ),
      ),
      282 => 
      array (
        'id' => '282',
        'name' => '南充市',
        'child' => 
        array (
          2619 => 
          array (
            'id' => '2619',
            'name' => '顺庆区',
          ),
          2620 => 
          array (
            'id' => '2620',
            'name' => '高坪区',
          ),
          2621 => 
          array (
            'id' => '2621',
            'name' => '嘉陵区',
          ),
          2622 => 
          array (
            'id' => '2622',
            'name' => '南部县',
          ),
          2623 => 
          array (
            'id' => '2623',
            'name' => '营山县',
          ),
          2624 => 
          array (
            'id' => '2624',
            'name' => '蓬安县',
          ),
          2625 => 
          array (
            'id' => '2625',
            'name' => '仪陇县',
          ),
          2626 => 
          array (
            'id' => '2626',
            'name' => '西充县',
          ),
          2627 => 
          array (
            'id' => '2627',
            'name' => '阆中市',
          ),
        ),
      ),
      283 => 
      array (
        'id' => '283',
        'name' => '眉山市',
        'child' => 
        array (
          2628 => 
          array (
            'id' => '2628',
            'name' => '东坡区',
          ),
          2629 => 
          array (
            'id' => '2629',
            'name' => '仁寿县',
          ),
          2630 => 
          array (
            'id' => '2630',
            'name' => '彭山县',
          ),
          2631 => 
          array (
            'id' => '2631',
            'name' => '洪雅县',
          ),
          2632 => 
          array (
            'id' => '2632',
            'name' => '丹棱县',
          ),
          2633 => 
          array (
            'id' => '2633',
            'name' => '青神县',
          ),
        ),
      ),
      284 => 
      array (
        'id' => '284',
        'name' => '宜宾市',
        'child' => 
        array (
          2634 => 
          array (
            'id' => '2634',
            'name' => '翠屏区',
          ),
          2635 => 
          array (
            'id' => '2635',
            'name' => '宜宾县',
          ),
          2636 => 
          array (
            'id' => '2636',
            'name' => '南溪县',
          ),
          2637 => 
          array (
            'id' => '2637',
            'name' => '江安县',
          ),
          2638 => 
          array (
            'id' => '2638',
            'name' => '长宁县',
          ),
          2639 => 
          array (
            'id' => '2639',
            'name' => '高县',
          ),
          2640 => 
          array (
            'id' => '2640',
            'name' => '珙县',
          ),
          2641 => 
          array (
            'id' => '2641',
            'name' => '筠连县',
          ),
          2642 => 
          array (
            'id' => '2642',
            'name' => '兴文县',
          ),
          2643 => 
          array (
            'id' => '2643',
            'name' => '屏山县',
          ),
        ),
      ),
      285 => 
      array (
        'id' => '285',
        'name' => '广安市',
        'child' => 
        array (
          2644 => 
          array (
            'id' => '2644',
            'name' => '广安区',
          ),
          2645 => 
          array (
            'id' => '2645',
            'name' => '岳池县',
          ),
          2646 => 
          array (
            'id' => '2646',
            'name' => '武胜县',
          ),
          2647 => 
          array (
            'id' => '2647',
            'name' => '邻水县',
          ),
          2648 => 
          array (
            'id' => '2648',
            'name' => '华蓥市',
          ),
        ),
      ),
      286 => 
      array (
        'id' => '286',
        'name' => '达州市',
        'child' => 
        array (
          2649 => 
          array (
            'id' => '2649',
            'name' => '通川区',
          ),
          2650 => 
          array (
            'id' => '2650',
            'name' => '达县',
          ),
          2651 => 
          array (
            'id' => '2651',
            'name' => '宣汉县',
          ),
          2652 => 
          array (
            'id' => '2652',
            'name' => '开江县',
          ),
          2653 => 
          array (
            'id' => '2653',
            'name' => '大竹县',
          ),
          2654 => 
          array (
            'id' => '2654',
            'name' => '渠县',
          ),
          2655 => 
          array (
            'id' => '2655',
            'name' => '万源市',
          ),
        ),
      ),
      287 => 
      array (
        'id' => '287',
        'name' => '雅安市',
        'child' => 
        array (
          2656 => 
          array (
            'id' => '2656',
            'name' => '雨城区',
          ),
          2657 => 
          array (
            'id' => '2657',
            'name' => '名山县',
          ),
          2658 => 
          array (
            'id' => '2658',
            'name' => '荥经县',
          ),
          2659 => 
          array (
            'id' => '2659',
            'name' => '汉源县',
          ),
          2660 => 
          array (
            'id' => '2660',
            'name' => '石棉县',
          ),
          2661 => 
          array (
            'id' => '2661',
            'name' => '天全县',
          ),
          2662 => 
          array (
            'id' => '2662',
            'name' => '芦山县',
          ),
          2663 => 
          array (
            'id' => '2663',
            'name' => '宝兴县',
          ),
        ),
      ),
      288 => 
      array (
        'id' => '288',
        'name' => '巴中市',
        'child' => 
        array (
          2664 => 
          array (
            'id' => '2664',
            'name' => '巴州区',
          ),
          2665 => 
          array (
            'id' => '2665',
            'name' => '通江县',
          ),
          2666 => 
          array (
            'id' => '2666',
            'name' => '南江县',
          ),
          2667 => 
          array (
            'id' => '2667',
            'name' => '平昌县',
          ),
        ),
      ),
      289 => 
      array (
        'id' => '289',
        'name' => '资阳市',
        'child' => 
        array (
          2668 => 
          array (
            'id' => '2668',
            'name' => '雁江区',
          ),
          2669 => 
          array (
            'id' => '2669',
            'name' => '安岳县',
          ),
          2670 => 
          array (
            'id' => '2670',
            'name' => '乐至县',
          ),
          2671 => 
          array (
            'id' => '2671',
            'name' => '简阳市',
          ),
        ),
      ),
      290 => 
      array (
        'id' => '290',
        'name' => '阿坝藏族羌族自治州',
        'child' => 
        array (
          2672 => 
          array (
            'id' => '2672',
            'name' => '汶川县',
          ),
          2673 => 
          array (
            'id' => '2673',
            'name' => '理县',
          ),
          2674 => 
          array (
            'id' => '2674',
            'name' => '茂县',
          ),
          2675 => 
          array (
            'id' => '2675',
            'name' => '松潘县',
          ),
          2676 => 
          array (
            'id' => '2676',
            'name' => '九寨沟县',
          ),
          2677 => 
          array (
            'id' => '2677',
            'name' => '金川县',
          ),
          2678 => 
          array (
            'id' => '2678',
            'name' => '小金县',
          ),
          2679 => 
          array (
            'id' => '2679',
            'name' => '黑水县',
          ),
          2680 => 
          array (
            'id' => '2680',
            'name' => '马尔康县',
          ),
          2681 => 
          array (
            'id' => '2681',
            'name' => '壤塘县',
          ),
          2682 => 
          array (
            'id' => '2682',
            'name' => '阿坝县',
          ),
          2683 => 
          array (
            'id' => '2683',
            'name' => '若尔盖县',
          ),
          2684 => 
          array (
            'id' => '2684',
            'name' => '红原县',
          ),
        ),
      ),
      291 => 
      array (
        'id' => '291',
        'name' => '甘孜藏族自治州',
        'child' => 
        array (
          2685 => 
          array (
            'id' => '2685',
            'name' => '康定县',
          ),
          2686 => 
          array (
            'id' => '2686',
            'name' => '泸定县',
          ),
          2687 => 
          array (
            'id' => '2687',
            'name' => '丹巴县',
          ),
          2688 => 
          array (
            'id' => '2688',
            'name' => '九龙县',
          ),
          2689 => 
          array (
            'id' => '2689',
            'name' => '雅江县',
          ),
          2690 => 
          array (
            'id' => '2690',
            'name' => '道孚县',
          ),
          2691 => 
          array (
            'id' => '2691',
            'name' => '炉霍县',
          ),
          2692 => 
          array (
            'id' => '2692',
            'name' => '甘孜县',
          ),
          2693 => 
          array (
            'id' => '2693',
            'name' => '新龙县',
          ),
          2694 => 
          array (
            'id' => '2694',
            'name' => '德格县',
          ),
          2695 => 
          array (
            'id' => '2695',
            'name' => '白玉县',
          ),
          2696 => 
          array (
            'id' => '2696',
            'name' => '石渠县',
          ),
          2697 => 
          array (
            'id' => '2697',
            'name' => '色达县',
          ),
          2698 => 
          array (
            'id' => '2698',
            'name' => '理塘县',
          ),
          2699 => 
          array (
            'id' => '2699',
            'name' => '巴塘县',
          ),
          2700 => 
          array (
            'id' => '2700',
            'name' => '乡城县',
          ),
          2701 => 
          array (
            'id' => '2701',
            'name' => '稻城县',
          ),
          2702 => 
          array (
            'id' => '2702',
            'name' => '得荣县',
          ),
        ),
      ),
      292 => 
      array (
        'id' => '292',
        'name' => '凉山彝族自治州',
        'child' => 
        array (
          2703 => 
          array (
            'id' => '2703',
            'name' => '西昌市',
          ),
          2704 => 
          array (
            'id' => '2704',
            'name' => '木里藏族自治县',
          ),
          2705 => 
          array (
            'id' => '2705',
            'name' => '盐源县',
          ),
          2706 => 
          array (
            'id' => '2706',
            'name' => '德昌县',
          ),
          2707 => 
          array (
            'id' => '2707',
            'name' => '会理县',
          ),
          2708 => 
          array (
            'id' => '2708',
            'name' => '会东县',
          ),
          2709 => 
          array (
            'id' => '2709',
            'name' => '宁南县',
          ),
          2710 => 
          array (
            'id' => '2710',
            'name' => '普格县',
          ),
          2711 => 
          array (
            'id' => '2711',
            'name' => '布拖县',
          ),
          2712 => 
          array (
            'id' => '2712',
            'name' => '金阳县',
          ),
          2713 => 
          array (
            'id' => '2713',
            'name' => '昭觉县',
          ),
          2714 => 
          array (
            'id' => '2714',
            'name' => '喜德县',
          ),
          2715 => 
          array (
            'id' => '2715',
            'name' => '冕宁县',
          ),
          2716 => 
          array (
            'id' => '2716',
            'name' => '越西县',
          ),
          2717 => 
          array (
            'id' => '2717',
            'name' => '甘洛县',
          ),
          2718 => 
          array (
            'id' => '2718',
            'name' => '美姑县',
          ),
          2719 => 
          array (
            'id' => '2719',
            'name' => '雷波县',
          ),
        ),
      ),
    ),
  ),
  25 => 
  array (
    'id' => '25',
    'name' => '贵州省',
    'child' => 
    array (
      293 => 
      array (
        'id' => '293',
        'name' => '贵阳市',
        'child' => 
        array (
          2720 => 
          array (
            'id' => '2720',
            'name' => '南明区',
          ),
          2721 => 
          array (
            'id' => '2721',
            'name' => '云岩区',
          ),
          2722 => 
          array (
            'id' => '2722',
            'name' => '花溪区',
          ),
          2723 => 
          array (
            'id' => '2723',
            'name' => '乌当区',
          ),
          2724 => 
          array (
            'id' => '2724',
            'name' => '白云区',
          ),
          2725 => 
          array (
            'id' => '2725',
            'name' => '小河区',
          ),
          2726 => 
          array (
            'id' => '2726',
            'name' => '开阳县',
          ),
          2727 => 
          array (
            'id' => '2727',
            'name' => '息烽县',
          ),
          2728 => 
          array (
            'id' => '2728',
            'name' => '修文县',
          ),
          2729 => 
          array (
            'id' => '2729',
            'name' => '清镇市',
          ),
          2730 => 
          array (
            'id' => '2730',
            'name' => '金阳新区',
          ),
        ),
      ),
      294 => 
      array (
        'id' => '294',
        'name' => '六盘水市',
        'child' => 
        array (
          2731 => 
          array (
            'id' => '2731',
            'name' => '钟山区',
          ),
          2732 => 
          array (
            'id' => '2732',
            'name' => '六枝特区',
          ),
          2733 => 
          array (
            'id' => '2733',
            'name' => '水城县',
          ),
          2734 => 
          array (
            'id' => '2734',
            'name' => '盘县',
          ),
        ),
      ),
      295 => 
      array (
        'id' => '295',
        'name' => '遵义市',
        'child' => 
        array (
          2735 => 
          array (
            'id' => '2735',
            'name' => '红花岗区',
          ),
          2736 => 
          array (
            'id' => '2736',
            'name' => '汇川区',
          ),
          2737 => 
          array (
            'id' => '2737',
            'name' => '遵义县',
          ),
          2738 => 
          array (
            'id' => '2738',
            'name' => '桐梓县',
          ),
          2739 => 
          array (
            'id' => '2739',
            'name' => '绥阳县',
          ),
          2740 => 
          array (
            'id' => '2740',
            'name' => '正安县',
          ),
          2741 => 
          array (
            'id' => '2741',
            'name' => '道真仡佬族苗族自治县',
          ),
          2742 => 
          array (
            'id' => '2742',
            'name' => '务川仡佬族苗族自治县',
          ),
          2743 => 
          array (
            'id' => '2743',
            'name' => '凤冈县',
          ),
          2744 => 
          array (
            'id' => '2744',
            'name' => '湄潭县',
          ),
          2745 => 
          array (
            'id' => '2745',
            'name' => '余庆县',
          ),
          2746 => 
          array (
            'id' => '2746',
            'name' => '习水县',
          ),
          2747 => 
          array (
            'id' => '2747',
            'name' => '赤水市',
          ),
          2748 => 
          array (
            'id' => '2748',
            'name' => '仁怀市',
          ),
        ),
      ),
      296 => 
      array (
        'id' => '296',
        'name' => '安顺市',
        'child' => 
        array (
          2749 => 
          array (
            'id' => '2749',
            'name' => '西秀区',
          ),
          2750 => 
          array (
            'id' => '2750',
            'name' => '平坝县',
          ),
          2751 => 
          array (
            'id' => '2751',
            'name' => '普定县',
          ),
          2752 => 
          array (
            'id' => '2752',
            'name' => '镇宁布依族苗族自治县',
          ),
          2753 => 
          array (
            'id' => '2753',
            'name' => '关岭布依族苗族自治县',
          ),
          2754 => 
          array (
            'id' => '2754',
            'name' => '紫云苗族布依族自治县',
          ),
        ),
      ),
      297 => 
      array (
        'id' => '297',
        'name' => '铜仁地区',
        'child' => 
        array (
          2755 => 
          array (
            'id' => '2755',
            'name' => '铜仁市',
          ),
          2756 => 
          array (
            'id' => '2756',
            'name' => '江口县',
          ),
          2757 => 
          array (
            'id' => '2757',
            'name' => '玉屏侗族自治县',
          ),
          2758 => 
          array (
            'id' => '2758',
            'name' => '石阡县',
          ),
          2759 => 
          array (
            'id' => '2759',
            'name' => '思南县',
          ),
          2760 => 
          array (
            'id' => '2760',
            'name' => '印江土家族苗族自治县',
          ),
          2761 => 
          array (
            'id' => '2761',
            'name' => '德江县',
          ),
          2762 => 
          array (
            'id' => '2762',
            'name' => '沿河土家族自治县',
          ),
          2763 => 
          array (
            'id' => '2763',
            'name' => '松桃苗族自治县',
          ),
          2764 => 
          array (
            'id' => '2764',
            'name' => '万山特区',
          ),
        ),
      ),
      298 => 
      array (
        'id' => '298',
        'name' => '黔西南布依族苗族自治州',
        'child' => 
        array (
          2765 => 
          array (
            'id' => '2765',
            'name' => '兴义市',
          ),
          2766 => 
          array (
            'id' => '2766',
            'name' => '兴仁县',
          ),
          2767 => 
          array (
            'id' => '2767',
            'name' => '普安县',
          ),
          2768 => 
          array (
            'id' => '2768',
            'name' => '晴隆县',
          ),
          2769 => 
          array (
            'id' => '2769',
            'name' => '贞丰县',
          ),
          2770 => 
          array (
            'id' => '2770',
            'name' => '望谟县',
          ),
          2771 => 
          array (
            'id' => '2771',
            'name' => '册亨县',
          ),
          2772 => 
          array (
            'id' => '2772',
            'name' => '安龙县',
          ),
        ),
      ),
      299 => 
      array (
        'id' => '299',
        'name' => '毕节地区',
        'child' => 
        array (
          2773 => 
          array (
            'id' => '2773',
            'name' => '毕节市',
          ),
          2774 => 
          array (
            'id' => '2774',
            'name' => '大方县',
          ),
          2775 => 
          array (
            'id' => '2775',
            'name' => '黔西县',
          ),
          2776 => 
          array (
            'id' => '2776',
            'name' => '金沙县',
          ),
          2777 => 
          array (
            'id' => '2777',
            'name' => '织金县',
          ),
          2778 => 
          array (
            'id' => '2778',
            'name' => '纳雍县',
          ),
          2779 => 
          array (
            'id' => '2779',
            'name' => '威宁彝族回族苗族自治县',
          ),
          2780 => 
          array (
            'id' => '2780',
            'name' => '赫章县',
          ),
        ),
      ),
      300 => 
      array (
        'id' => '300',
        'name' => '黔东南苗族侗族自治州',
        'child' => 
        array (
          2781 => 
          array (
            'id' => '2781',
            'name' => '凯里市',
          ),
          2782 => 
          array (
            'id' => '2782',
            'name' => '黄平县',
          ),
          2783 => 
          array (
            'id' => '2783',
            'name' => '施秉县',
          ),
          2784 => 
          array (
            'id' => '2784',
            'name' => '三穗县',
          ),
          2785 => 
          array (
            'id' => '2785',
            'name' => '镇远县',
          ),
          2786 => 
          array (
            'id' => '2786',
            'name' => '岑巩县',
          ),
          2787 => 
          array (
            'id' => '2787',
            'name' => '天柱县',
          ),
          2788 => 
          array (
            'id' => '2788',
            'name' => '锦屏县',
          ),
          2789 => 
          array (
            'id' => '2789',
            'name' => '剑河县',
          ),
          2790 => 
          array (
            'id' => '2790',
            'name' => '台江县',
          ),
          2791 => 
          array (
            'id' => '2791',
            'name' => '黎平县',
          ),
          2792 => 
          array (
            'id' => '2792',
            'name' => '榕江县',
          ),
          2793 => 
          array (
            'id' => '2793',
            'name' => '从江县',
          ),
          2794 => 
          array (
            'id' => '2794',
            'name' => '雷山县',
          ),
          2795 => 
          array (
            'id' => '2795',
            'name' => '麻江县',
          ),
          2796 => 
          array (
            'id' => '2796',
            'name' => '丹寨县',
          ),
        ),
      ),
      301 => 
      array (
        'id' => '301',
        'name' => '黔南布依族苗族自治州',
        'child' => 
        array (
          2797 => 
          array (
            'id' => '2797',
            'name' => '都匀市',
          ),
          2798 => 
          array (
            'id' => '2798',
            'name' => '福泉市',
          ),
          2799 => 
          array (
            'id' => '2799',
            'name' => '荔波县',
          ),
          2800 => 
          array (
            'id' => '2800',
            'name' => '贵定县',
          ),
          2801 => 
          array (
            'id' => '2801',
            'name' => '瓮安县',
          ),
          2802 => 
          array (
            'id' => '2802',
            'name' => '独山县',
          ),
          2803 => 
          array (
            'id' => '2803',
            'name' => '平塘县',
          ),
          2804 => 
          array (
            'id' => '2804',
            'name' => '罗甸县',
          ),
          2805 => 
          array (
            'id' => '2805',
            'name' => '长顺县',
          ),
          2806 => 
          array (
            'id' => '2806',
            'name' => '龙里县',
          ),
          2807 => 
          array (
            'id' => '2807',
            'name' => '惠水县',
          ),
          2808 => 
          array (
            'id' => '2808',
            'name' => '三都水族自治县',
          ),
        ),
      ),
    ),
  ),
  26 => 
  array (
    'id' => '26',
    'name' => '云南省',
    'child' => 
    array (
      302 => 
      array (
        'id' => '302',
        'name' => '昆明市',
        'child' => 
        array (
          2809 => 
          array (
            'id' => '2809',
            'name' => '五华区',
          ),
          2810 => 
          array (
            'id' => '2810',
            'name' => '盘龙区',
          ),
          2811 => 
          array (
            'id' => '2811',
            'name' => '官渡区',
          ),
          2812 => 
          array (
            'id' => '2812',
            'name' => '西山区',
          ),
          2813 => 
          array (
            'id' => '2813',
            'name' => '东川区',
          ),
          2814 => 
          array (
            'id' => '2814',
            'name' => '呈贡县',
          ),
          2815 => 
          array (
            'id' => '2815',
            'name' => '晋宁县',
          ),
          2816 => 
          array (
            'id' => '2816',
            'name' => '富民县',
          ),
          2817 => 
          array (
            'id' => '2817',
            'name' => '宜良县',
          ),
          2818 => 
          array (
            'id' => '2818',
            'name' => '石林彝族自治县',
          ),
          2819 => 
          array (
            'id' => '2819',
            'name' => '嵩明县',
          ),
          2820 => 
          array (
            'id' => '2820',
            'name' => '禄劝彝族苗族自治县',
          ),
          2821 => 
          array (
            'id' => '2821',
            'name' => '寻甸回族彝族自治县',
          ),
          2822 => 
          array (
            'id' => '2822',
            'name' => '安宁市',
          ),
        ),
      ),
      303 => 
      array (
        'id' => '303',
        'name' => '曲靖市',
        'child' => 
        array (
          2823 => 
          array (
            'id' => '2823',
            'name' => '麒麟区',
          ),
          2824 => 
          array (
            'id' => '2824',
            'name' => '马龙县',
          ),
          2825 => 
          array (
            'id' => '2825',
            'name' => '陆良县',
          ),
          2826 => 
          array (
            'id' => '2826',
            'name' => '师宗县',
          ),
          2827 => 
          array (
            'id' => '2827',
            'name' => '罗平县',
          ),
          2828 => 
          array (
            'id' => '2828',
            'name' => '富源县',
          ),
          2829 => 
          array (
            'id' => '2829',
            'name' => '会泽县',
          ),
          2830 => 
          array (
            'id' => '2830',
            'name' => '沾益县',
          ),
          2831 => 
          array (
            'id' => '2831',
            'name' => '宣威市',
          ),
        ),
      ),
      304 => 
      array (
        'id' => '304',
        'name' => '玉溪市',
        'child' => 
        array (
          2832 => 
          array (
            'id' => '2832',
            'name' => '红塔区',
          ),
          2833 => 
          array (
            'id' => '2833',
            'name' => '江川县',
          ),
          2834 => 
          array (
            'id' => '2834',
            'name' => '澄江县',
          ),
          2835 => 
          array (
            'id' => '2835',
            'name' => '通海县',
          ),
          2836 => 
          array (
            'id' => '2836',
            'name' => '华宁县',
          ),
          2837 => 
          array (
            'id' => '2837',
            'name' => '易门县',
          ),
          2838 => 
          array (
            'id' => '2838',
            'name' => '峨山彝族自治县',
          ),
          2839 => 
          array (
            'id' => '2839',
            'name' => '新平彝族傣族自治县',
          ),
          2840 => 
          array (
            'id' => '2840',
            'name' => '元江哈尼族彝族傣族自治县',
          ),
        ),
      ),
      305 => 
      array (
        'id' => '305',
        'name' => '保山市',
        'child' => 
        array (
          2841 => 
          array (
            'id' => '2841',
            'name' => '隆阳区',
          ),
          2842 => 
          array (
            'id' => '2842',
            'name' => '施甸县',
          ),
          2843 => 
          array (
            'id' => '2843',
            'name' => '腾冲县',
          ),
          2844 => 
          array (
            'id' => '2844',
            'name' => '龙陵县',
          ),
          2845 => 
          array (
            'id' => '2845',
            'name' => '昌宁县',
          ),
        ),
      ),
      306 => 
      array (
        'id' => '306',
        'name' => '昭通市',
        'child' => 
        array (
          2846 => 
          array (
            'id' => '2846',
            'name' => '昭阳区',
          ),
          2847 => 
          array (
            'id' => '2847',
            'name' => '鲁甸县',
          ),
          2848 => 
          array (
            'id' => '2848',
            'name' => '巧家县',
          ),
          2849 => 
          array (
            'id' => '2849',
            'name' => '盐津县',
          ),
          2850 => 
          array (
            'id' => '2850',
            'name' => '大关县',
          ),
          2851 => 
          array (
            'id' => '2851',
            'name' => '永善县',
          ),
          2852 => 
          array (
            'id' => '2852',
            'name' => '绥江县',
          ),
          2853 => 
          array (
            'id' => '2853',
            'name' => '镇雄县',
          ),
          2854 => 
          array (
            'id' => '2854',
            'name' => '彝良县',
          ),
          2855 => 
          array (
            'id' => '2855',
            'name' => '威信县',
          ),
          2856 => 
          array (
            'id' => '2856',
            'name' => '水富县',
          ),
        ),
      ),
      307 => 
      array (
        'id' => '307',
        'name' => '丽江市',
        'child' => 
        array (
          2857 => 
          array (
            'id' => '2857',
            'name' => '古城区',
          ),
          2858 => 
          array (
            'id' => '2858',
            'name' => '玉龙纳西族自治县',
          ),
          2859 => 
          array (
            'id' => '2859',
            'name' => '永胜县',
          ),
          2860 => 
          array (
            'id' => '2860',
            'name' => '华坪县',
          ),
          2861 => 
          array (
            'id' => '2861',
            'name' => '宁蒗彝族自治县',
          ),
        ),
      ),
      308 => 
      array (
        'id' => '308',
        'name' => '普洱市',
        'child' => 
        array (
          2862 => 
          array (
            'id' => '2862',
            'name' => '思茅区',
          ),
          2863 => 
          array (
            'id' => '2863',
            'name' => '宁洱哈尼族彝族自治县',
          ),
          2864 => 
          array (
            'id' => '2864',
            'name' => '墨江哈尼族自治县',
          ),
          2865 => 
          array (
            'id' => '2865',
            'name' => '景东彝族自治县',
          ),
          2866 => 
          array (
            'id' => '2866',
            'name' => '景谷傣族彝族自治县',
          ),
          2867 => 
          array (
            'id' => '2867',
            'name' => '镇沅彝族哈尼族拉祜族自治县',
          ),
          2868 => 
          array (
            'id' => '2868',
            'name' => '江城哈尼族彝族自治县',
          ),
          2869 => 
          array (
            'id' => '2869',
            'name' => '孟连傣族拉祜族佤族自治县',
          ),
          2870 => 
          array (
            'id' => '2870',
            'name' => '澜沧拉祜族自治县',
          ),
          2871 => 
          array (
            'id' => '2871',
            'name' => '西盟佤族自治县',
          ),
        ),
      ),
      309 => 
      array (
        'id' => '309',
        'name' => '临沧市',
        'child' => 
        array (
          2872 => 
          array (
            'id' => '2872',
            'name' => '临翔区',
          ),
          2873 => 
          array (
            'id' => '2873',
            'name' => '凤庆县',
          ),
          2874 => 
          array (
            'id' => '2874',
            'name' => '云县',
          ),
          2875 => 
          array (
            'id' => '2875',
            'name' => '永德县',
          ),
          2876 => 
          array (
            'id' => '2876',
            'name' => '镇康县',
          ),
          2877 => 
          array (
            'id' => '2877',
            'name' => '双江拉祜族佤族布朗族傣族自治县',
          ),
          2878 => 
          array (
            'id' => '2878',
            'name' => '耿马傣族佤族自治县',
          ),
          2879 => 
          array (
            'id' => '2879',
            'name' => '沧源佤族自治县',
          ),
        ),
      ),
      310 => 
      array (
        'id' => '310',
        'name' => '楚雄彝族自治州',
        'child' => 
        array (
          2880 => 
          array (
            'id' => '2880',
            'name' => '楚雄市',
          ),
          2881 => 
          array (
            'id' => '2881',
            'name' => '双柏县',
          ),
          2882 => 
          array (
            'id' => '2882',
            'name' => '牟定县',
          ),
          2883 => 
          array (
            'id' => '2883',
            'name' => '南华县',
          ),
          2884 => 
          array (
            'id' => '2884',
            'name' => '姚安县',
          ),
          2885 => 
          array (
            'id' => '2885',
            'name' => '大姚县',
          ),
          2886 => 
          array (
            'id' => '2886',
            'name' => '永仁县',
          ),
          2887 => 
          array (
            'id' => '2887',
            'name' => '元谋县',
          ),
          2888 => 
          array (
            'id' => '2888',
            'name' => '武定县',
          ),
          2889 => 
          array (
            'id' => '2889',
            'name' => '禄丰县',
          ),
        ),
      ),
      311 => 
      array (
        'id' => '311',
        'name' => '红河哈尼族彝族自治州',
        'child' => 
        array (
          2890 => 
          array (
            'id' => '2890',
            'name' => '个旧市',
          ),
          2891 => 
          array (
            'id' => '2891',
            'name' => '开远市',
          ),
          2892 => 
          array (
            'id' => '2892',
            'name' => '蒙自县',
          ),
          2893 => 
          array (
            'id' => '2893',
            'name' => '屏边苗族自治县',
          ),
          2894 => 
          array (
            'id' => '2894',
            'name' => '建水县',
          ),
          2895 => 
          array (
            'id' => '2895',
            'name' => '石屏县',
          ),
          2896 => 
          array (
            'id' => '2896',
            'name' => '弥勒县',
          ),
          2897 => 
          array (
            'id' => '2897',
            'name' => '泸西县',
          ),
          2898 => 
          array (
            'id' => '2898',
            'name' => '元阳县',
          ),
          2899 => 
          array (
            'id' => '2899',
            'name' => '红河县',
          ),
          2900 => 
          array (
            'id' => '2900',
            'name' => '金平苗族瑶族傣族自治县',
          ),
          2901 => 
          array (
            'id' => '2901',
            'name' => '绿春县',
          ),
          2902 => 
          array (
            'id' => '2902',
            'name' => '河口瑶族自治县',
          ),
        ),
      ),
      312 => 
      array (
        'id' => '312',
        'name' => '文山壮族苗族自治州',
        'child' => 
        array (
          2903 => 
          array (
            'id' => '2903',
            'name' => '文山县',
          ),
          2904 => 
          array (
            'id' => '2904',
            'name' => '砚山县',
          ),
          2905 => 
          array (
            'id' => '2905',
            'name' => '西畴县',
          ),
          2906 => 
          array (
            'id' => '2906',
            'name' => '麻栗坡县',
          ),
          2907 => 
          array (
            'id' => '2907',
            'name' => '马关县',
          ),
          2908 => 
          array (
            'id' => '2908',
            'name' => '丘北县',
          ),
          2909 => 
          array (
            'id' => '2909',
            'name' => '广南县',
          ),
          2910 => 
          array (
            'id' => '2910',
            'name' => '富宁县',
          ),
        ),
      ),
      313 => 
      array (
        'id' => '313',
        'name' => '西双版纳傣族自治州',
        'child' => 
        array (
          2911 => 
          array (
            'id' => '2911',
            'name' => '景洪市',
          ),
          2912 => 
          array (
            'id' => '2912',
            'name' => '勐海县',
          ),
          2913 => 
          array (
            'id' => '2913',
            'name' => '勐腊县',
          ),
        ),
      ),
      314 => 
      array (
        'id' => '314',
        'name' => '大理白族自治州',
        'child' => 
        array (
          2914 => 
          array (
            'id' => '2914',
            'name' => '大理市',
          ),
          2915 => 
          array (
            'id' => '2915',
            'name' => '漾濞彝族自治县',
          ),
          2916 => 
          array (
            'id' => '2916',
            'name' => '祥云县',
          ),
          2917 => 
          array (
            'id' => '2917',
            'name' => '宾川县',
          ),
          2918 => 
          array (
            'id' => '2918',
            'name' => '弥渡县',
          ),
          2919 => 
          array (
            'id' => '2919',
            'name' => '南涧彝族自治县',
          ),
          2920 => 
          array (
            'id' => '2920',
            'name' => '巍山彝族回族自治县',
          ),
          2921 => 
          array (
            'id' => '2921',
            'name' => '永平县',
          ),
          2922 => 
          array (
            'id' => '2922',
            'name' => '云龙县',
          ),
          2923 => 
          array (
            'id' => '2923',
            'name' => '洱源县',
          ),
          2924 => 
          array (
            'id' => '2924',
            'name' => '剑川县',
          ),
          2925 => 
          array (
            'id' => '2925',
            'name' => '鹤庆县',
          ),
        ),
      ),
      315 => 
      array (
        'id' => '315',
        'name' => '德宏傣族景颇族自治州',
        'child' => 
        array (
          2926 => 
          array (
            'id' => '2926',
            'name' => '瑞丽市',
          ),
          2927 => 
          array (
            'id' => '2927',
            'name' => '潞西市',
          ),
          2928 => 
          array (
            'id' => '2928',
            'name' => '梁河县',
          ),
          2929 => 
          array (
            'id' => '2929',
            'name' => '盈江县',
          ),
          2930 => 
          array (
            'id' => '2930',
            'name' => '陇川县',
          ),
        ),
      ),
      316 => 
      array (
        'id' => '316',
        'name' => '怒江傈僳族自治州',
        'child' => 
        array (
          2931 => 
          array (
            'id' => '2931',
            'name' => '泸水县',
          ),
          2932 => 
          array (
            'id' => '2932',
            'name' => '福贡县',
          ),
          2933 => 
          array (
            'id' => '2933',
            'name' => '贡山独龙族怒族自治县',
          ),
          2934 => 
          array (
            'id' => '2934',
            'name' => '兰坪白族普米族自治县',
          ),
        ),
      ),
      317 => 
      array (
        'id' => '317',
        'name' => '迪庆藏族自治州',
        'child' => 
        array (
          2935 => 
          array (
            'id' => '2935',
            'name' => '香格里拉县',
          ),
          2936 => 
          array (
            'id' => '2936',
            'name' => '德钦县',
          ),
          2937 => 
          array (
            'id' => '2937',
            'name' => '维西傈僳族自治县',
          ),
        ),
      ),
    ),
  ),
  27 => 
  array (
    'id' => '27',
    'name' => '西藏自治区',
    'child' => 
    array (
      318 => 
      array (
        'id' => '318',
        'name' => '拉萨市',
        'child' => 
        array (
          2938 => 
          array (
            'id' => '2938',
            'name' => '城关区',
          ),
          2939 => 
          array (
            'id' => '2939',
            'name' => '林周县',
          ),
          2940 => 
          array (
            'id' => '2940',
            'name' => '当雄县',
          ),
          2941 => 
          array (
            'id' => '2941',
            'name' => '尼木县',
          ),
          2942 => 
          array (
            'id' => '2942',
            'name' => '曲水县',
          ),
          2943 => 
          array (
            'id' => '2943',
            'name' => '堆龙德庆县',
          ),
          2944 => 
          array (
            'id' => '2944',
            'name' => '达孜县',
          ),
          2945 => 
          array (
            'id' => '2945',
            'name' => '墨竹工卡县',
          ),
        ),
      ),
      319 => 
      array (
        'id' => '319',
        'name' => '昌都地区',
        'child' => 
        array (
          2946 => 
          array (
            'id' => '2946',
            'name' => '昌都县',
          ),
          2947 => 
          array (
            'id' => '2947',
            'name' => '江达县',
          ),
          2948 => 
          array (
            'id' => '2948',
            'name' => '贡觉县',
          ),
          2949 => 
          array (
            'id' => '2949',
            'name' => '类乌齐县',
          ),
          2950 => 
          array (
            'id' => '2950',
            'name' => '丁青县',
          ),
          2951 => 
          array (
            'id' => '2951',
            'name' => '察雅县',
          ),
          2952 => 
          array (
            'id' => '2952',
            'name' => '八宿县',
          ),
          2953 => 
          array (
            'id' => '2953',
            'name' => '左贡县',
          ),
          2954 => 
          array (
            'id' => '2954',
            'name' => '芒康县',
          ),
          2955 => 
          array (
            'id' => '2955',
            'name' => '洛隆县',
          ),
          2956 => 
          array (
            'id' => '2956',
            'name' => '边坝县',
          ),
        ),
      ),
      320 => 
      array (
        'id' => '320',
        'name' => '山南地区',
        'child' => 
        array (
          2957 => 
          array (
            'id' => '2957',
            'name' => '乃东县',
          ),
          2958 => 
          array (
            'id' => '2958',
            'name' => '扎囊县',
          ),
          2959 => 
          array (
            'id' => '2959',
            'name' => '贡嘎县',
          ),
          2960 => 
          array (
            'id' => '2960',
            'name' => '桑日县',
          ),
          2961 => 
          array (
            'id' => '2961',
            'name' => '琼结县',
          ),
          2962 => 
          array (
            'id' => '2962',
            'name' => '曲松县',
          ),
          2963 => 
          array (
            'id' => '2963',
            'name' => '措美县',
          ),
          2964 => 
          array (
            'id' => '2964',
            'name' => '洛扎县',
          ),
          2965 => 
          array (
            'id' => '2965',
            'name' => '加查县',
          ),
          2966 => 
          array (
            'id' => '2966',
            'name' => '隆子县',
          ),
          2967 => 
          array (
            'id' => '2967',
            'name' => '错那县',
          ),
          2968 => 
          array (
            'id' => '2968',
            'name' => '浪卡子县',
          ),
        ),
      ),
      321 => 
      array (
        'id' => '321',
        'name' => '日喀则地区',
        'child' => 
        array (
          2969 => 
          array (
            'id' => '2969',
            'name' => '日喀则市',
          ),
          2970 => 
          array (
            'id' => '2970',
            'name' => '南木林县',
          ),
          2971 => 
          array (
            'id' => '2971',
            'name' => '江孜县',
          ),
          2972 => 
          array (
            'id' => '2972',
            'name' => '定日县',
          ),
          2973 => 
          array (
            'id' => '2973',
            'name' => '萨迦县',
          ),
          2974 => 
          array (
            'id' => '2974',
            'name' => '拉孜县',
          ),
          2975 => 
          array (
            'id' => '2975',
            'name' => '昂仁县',
          ),
          2976 => 
          array (
            'id' => '2976',
            'name' => '谢通门县',
          ),
          2977 => 
          array (
            'id' => '2977',
            'name' => '白朗县',
          ),
          2978 => 
          array (
            'id' => '2978',
            'name' => '仁布县',
          ),
          2979 => 
          array (
            'id' => '2979',
            'name' => '康马县',
          ),
          2980 => 
          array (
            'id' => '2980',
            'name' => '定结县',
          ),
          2981 => 
          array (
            'id' => '2981',
            'name' => '仲巴县',
          ),
          2982 => 
          array (
            'id' => '2982',
            'name' => '亚东县',
          ),
          2983 => 
          array (
            'id' => '2983',
            'name' => '吉隆县',
          ),
          2984 => 
          array (
            'id' => '2984',
            'name' => '聂拉木县',
          ),
          2985 => 
          array (
            'id' => '2985',
            'name' => '萨嘎县',
          ),
          2986 => 
          array (
            'id' => '2986',
            'name' => '岗巴县',
          ),
        ),
      ),
      322 => 
      array (
        'id' => '322',
        'name' => '那曲地区',
        'child' => 
        array (
          2987 => 
          array (
            'id' => '2987',
            'name' => '那曲县',
          ),
          2988 => 
          array (
            'id' => '2988',
            'name' => '嘉黎县',
          ),
          2989 => 
          array (
            'id' => '2989',
            'name' => '比如县',
          ),
          2990 => 
          array (
            'id' => '2990',
            'name' => '聂荣县',
          ),
          2991 => 
          array (
            'id' => '2991',
            'name' => '安多县',
          ),
          2992 => 
          array (
            'id' => '2992',
            'name' => '申扎县',
          ),
          2993 => 
          array (
            'id' => '2993',
            'name' => '索县',
          ),
          2994 => 
          array (
            'id' => '2994',
            'name' => '班戈县',
          ),
          2995 => 
          array (
            'id' => '2995',
            'name' => '巴青县',
          ),
          2996 => 
          array (
            'id' => '2996',
            'name' => '尼玛县',
          ),
        ),
      ),
      323 => 
      array (
        'id' => '323',
        'name' => '阿里地区',
        'child' => 
        array (
          2997 => 
          array (
            'id' => '2997',
            'name' => '普兰县',
          ),
          2998 => 
          array (
            'id' => '2998',
            'name' => '札达县',
          ),
          2999 => 
          array (
            'id' => '2999',
            'name' => '噶尔县',
          ),
          3000 => 
          array (
            'id' => '3000',
            'name' => '日土县',
          ),
          3001 => 
          array (
            'id' => '3001',
            'name' => '革吉县',
          ),
          3002 => 
          array (
            'id' => '3002',
            'name' => '改则县',
          ),
          3003 => 
          array (
            'id' => '3003',
            'name' => '措勤县',
          ),
        ),
      ),
      324 => 
      array (
        'id' => '324',
        'name' => '林芝地区',
        'child' => 
        array (
          3004 => 
          array (
            'id' => '3004',
            'name' => '林芝县',
          ),
          3005 => 
          array (
            'id' => '3005',
            'name' => '工布江达县',
          ),
          3006 => 
          array (
            'id' => '3006',
            'name' => '米林县',
          ),
          3007 => 
          array (
            'id' => '3007',
            'name' => '墨脱县',
          ),
          3008 => 
          array (
            'id' => '3008',
            'name' => '波密县',
          ),
          3009 => 
          array (
            'id' => '3009',
            'name' => '察隅县',
          ),
          3010 => 
          array (
            'id' => '3010',
            'name' => '朗县',
          ),
        ),
      ),
    ),
  ),
  28 => 
  array (
    'id' => '28',
    'name' => '陕西省',
    'child' => 
    array (
      325 => 
      array (
        'id' => '325',
        'name' => '西安市',
        'child' => 
        array (
          3011 => 
          array (
            'id' => '3011',
            'name' => '新城区',
          ),
          3012 => 
          array (
            'id' => '3012',
            'name' => '碑林区',
          ),
          3013 => 
          array (
            'id' => '3013',
            'name' => '莲湖区',
          ),
          3014 => 
          array (
            'id' => '3014',
            'name' => '灞桥区',
          ),
          3015 => 
          array (
            'id' => '3015',
            'name' => '未央区',
          ),
          3016 => 
          array (
            'id' => '3016',
            'name' => '雁塔区',
          ),
          3017 => 
          array (
            'id' => '3017',
            'name' => '阎良区',
          ),
          3018 => 
          array (
            'id' => '3018',
            'name' => '临潼区',
          ),
          3019 => 
          array (
            'id' => '3019',
            'name' => '长安区',
          ),
          3020 => 
          array (
            'id' => '3020',
            'name' => '蓝田县',
          ),
          3021 => 
          array (
            'id' => '3021',
            'name' => '周至县',
          ),
          3022 => 
          array (
            'id' => '3022',
            'name' => '户县',
          ),
          3023 => 
          array (
            'id' => '3023',
            'name' => '高陵县',
          ),
          3024 => 
          array (
            'id' => '3024',
            'name' => '高新区',
          ),
        ),
      ),
      326 => 
      array (
        'id' => '326',
        'name' => '铜川市',
        'child' => 
        array (
          3025 => 
          array (
            'id' => '3025',
            'name' => '王益区',
          ),
          3026 => 
          array (
            'id' => '3026',
            'name' => '印台区',
          ),
          3027 => 
          array (
            'id' => '3027',
            'name' => '耀州区',
          ),
          3028 => 
          array (
            'id' => '3028',
            'name' => '宜君县',
          ),
          3029 => 
          array (
            'id' => '3029',
            'name' => '新区',
          ),
        ),
      ),
      327 => 
      array (
        'id' => '327',
        'name' => '宝鸡市',
        'child' => 
        array (
          3030 => 
          array (
            'id' => '3030',
            'name' => '渭滨区',
          ),
          3031 => 
          array (
            'id' => '3031',
            'name' => '金台区',
          ),
          3032 => 
          array (
            'id' => '3032',
            'name' => '陈仓区',
          ),
          3033 => 
          array (
            'id' => '3033',
            'name' => '凤翔县',
          ),
          3034 => 
          array (
            'id' => '3034',
            'name' => '岐山县',
          ),
          3035 => 
          array (
            'id' => '3035',
            'name' => '扶风县',
          ),
          3036 => 
          array (
            'id' => '3036',
            'name' => '眉县',
          ),
          3037 => 
          array (
            'id' => '3037',
            'name' => '陇县',
          ),
          3038 => 
          array (
            'id' => '3038',
            'name' => '千阳县',
          ),
          3039 => 
          array (
            'id' => '3039',
            'name' => '麟游县',
          ),
          3040 => 
          array (
            'id' => '3040',
            'name' => '凤县',
          ),
          3041 => 
          array (
            'id' => '3041',
            'name' => '太白县',
          ),
        ),
      ),
      328 => 
      array (
        'id' => '328',
        'name' => '咸阳市',
        'child' => 
        array (
          3042 => 
          array (
            'id' => '3042',
            'name' => '秦都区',
          ),
          3043 => 
          array (
            'id' => '3043',
            'name' => '渭城区',
          ),
          3044 => 
          array (
            'id' => '3044',
            'name' => '杨陵区',
          ),
          3045 => 
          array (
            'id' => '3045',
            'name' => '三原县',
          ),
          3046 => 
          array (
            'id' => '3046',
            'name' => '泾阳县',
          ),
          3047 => 
          array (
            'id' => '3047',
            'name' => '兴平市',
          ),
          3048 => 
          array (
            'id' => '3048',
            'name' => '乾县',
          ),
          3049 => 
          array (
            'id' => '3049',
            'name' => '礼泉县',
          ),
          3050 => 
          array (
            'id' => '3050',
            'name' => '永寿县',
          ),
          3051 => 
          array (
            'id' => '3051',
            'name' => '彬县',
          ),
          3052 => 
          array (
            'id' => '3052',
            'name' => '长武县',
          ),
          3053 => 
          array (
            'id' => '3053',
            'name' => '旬邑县',
          ),
          3054 => 
          array (
            'id' => '3054',
            'name' => '淳化县',
          ),
          3055 => 
          array (
            'id' => '3055',
            'name' => '武功县',
          ),
        ),
      ),
      329 => 
      array (
        'id' => '329',
        'name' => '渭南市',
        'child' => 
        array (
          3056 => 
          array (
            'id' => '3056',
            'name' => '临渭区',
          ),
          3057 => 
          array (
            'id' => '3057',
            'name' => '华县',
          ),
          3058 => 
          array (
            'id' => '3058',
            'name' => '潼关县',
          ),
          3059 => 
          array (
            'id' => '3059',
            'name' => '大荔县',
          ),
          3060 => 
          array (
            'id' => '3060',
            'name' => '合阳县',
          ),
          3061 => 
          array (
            'id' => '3061',
            'name' => '澄城县',
          ),
          3062 => 
          array (
            'id' => '3062',
            'name' => '蒲城县',
          ),
          3063 => 
          array (
            'id' => '3063',
            'name' => '白水县',
          ),
          3064 => 
          array (
            'id' => '3064',
            'name' => '富平县',
          ),
          3065 => 
          array (
            'id' => '3065',
            'name' => '韩城市',
          ),
          3066 => 
          array (
            'id' => '3066',
            'name' => '华阴市',
          ),
        ),
      ),
      330 => 
      array (
        'id' => '330',
        'name' => '延安市',
        'child' => 
        array (
          3067 => 
          array (
            'id' => '3067',
            'name' => '宝塔区',
          ),
          3068 => 
          array (
            'id' => '3068',
            'name' => '延长县',
          ),
          3069 => 
          array (
            'id' => '3069',
            'name' => '延川县',
          ),
          3070 => 
          array (
            'id' => '3070',
            'name' => '子长县',
          ),
          3071 => 
          array (
            'id' => '3071',
            'name' => '安塞县',
          ),
          3072 => 
          array (
            'id' => '3072',
            'name' => '志丹县',
          ),
          3073 => 
          array (
            'id' => '3073',
            'name' => '吴旗县',
          ),
          3074 => 
          array (
            'id' => '3074',
            'name' => '甘泉县',
          ),
          3075 => 
          array (
            'id' => '3075',
            'name' => '富县',
          ),
          3076 => 
          array (
            'id' => '3076',
            'name' => '洛川县',
          ),
          3077 => 
          array (
            'id' => '3077',
            'name' => '宜川县',
          ),
          3078 => 
          array (
            'id' => '3078',
            'name' => '黄龙县',
          ),
          3079 => 
          array (
            'id' => '3079',
            'name' => '黄陵县',
          ),
        ),
      ),
      331 => 
      array (
        'id' => '331',
        'name' => '汉中市',
        'child' => 
        array (
          3080 => 
          array (
            'id' => '3080',
            'name' => '汉台区',
          ),
          3081 => 
          array (
            'id' => '3081',
            'name' => '南郑县',
          ),
          3082 => 
          array (
            'id' => '3082',
            'name' => '城固县',
          ),
          3083 => 
          array (
            'id' => '3083',
            'name' => '洋县',
          ),
          3084 => 
          array (
            'id' => '3084',
            'name' => '西乡县',
          ),
          3085 => 
          array (
            'id' => '3085',
            'name' => '勉县',
          ),
          3086 => 
          array (
            'id' => '3086',
            'name' => '宁强县',
          ),
          3087 => 
          array (
            'id' => '3087',
            'name' => '略阳县',
          ),
          3088 => 
          array (
            'id' => '3088',
            'name' => '镇巴县',
          ),
          3089 => 
          array (
            'id' => '3089',
            'name' => '留坝县',
          ),
          3090 => 
          array (
            'id' => '3090',
            'name' => '佛坪县',
          ),
          3091 => 
          array (
            'id' => '3091',
            'name' => '经济开发区',
          ),
        ),
      ),
      332 => 
      array (
        'id' => '332',
        'name' => '榆林市',
        'child' => 
        array (
          3092 => 
          array (
            'id' => '3092',
            'name' => '榆阳区',
          ),
          3093 => 
          array (
            'id' => '3093',
            'name' => '神木县',
          ),
          3094 => 
          array (
            'id' => '3094',
            'name' => '府谷县',
          ),
          3095 => 
          array (
            'id' => '3095',
            'name' => '横山县',
          ),
          3096 => 
          array (
            'id' => '3096',
            'name' => '靖边县',
          ),
          3097 => 
          array (
            'id' => '3097',
            'name' => '定边县',
          ),
          3098 => 
          array (
            'id' => '3098',
            'name' => '绥德县',
          ),
          3099 => 
          array (
            'id' => '3099',
            'name' => '米脂县',
          ),
          3100 => 
          array (
            'id' => '3100',
            'name' => '佳县',
          ),
          3101 => 
          array (
            'id' => '3101',
            'name' => '吴堡县',
          ),
          3102 => 
          array (
            'id' => '3102',
            'name' => '清涧县',
          ),
          3103 => 
          array (
            'id' => '3103',
            'name' => '子洲县',
          ),
        ),
      ),
      333 => 
      array (
        'id' => '333',
        'name' => '安康市',
        'child' => 
        array (
          3104 => 
          array (
            'id' => '3104',
            'name' => '汉滨区',
          ),
          3105 => 
          array (
            'id' => '3105',
            'name' => '汉阴县',
          ),
          3106 => 
          array (
            'id' => '3106',
            'name' => '石泉县',
          ),
          3107 => 
          array (
            'id' => '3107',
            'name' => '宁陕县',
          ),
          3108 => 
          array (
            'id' => '3108',
            'name' => '紫阳县',
          ),
          3109 => 
          array (
            'id' => '3109',
            'name' => '岚皋县',
          ),
          3110 => 
          array (
            'id' => '3110',
            'name' => '平利县',
          ),
          3111 => 
          array (
            'id' => '3111',
            'name' => '镇坪县',
          ),
          3112 => 
          array (
            'id' => '3112',
            'name' => '旬阳县',
          ),
          3113 => 
          array (
            'id' => '3113',
            'name' => '白河县',
          ),
        ),
      ),
      334 => 
      array (
        'id' => '334',
        'name' => '商洛市',
        'child' => 
        array (
          3114 => 
          array (
            'id' => '3114',
            'name' => '商州区',
          ),
          3115 => 
          array (
            'id' => '3115',
            'name' => '洛南县',
          ),
          3116 => 
          array (
            'id' => '3116',
            'name' => '丹凤县',
          ),
          3117 => 
          array (
            'id' => '3117',
            'name' => '商南县',
          ),
          3118 => 
          array (
            'id' => '3118',
            'name' => '山阳县',
          ),
          3119 => 
          array (
            'id' => '3119',
            'name' => '镇安县',
          ),
          3120 => 
          array (
            'id' => '3120',
            'name' => '柞水县',
          ),
        ),
      ),
    ),
  ),
  29 => 
  array (
    'id' => '29',
    'name' => '甘肃省',
    'child' => 
    array (
      335 => 
      array (
        'id' => '335',
        'name' => '兰州市',
        'child' => 
        array (
          3121 => 
          array (
            'id' => '3121',
            'name' => '城关区',
          ),
          3122 => 
          array (
            'id' => '3122',
            'name' => '七里河区',
          ),
          3123 => 
          array (
            'id' => '3123',
            'name' => '西固区',
          ),
          3124 => 
          array (
            'id' => '3124',
            'name' => '安宁区',
          ),
          3125 => 
          array (
            'id' => '3125',
            'name' => '红古区',
          ),
          3126 => 
          array (
            'id' => '3126',
            'name' => '永登县',
          ),
          3127 => 
          array (
            'id' => '3127',
            'name' => '皋兰县',
          ),
          3128 => 
          array (
            'id' => '3128',
            'name' => '榆中县',
          ),
        ),
      ),
      336 => 
      array (
        'id' => '336',
        'name' => '嘉峪关市',
        'child' => 
        array (
          3129 => 
          array (
            'id' => '3129',
            'name' => '嘉峪关市',
          ),
        ),
      ),
      337 => 
      array (
        'id' => '337',
        'name' => '金昌市',
        'child' => 
        array (
          3130 => 
          array (
            'id' => '3130',
            'name' => '金川区',
          ),
          3131 => 
          array (
            'id' => '3131',
            'name' => '永昌县',
          ),
        ),
      ),
      338 => 
      array (
        'id' => '338',
        'name' => '白银市',
        'child' => 
        array (
          3132 => 
          array (
            'id' => '3132',
            'name' => '白银区',
          ),
          3133 => 
          array (
            'id' => '3133',
            'name' => '平川区',
          ),
          3134 => 
          array (
            'id' => '3134',
            'name' => '靖远县',
          ),
          3135 => 
          array (
            'id' => '3135',
            'name' => '会宁县',
          ),
          3136 => 
          array (
            'id' => '3136',
            'name' => '景泰县',
          ),
        ),
      ),
      339 => 
      array (
        'id' => '339',
        'name' => '天水市',
        'child' => 
        array (
          3137 => 
          array (
            'id' => '3137',
            'name' => '秦州区',
          ),
          3138 => 
          array (
            'id' => '3138',
            'name' => '麦积区',
          ),
          3139 => 
          array (
            'id' => '3139',
            'name' => '清水县',
          ),
          3140 => 
          array (
            'id' => '3140',
            'name' => '秦安县',
          ),
          3141 => 
          array (
            'id' => '3141',
            'name' => '甘谷县',
          ),
          3142 => 
          array (
            'id' => '3142',
            'name' => '武山县',
          ),
          3143 => 
          array (
            'id' => '3143',
            'name' => '张家川回族自治县',
          ),
        ),
      ),
      340 => 
      array (
        'id' => '340',
        'name' => '武威市',
        'child' => 
        array (
          3144 => 
          array (
            'id' => '3144',
            'name' => '凉州区',
          ),
          3145 => 
          array (
            'id' => '3145',
            'name' => '民勤县',
          ),
          3146 => 
          array (
            'id' => '3146',
            'name' => '古浪县',
          ),
          3147 => 
          array (
            'id' => '3147',
            'name' => '天祝藏族自治县',
          ),
        ),
      ),
      341 => 
      array (
        'id' => '341',
        'name' => '张掖市',
        'child' => 
        array (
          3148 => 
          array (
            'id' => '3148',
            'name' => '甘州区',
          ),
          3149 => 
          array (
            'id' => '3149',
            'name' => '肃南裕固族自治县',
          ),
          3150 => 
          array (
            'id' => '3150',
            'name' => '民乐县',
          ),
          3151 => 
          array (
            'id' => '3151',
            'name' => '临泽县',
          ),
          3152 => 
          array (
            'id' => '3152',
            'name' => '高台县',
          ),
          3153 => 
          array (
            'id' => '3153',
            'name' => '山丹县',
          ),
        ),
      ),
      342 => 
      array (
        'id' => '342',
        'name' => '平凉市',
        'child' => 
        array (
          3154 => 
          array (
            'id' => '3154',
            'name' => '崆峒区',
          ),
          3155 => 
          array (
            'id' => '3155',
            'name' => '泾川县',
          ),
          3156 => 
          array (
            'id' => '3156',
            'name' => '灵台县',
          ),
          3157 => 
          array (
            'id' => '3157',
            'name' => '崇信县',
          ),
          3158 => 
          array (
            'id' => '3158',
            'name' => '华亭县',
          ),
          3159 => 
          array (
            'id' => '3159',
            'name' => '庄浪县',
          ),
          3160 => 
          array (
            'id' => '3160',
            'name' => '静宁县',
          ),
        ),
      ),
      343 => 
      array (
        'id' => '343',
        'name' => '酒泉市',
        'child' => 
        array (
          3161 => 
          array (
            'id' => '3161',
            'name' => '肃州区',
          ),
          3162 => 
          array (
            'id' => '3162',
            'name' => '金塔县',
          ),
          3163 => 
          array (
            'id' => '3163',
            'name' => '安西县',
          ),
          3164 => 
          array (
            'id' => '3164',
            'name' => '肃北蒙古族自治县',
          ),
          3165 => 
          array (
            'id' => '3165',
            'name' => '阿克塞哈萨克族自治县',
          ),
          3166 => 
          array (
            'id' => '3166',
            'name' => '玉门市',
          ),
          3167 => 
          array (
            'id' => '3167',
            'name' => '敦煌市',
          ),
        ),
      ),
      344 => 
      array (
        'id' => '344',
        'name' => '庆阳市',
        'child' => 
        array (
          3168 => 
          array (
            'id' => '3168',
            'name' => '西峰区',
          ),
          3169 => 
          array (
            'id' => '3169',
            'name' => '庆城县',
          ),
          3170 => 
          array (
            'id' => '3170',
            'name' => '环县',
          ),
          3171 => 
          array (
            'id' => '3171',
            'name' => '华池县',
          ),
          3172 => 
          array (
            'id' => '3172',
            'name' => '合水县',
          ),
          3173 => 
          array (
            'id' => '3173',
            'name' => '正宁县',
          ),
          3174 => 
          array (
            'id' => '3174',
            'name' => '宁县',
          ),
          3175 => 
          array (
            'id' => '3175',
            'name' => '镇原县',
          ),
        ),
      ),
      345 => 
      array (
        'id' => '345',
        'name' => '定西市',
        'child' => 
        array (
          3176 => 
          array (
            'id' => '3176',
            'name' => '安定区',
          ),
          3177 => 
          array (
            'id' => '3177',
            'name' => '通渭县',
          ),
          3178 => 
          array (
            'id' => '3178',
            'name' => '陇西县',
          ),
          3179 => 
          array (
            'id' => '3179',
            'name' => '渭源县',
          ),
          3180 => 
          array (
            'id' => '3180',
            'name' => '临洮县',
          ),
          3181 => 
          array (
            'id' => '3181',
            'name' => '漳县',
          ),
          3182 => 
          array (
            'id' => '3182',
            'name' => '岷县',
          ),
        ),
      ),
      346 => 
      array (
        'id' => '346',
        'name' => '陇南市',
        'child' => 
        array (
          3183 => 
          array (
            'id' => '3183',
            'name' => '武都区',
          ),
          3184 => 
          array (
            'id' => '3184',
            'name' => '成县',
          ),
          3185 => 
          array (
            'id' => '3185',
            'name' => '文县',
          ),
          3186 => 
          array (
            'id' => '3186',
            'name' => '宕昌县',
          ),
          3187 => 
          array (
            'id' => '3187',
            'name' => '康县',
          ),
          3188 => 
          array (
            'id' => '3188',
            'name' => '西和县',
          ),
          3189 => 
          array (
            'id' => '3189',
            'name' => '礼县',
          ),
          3190 => 
          array (
            'id' => '3190',
            'name' => '徽县',
          ),
          3191 => 
          array (
            'id' => '3191',
            'name' => '两当县',
          ),
        ),
      ),
      347 => 
      array (
        'id' => '347',
        'name' => '临夏回族自治州',
        'child' => 
        array (
          3192 => 
          array (
            'id' => '3192',
            'name' => '临夏市',
          ),
          3193 => 
          array (
            'id' => '3193',
            'name' => '临夏县',
          ),
          3194 => 
          array (
            'id' => '3194',
            'name' => '康乐县',
          ),
          3195 => 
          array (
            'id' => '3195',
            'name' => '永靖县',
          ),
          3196 => 
          array (
            'id' => '3196',
            'name' => '广河县',
          ),
          3197 => 
          array (
            'id' => '3197',
            'name' => '和政县',
          ),
          3198 => 
          array (
            'id' => '3198',
            'name' => '东乡族自治县',
          ),
          3199 => 
          array (
            'id' => '3199',
            'name' => '积石山保安族东乡族撒拉族自治县',
          ),
        ),
      ),
      348 => 
      array (
        'id' => '348',
        'name' => '甘南藏族自治州',
        'child' => 
        array (
          3200 => 
          array (
            'id' => '3200',
            'name' => '合作市',
          ),
          3201 => 
          array (
            'id' => '3201',
            'name' => '临潭县',
          ),
          3202 => 
          array (
            'id' => '3202',
            'name' => '卓尼县',
          ),
          3203 => 
          array (
            'id' => '3203',
            'name' => '舟曲县',
          ),
          3204 => 
          array (
            'id' => '3204',
            'name' => '迭部县',
          ),
          3205 => 
          array (
            'id' => '3205',
            'name' => '玛曲县',
          ),
          3206 => 
          array (
            'id' => '3206',
            'name' => '碌曲县',
          ),
          3207 => 
          array (
            'id' => '3207',
            'name' => '夏河县',
          ),
        ),
      ),
    ),
  ),
  30 => 
  array (
    'id' => '30',
    'name' => '青海省',
    'child' => 
    array (
      349 => 
      array (
        'id' => '349',
        'name' => '西宁市',
        'child' => 
        array (
          3208 => 
          array (
            'id' => '3208',
            'name' => '城东区',
          ),
          3209 => 
          array (
            'id' => '3209',
            'name' => '城中区',
          ),
          3210 => 
          array (
            'id' => '3210',
            'name' => '城西区',
          ),
          3211 => 
          array (
            'id' => '3211',
            'name' => '城北区',
          ),
          3212 => 
          array (
            'id' => '3212',
            'name' => '大通回族土族自治县',
          ),
          3213 => 
          array (
            'id' => '3213',
            'name' => '湟中县',
          ),
          3214 => 
          array (
            'id' => '3214',
            'name' => '湟源县',
          ),
        ),
      ),
      350 => 
      array (
        'id' => '350',
        'name' => '海东地区',
        'child' => 
        array (
          3215 => 
          array (
            'id' => '3215',
            'name' => '平安县',
          ),
          3216 => 
          array (
            'id' => '3216',
            'name' => '民和回族土族自治县',
          ),
          3217 => 
          array (
            'id' => '3217',
            'name' => '乐都县',
          ),
          3218 => 
          array (
            'id' => '3218',
            'name' => '互助土族自治县',
          ),
          3219 => 
          array (
            'id' => '3219',
            'name' => '化隆回族自治县',
          ),
          3220 => 
          array (
            'id' => '3220',
            'name' => '循化撒拉族自治县',
          ),
        ),
      ),
      351 => 
      array (
        'id' => '351',
        'name' => '海北藏族自治州',
        'child' => 
        array (
          3221 => 
          array (
            'id' => '3221',
            'name' => '门源回族自治县',
          ),
          3222 => 
          array (
            'id' => '3222',
            'name' => '祁连县',
          ),
          3223 => 
          array (
            'id' => '3223',
            'name' => '海晏县',
          ),
          3224 => 
          array (
            'id' => '3224',
            'name' => '刚察县',
          ),
        ),
      ),
      352 => 
      array (
        'id' => '352',
        'name' => '黄南藏族自治州',
        'child' => 
        array (
          3225 => 
          array (
            'id' => '3225',
            'name' => '同仁县',
          ),
          3226 => 
          array (
            'id' => '3226',
            'name' => '尖扎县',
          ),
          3227 => 
          array (
            'id' => '3227',
            'name' => '泽库县',
          ),
          3228 => 
          array (
            'id' => '3228',
            'name' => '河南蒙古族自治县',
          ),
        ),
      ),
      353 => 
      array (
        'id' => '353',
        'name' => '海南藏族自治州',
        'child' => 
        array (
          3229 => 
          array (
            'id' => '3229',
            'name' => '共和县',
          ),
          3230 => 
          array (
            'id' => '3230',
            'name' => '同德县',
          ),
          3231 => 
          array (
            'id' => '3231',
            'name' => '贵德县',
          ),
          3232 => 
          array (
            'id' => '3232',
            'name' => '兴海县',
          ),
          3233 => 
          array (
            'id' => '3233',
            'name' => '贵南县',
          ),
        ),
      ),
      354 => 
      array (
        'id' => '354',
        'name' => '果洛藏族自治州',
        'child' => 
        array (
          3234 => 
          array (
            'id' => '3234',
            'name' => '玛沁县',
          ),
          3235 => 
          array (
            'id' => '3235',
            'name' => '班玛县',
          ),
          3236 => 
          array (
            'id' => '3236',
            'name' => '甘德县',
          ),
          3237 => 
          array (
            'id' => '3237',
            'name' => '达日县',
          ),
          3238 => 
          array (
            'id' => '3238',
            'name' => '久治县',
          ),
          3239 => 
          array (
            'id' => '3239',
            'name' => '玛多县',
          ),
        ),
      ),
      355 => 
      array (
        'id' => '355',
        'name' => '玉树藏族自治州',
        'child' => 
        array (
          3240 => 
          array (
            'id' => '3240',
            'name' => '玉树县',
          ),
          3241 => 
          array (
            'id' => '3241',
            'name' => '杂多县',
          ),
          3242 => 
          array (
            'id' => '3242',
            'name' => '称多县',
          ),
          3243 => 
          array (
            'id' => '3243',
            'name' => '治多县',
          ),
          3244 => 
          array (
            'id' => '3244',
            'name' => '囊谦县',
          ),
          3245 => 
          array (
            'id' => '3245',
            'name' => '曲麻莱县',
          ),
        ),
      ),
      356 => 
      array (
        'id' => '356',
        'name' => '海西蒙古族藏族自治州',
        'child' => 
        array (
          3246 => 
          array (
            'id' => '3246',
            'name' => '格尔木市',
          ),
          3247 => 
          array (
            'id' => '3247',
            'name' => '德令哈市',
          ),
          3248 => 
          array (
            'id' => '3248',
            'name' => '乌兰县',
          ),
          3249 => 
          array (
            'id' => '3249',
            'name' => '都兰县',
          ),
          3250 => 
          array (
            'id' => '3250',
            'name' => '天峻县',
          ),
          3251 => 
          array (
            'id' => '3251',
            'name' => '大柴旦行委',
          ),
        ),
      ),
    ),
  ),
  31 => 
  array (
    'id' => '31',
    'name' => '宁夏回族自治区',
    'child' => 
    array (
      357 => 
      array (
        'id' => '357',
        'name' => '银川市',
        'child' => 
        array (
          3252 => 
          array (
            'id' => '3252',
            'name' => '兴庆区',
          ),
          3253 => 
          array (
            'id' => '3253',
            'name' => '西夏区',
          ),
          3254 => 
          array (
            'id' => '3254',
            'name' => '金凤区',
          ),
          3255 => 
          array (
            'id' => '3255',
            'name' => '永宁县',
          ),
          3256 => 
          array (
            'id' => '3256',
            'name' => '贺兰县',
          ),
          3257 => 
          array (
            'id' => '3257',
            'name' => '灵武市',
          ),
        ),
      ),
      358 => 
      array (
        'id' => '358',
        'name' => '石嘴山市',
        'child' => 
        array (
          3258 => 
          array (
            'id' => '3258',
            'name' => '大武口区',
          ),
          3259 => 
          array (
            'id' => '3259',
            'name' => '惠农区',
          ),
          3260 => 
          array (
            'id' => '3260',
            'name' => '平罗县',
          ),
        ),
      ),
      359 => 
      array (
        'id' => '359',
        'name' => '吴忠市',
        'child' => 
        array (
          3261 => 
          array (
            'id' => '3261',
            'name' => '利通区',
          ),
          3262 => 
          array (
            'id' => '3262',
            'name' => '盐池县',
          ),
          3263 => 
          array (
            'id' => '3263',
            'name' => '同心县',
          ),
          3264 => 
          array (
            'id' => '3264',
            'name' => '青铜峡市',
          ),
          3265 => 
          array (
            'id' => '3265',
            'name' => '红寺堡区',
          ),
        ),
      ),
      360 => 
      array (
        'id' => '360',
        'name' => '固原市',
        'child' => 
        array (
          3266 => 
          array (
            'id' => '3266',
            'name' => '原州区',
          ),
          3267 => 
          array (
            'id' => '3267',
            'name' => '西吉县',
          ),
          3268 => 
          array (
            'id' => '3268',
            'name' => '隆德县',
          ),
          3269 => 
          array (
            'id' => '3269',
            'name' => '泾源县',
          ),
          3270 => 
          array (
            'id' => '3270',
            'name' => '彭阳县',
          ),
        ),
      ),
      361 => 
      array (
        'id' => '361',
        'name' => '中卫市',
        'child' => 
        array (
          3271 => 
          array (
            'id' => '3271',
            'name' => '沙坡头区',
          ),
          3272 => 
          array (
            'id' => '3272',
            'name' => '中宁县',
          ),
          3273 => 
          array (
            'id' => '3273',
            'name' => '海原县',
          ),
        ),
      ),
    ),
  ),
  32 => 
  array (
    'id' => '32',
    'name' => '新疆维吾尔族自治区',
    'child' => 
    array (
      362 => 
      array (
        'id' => '362',
        'name' => '乌鲁木齐市',
        'child' => 
        array (
          3274 => 
          array (
            'id' => '3274',
            'name' => '天山区',
          ),
          3275 => 
          array (
            'id' => '3275',
            'name' => '沙依巴克区',
          ),
          3276 => 
          array (
            'id' => '3276',
            'name' => '新市区',
          ),
          3277 => 
          array (
            'id' => '3277',
            'name' => '水磨沟区',
          ),
          3278 => 
          array (
            'id' => '3278',
            'name' => '头屯河区',
          ),
          3279 => 
          array (
            'id' => '3279',
            'name' => '达坂城区',
          ),
          3280 => 
          array (
            'id' => '3280',
            'name' => '米东区',
          ),
          3281 => 
          array (
            'id' => '3281',
            'name' => '乌鲁木齐县',
          ),
        ),
      ),
      363 => 
      array (
        'id' => '363',
        'name' => '克拉玛依市',
        'child' => 
        array (
          3282 => 
          array (
            'id' => '3282',
            'name' => '独山子区',
          ),
          3283 => 
          array (
            'id' => '3283',
            'name' => '克拉玛依区',
          ),
          3284 => 
          array (
            'id' => '3284',
            'name' => '白碱滩区',
          ),
          3285 => 
          array (
            'id' => '3285',
            'name' => '乌尔禾区',
          ),
        ),
      ),
      364 => 
      array (
        'id' => '364',
        'name' => '吐鲁番地区',
        'child' => 
        array (
          3286 => 
          array (
            'id' => '3286',
            'name' => '吐鲁番市',
          ),
          3287 => 
          array (
            'id' => '3287',
            'name' => '鄯善县',
          ),
          3288 => 
          array (
            'id' => '3288',
            'name' => '托克逊县',
          ),
        ),
      ),
      365 => 
      array (
        'id' => '365',
        'name' => '哈密地区',
        'child' => 
        array (
          3289 => 
          array (
            'id' => '3289',
            'name' => '哈密市',
          ),
          3290 => 
          array (
            'id' => '3290',
            'name' => '巴里坤哈萨克自治县',
          ),
          3291 => 
          array (
            'id' => '3291',
            'name' => '伊吾县',
          ),
        ),
      ),
      366 => 
      array (
        'id' => '366',
        'name' => '昌吉回族自治州',
        'child' => 
        array (
          3292 => 
          array (
            'id' => '3292',
            'name' => '昌吉市',
          ),
          3293 => 
          array (
            'id' => '3293',
            'name' => '阜康市',
          ),
          3294 => 
          array (
            'id' => '3294',
            'name' => '米泉市',
          ),
          3295 => 
          array (
            'id' => '3295',
            'name' => '呼图壁县',
          ),
          3296 => 
          array (
            'id' => '3296',
            'name' => '玛纳斯县',
          ),
          3297 => 
          array (
            'id' => '3297',
            'name' => '奇台县',
          ),
          3298 => 
          array (
            'id' => '3298',
            'name' => '吉木萨尔县',
          ),
          3299 => 
          array (
            'id' => '3299',
            'name' => '木垒哈萨克自治县',
          ),
        ),
      ),
      367 => 
      array (
        'id' => '367',
        'name' => '博尔塔拉蒙古自治州',
        'child' => 
        array (
          3300 => 
          array (
            'id' => '3300',
            'name' => '博乐市',
          ),
          3301 => 
          array (
            'id' => '3301',
            'name' => '精河县',
          ),
          3302 => 
          array (
            'id' => '3302',
            'name' => '温泉县',
          ),
        ),
      ),
      368 => 
      array (
        'id' => '368',
        'name' => '巴音郭楞蒙古自治州',
        'child' => 
        array (
          3303 => 
          array (
            'id' => '3303',
            'name' => '库尔勒市',
          ),
          3304 => 
          array (
            'id' => '3304',
            'name' => '轮台县',
          ),
          3305 => 
          array (
            'id' => '3305',
            'name' => '尉犁县',
          ),
          3306 => 
          array (
            'id' => '3306',
            'name' => '若羌县',
          ),
          3307 => 
          array (
            'id' => '3307',
            'name' => '且末县',
          ),
          3308 => 
          array (
            'id' => '3308',
            'name' => '焉耆回族自治县',
          ),
          3309 => 
          array (
            'id' => '3309',
            'name' => '和静县',
          ),
          3310 => 
          array (
            'id' => '3310',
            'name' => '和硕县',
          ),
          3311 => 
          array (
            'id' => '3311',
            'name' => '博湖县',
          ),
        ),
      ),
      369 => 
      array (
        'id' => '369',
        'name' => '阿克苏地区',
        'child' => 
        array (
          3312 => 
          array (
            'id' => '3312',
            'name' => '阿克苏市',
          ),
          3313 => 
          array (
            'id' => '3313',
            'name' => '温宿县',
          ),
          3314 => 
          array (
            'id' => '3314',
            'name' => '库车县',
          ),
          3315 => 
          array (
            'id' => '3315',
            'name' => '沙雅县',
          ),
          3316 => 
          array (
            'id' => '3316',
            'name' => '新和县',
          ),
          3317 => 
          array (
            'id' => '3317',
            'name' => '拜城县',
          ),
          3318 => 
          array (
            'id' => '3318',
            'name' => '乌什县',
          ),
          3319 => 
          array (
            'id' => '3319',
            'name' => '阿瓦提县',
          ),
          3320 => 
          array (
            'id' => '3320',
            'name' => '柯坪县',
          ),
        ),
      ),
      370 => 
      array (
        'id' => '370',
        'name' => '克孜勒苏柯尔克孜自治州',
        'child' => 
        array (
          3321 => 
          array (
            'id' => '3321',
            'name' => '阿图什市',
          ),
          3322 => 
          array (
            'id' => '3322',
            'name' => '阿克陶县',
          ),
          3323 => 
          array (
            'id' => '3323',
            'name' => '阿合奇县',
          ),
          3324 => 
          array (
            'id' => '3324',
            'name' => '乌恰县',
          ),
        ),
      ),
      371 => 
      array (
        'id' => '371',
        'name' => '喀什地区',
        'child' => 
        array (
          3325 => 
          array (
            'id' => '3325',
            'name' => '喀什市',
          ),
          3326 => 
          array (
            'id' => '3326',
            'name' => '疏附县',
          ),
          3327 => 
          array (
            'id' => '3327',
            'name' => '疏勒县',
          ),
          3328 => 
          array (
            'id' => '3328',
            'name' => '英吉沙县',
          ),
          3329 => 
          array (
            'id' => '3329',
            'name' => '泽普县',
          ),
          3330 => 
          array (
            'id' => '3330',
            'name' => '莎车县',
          ),
          3331 => 
          array (
            'id' => '3331',
            'name' => '叶城县',
          ),
          3332 => 
          array (
            'id' => '3332',
            'name' => '麦盖提县',
          ),
          3333 => 
          array (
            'id' => '3333',
            'name' => '岳普湖县',
          ),
          3334 => 
          array (
            'id' => '3334',
            'name' => '伽师县',
          ),
          3335 => 
          array (
            'id' => '3335',
            'name' => '巴楚县',
          ),
          3336 => 
          array (
            'id' => '3336',
            'name' => '塔什库尔干塔吉克自治县',
          ),
        ),
      ),
      372 => 
      array (
        'id' => '372',
        'name' => '和田地区',
        'child' => 
        array (
          3337 => 
          array (
            'id' => '3337',
            'name' => '和田市',
          ),
          3338 => 
          array (
            'id' => '3338',
            'name' => '和田县',
          ),
          3339 => 
          array (
            'id' => '3339',
            'name' => '墨玉县',
          ),
          3340 => 
          array (
            'id' => '3340',
            'name' => '皮山县',
          ),
          3341 => 
          array (
            'id' => '3341',
            'name' => '洛浦县',
          ),
          3342 => 
          array (
            'id' => '3342',
            'name' => '策勒县',
          ),
          3343 => 
          array (
            'id' => '3343',
            'name' => '于田县',
          ),
          3344 => 
          array (
            'id' => '3344',
            'name' => '民丰县',
          ),
        ),
      ),
      373 => 
      array (
        'id' => '373',
        'name' => '伊犁哈萨克自治州',
        'child' => 
        array (
          3345 => 
          array (
            'id' => '3345',
            'name' => '伊宁市',
          ),
          3346 => 
          array (
            'id' => '3346',
            'name' => '奎屯市',
          ),
          3347 => 
          array (
            'id' => '3347',
            'name' => '伊宁县',
          ),
          3348 => 
          array (
            'id' => '3348',
            'name' => '察布查尔锡伯自治县',
          ),
          3349 => 
          array (
            'id' => '3349',
            'name' => '霍城县',
          ),
          3350 => 
          array (
            'id' => '3350',
            'name' => '巩留县',
          ),
          3351 => 
          array (
            'id' => '3351',
            'name' => '新源县',
          ),
          3352 => 
          array (
            'id' => '3352',
            'name' => '昭苏县',
          ),
          3353 => 
          array (
            'id' => '3353',
            'name' => '特克斯县',
          ),
          3354 => 
          array (
            'id' => '3354',
            'name' => '尼勒克县',
          ),
        ),
      ),
      374 => 
      array (
        'id' => '374',
        'name' => '塔城地区',
        'child' => 
        array (
          3355 => 
          array (
            'id' => '3355',
            'name' => '塔城市',
          ),
          3356 => 
          array (
            'id' => '3356',
            'name' => '乌苏市',
          ),
          3357 => 
          array (
            'id' => '3357',
            'name' => '额敏县',
          ),
          3358 => 
          array (
            'id' => '3358',
            'name' => '沙湾县',
          ),
          3359 => 
          array (
            'id' => '3359',
            'name' => '托里县',
          ),
          3360 => 
          array (
            'id' => '3360',
            'name' => '裕民县',
          ),
          3361 => 
          array (
            'id' => '3361',
            'name' => '和布克赛尔蒙古自治县',
          ),
        ),
      ),
      375 => 
      array (
        'id' => '375',
        'name' => '阿勒泰地区',
        'child' => 
        array (
          3362 => 
          array (
            'id' => '3362',
            'name' => '阿勒泰市',
          ),
          3363 => 
          array (
            'id' => '3363',
            'name' => '布尔津县',
          ),
          3364 => 
          array (
            'id' => '3364',
            'name' => '富蕴县',
          ),
          3365 => 
          array (
            'id' => '3365',
            'name' => '福海县',
          ),
          3366 => 
          array (
            'id' => '3366',
            'name' => '哈巴河县',
          ),
          3367 => 
          array (
            'id' => '3367',
            'name' => '青河县',
          ),
          3368 => 
          array (
            'id' => '3368',
            'name' => '吉木乃县',
          ),
        ),
      ),
      376 => 
      array (
        'id' => '376',
        'name' => '省直辖县级行政单位',
        'child' => 
        array (
          3369 => 
          array (
            'id' => '3369',
            'name' => '石河子市',
          ),
          3370 => 
          array (
            'id' => '3370',
            'name' => '阿拉尔市',
          ),
          3371 => 
          array (
            'id' => '3371',
            'name' => '图木舒克市',
          ),
          3372 => 
          array (
            'id' => '3372',
            'name' => '五家渠市',
          ),
        ),
      ),
    ),
  ),
);
?>